[
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Comunicação e Expressão",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTCEXP",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Língua Portuguesa na prática docente.",
        "Ementa": "O componente curricular apresenta uma visão geral do fenômeno da linguagem, nas suas \nexpressões orais e escritas, propondo uma revisão de conceitos gerais da gramática normativa e \nda escrita acadêmica. Para isso, discute problemas de gramática e produção de texto articulando \nnoções teóricas com exemplos reais de uso, de forma a abordar pontos importantes para o \nletramento acadêmico, como concordância, coesão textual e estrutura de textos argumentativos \ne acadêmicos. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n84 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Realizar um estudo da Língua Portuguesa, contextualizado na prática docente, englobando \na abordagem de capacidades, estratégias de leitura, interpretação, produção oral, escrita \ne documentação de textos acadêmicos e científicos, reconhecendo sua importância social \ne cultural; \n2. Compreender a relação da leitura e da escrita com o mundo; \n3. Proporcionar uma revisão dos principais aspectos e conceitos da norma gramatical em sua \nmodalidade culta; \n4. Proporcionar ao aluno condições para refletir sobre a língua e fazer uso das normas da \nlíngua culta, padrão, de prestígio social, quando a situação assim o exigir; \n5. Expressar-se por meio da Língua Portuguesa de maneira harmônica, clara e concisa, escrita \ne oralmente; \n6. Aprofundar o conhecimento acerca da estruturação de textos, observando as tipologias e \nmultiplicidades de gêneros textuais; \n7. Perceber e analisar as principais diferenças entre um texto oral e um texto escrito; \n8. Saber distinguir um texto acadêmico de um texto não acadêmico; \n9. Saber revisar, refletir e reelaborar os seus próprios textos.",
        "Conteúdo Programático": "1. Linguagem e variação; \n2. Linguagem verbal e não verbal; \n3. Língua oral e língua escrita; \n4. Norma gramatical e variedades do português brasileiro; \n5. Revisão gramatical: concordância nominal e verbal; \n6. Revisão gramatical: regência nominal e verbal; \n7. Revisão gramatical: acentuação e pontuação; \n8. Noção de texto: textualidade, coesão e coerência; \n9. Tipologia textual; \n10. Gêneros textuais; \n11. Texto argumentativo; \n12. Gêneros acadêmicos: resumo e resenha; \n13. Gêneros acadêmicos: apresentação oral e artigo; \n14. Gêneros acadêmicos: relatório e monografia. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n85 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Conjuntos e Funções",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTCJFC",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Funções e Cálculo Diferencial e Integral.",
        "Ementa": "O componente Conjuntos e Funções estuda tópicos de elementares sobre conjuntos e algumas \nfunções elementares a partir da óptica do Ensino Médio e aprofunda conceitos e definições. O \nestudo dos conjuntos parte das noções básicas, símbolos, nomenclaturas, relações, operações e \ndireciona-se os conjuntos numéricos e suas propriedades e alguns princípios como o da indução \nfinita. O processo de construção do conceito de função é feito a partir dos conceitos de grandezas, \nvariáveis e análise da existência de dependência entre elas. A partir de funções entre variáveis \ndependentes e de seus comportamentos, conceitos como domínio, imagem, raízes, sinal e pontos \nde máximo e mínimo serão aprofundados. Diferentes funções serão utilizadas para resolver \nsituações-problema do cotidiano ou teóricas, enfatizando-se as relações com as questões \nsocioambientais e com outras ciências, tais como a Física, Química, Engenharia, entre outras. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n87 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nAborda as funções constantes e polinomiais do primeiro e segundo graus, assim como funções \nmodulares, pares e ímpares.",
        "Objetivos": "1. Compreender o conceito de função como um caso particular de relação, e ampliar o estudo \nde seu comportamento por meio de conceitos do Cálculo Diferencial e Integral, articulados \ncom outras áreas do conhecimento e com a Educação Básica; \n2. Ler e interpretar diferentes linguagens e representações envolvendo variações de \ngrandezas;  \n3. Reconhecer e utilizar a linguagem algébrica nas ciências, expressar a relação entre \ngrandezas e modelar situações-problema, construir modelos descritivos de fenômenos, \nfazendo conexões dentro e fora da Matemática; \n4. Compreender função como uma relação entre duas variáveis e representar e reconhecer \ngraficamente essa relação; \n5. Relacionar os conceitos de funções estudados no Ensino Médio entre si de modo a \naprofundar o estudo de diferentes tipos de dependência entre variáveis (afim, quadrática, \nmodular; \n6. Fornecer ao futuro egresso competências que dêem suporte a outros componentes \ncurriculares, ao exercício da docência e/ou prosseguimento para carreira acadêmica.",
        "Conteúdo Programático": "1. Conjuntos: noções elementares, definições, propriedades e operações entre conjuntos. \n2. Conjuntos numéricos: conjuntos dos números naturais, inteiros, racionais e reais. \n3. Princípio da Indução Finita. \n4. Função afim: propriedades, gráfico, zero da função, funções monótonas, sinal da função, \ninequações.  \n5. Função quadrática: propriedades, gráfico, eixo de simetria, zeros, máximo e mínimo, sinal \nda função, inequações.  \n6. Função modular: módulo de um número real, função definida por mais de uma sentença \naberta, gráfico, equações e inequações modulares.  \n7. Outras funções elementares: função recíproca, qualidade das funções, função inversa e \ncomposta.  \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n88 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Didática",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTDIDT",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Pedagógicos / 2. Didática / 2.1 Ensino e aprendizagem; \nConhecimentos Pedagógicos / 2. Didática / 2.2 Planejamento e avaliação; \nConhecimentos Pedagógicos / 2. Didática / 2.3 Métodos e técnicas de ensino; \nConhecimentos Pedagógicos / 2. Didática / 2.4 Tecnologia e Mídias.",
        "Ementa": "Este componente curricular contribui para a formação de professores a partir da construção de \nreferenciais teórico-práticos que sustentam a prática docente e orientam o exercício da profissão \nnos diferentes contextos e situações, conduzindo à conscientização da aula como uma atividade \nintencional, planejada e pautada em determinadas concepções de homem, educação e sociedade. \nAborda as especificidades e os elementos estruturantes do trabalho docente, analisa processos e \nestratégias de ensino e aprendizagem, estuda diferentes teorias e tendências pedagógicas, a \nrelação professor-aluno-conhecimento, a mediação pedagógica e o planejamento educacional \nem seus contextos macro e micro. Discute a avaliação educacional e sua relação com o sucesso \nou fracasso do aluno, contribuindo para a formação de professores crítico-reflexivos que \ncompreendem o significado ético, social, político e pedagógico do papel do professor de \nMatemática na escola.  \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n90 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Propiciar condições de reflexão sobre a evolução histórica do ensino e da educação, suas \ndiferentes abordagens no processo de ensino e suas repercussões no cotidiano da escola; \n2. Compreender o ensino como prática social contextualizada;  \n3. Analisar a relação professor-aluno-conhecimento e sua mediação; \n4. Construir referenciais teórico-metodológicos relativos à organização do trabalho \npedagógico na escola relacionados ao planejamento, à avaliação e ao acompanhamento \ndos processos de aprendizagem;  \n5. Refletir sobre questões relacionadas à prática pedagógica no cotidiano escolar, mediadas \npela teoria;  \n6. Compreender as dimensões e relevância do projeto pedagógico na escola, bem como o \ndesenvolvimento de práticas de avaliação formativa e inclusivas.",
        "Conteúdo Programático": "1. Definição, história e papel da Didática na formação de professores; \n2. Papel da educação, da escola, do professor e do aluno; \n3. Pensamento didático: alguns autores e suas ideias;  \n4. Análise dos processos de ensino e aprendizagem; \n5. As relações com o saber e a mediação do professor; \n6. A relação pedagógica como cerne da Didática: os vínculos entre professor, aluno e \nconhecimento; \n7. Teorias e tendências pedagógicas e suas implicações no ensino e na aprendizagem em \ndiferentes contextos sócio-históricos; \n8. Fundamentos e processos de aprendizagem, nos diferentes níveis e modalidades de ensino \npara a compreensão da realidade; \n9. Estratégias e recursos de ensino e aprendizagem;  \n10. A aula como objeto da Didática e como ação pedagógica para a promoção humana; \n11. Planejamento educacional: reflexões teóricas, conceituais e práticas, considerando \ncontextos macro e micro e sua articulação com o currículo, a avaliação e o projeto político \npedagógico da escola; \n12. Planejamento educacional: concepção, preparação, realização e avaliação; \n13. Funções da avaliação educacional; \n14. A avaliação da aprendizagem como processo contínuo e formativo; \n15. Relação entre avaliação da aprendizagem e planejamento; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n91 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n16. Práxis como eixo do trabalho pedagógico; \n17. Cotidiano da escola como um espaço/tempo de pesquisa e formação continuada; \n18. Metodologias de aprendizagem ativas e colaborativas; \n19. A pesquisa e interdisciplinaridade como método pedagógico; \n20. Práticas pedagógicas inclusivas; \n21. Transversalidade na educação; \n22. Tecnologias digitais no processo de ensino e aprendizagem; \n23. Ação pedagógica mediada por recursos tecnológicos e sua relação com a equidade e \njustiça social; \n24. Formação docente e identidade profissional no contexto político-educacional \ncontemporâneo; \n25. Disciplina e indisciplina: conflitos, mitos e reflexões. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n92 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Educação em Direitos Humanos",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTEDHM",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.2 Sociologia da Educação; \nConhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.3 História da Educação; \nConhecimentos Pedagógicos / 4. Política e Organização da Educação Brasileira / 4.2 Legislação; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão / 5.1 Educação especial; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão / 5.2 Educação para as \nrelações étnico- raciais e indígenas; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão / 5.3 Educação em \nDireitos Humanos.",
        "Ementa": "Este componente aborda questões referentes à dignidade humana, igualdade de direitos, \nreconhecimento e valorização das diferenças e das diferenças, laicidade do Estado, democracia na \neducação, transversalidade, vivência e globalidade e sustentabilidade socioambiental. Traz \ntambém, em seu escopo, a importante questão voltada à valorização e reconhecimento dos \ndiversos grupos historicamente excluídos em nossa sociedade e o combate às diversas formas de \nexclusão como misoginia, machismo, racismo, LGBTQIA+fobia, xenofobia, darwinismo social, \npolíticas eugênicas, intolerância religiosa, etc., atentando-se ao detalhe de que as populações \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n94 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \natingidas por essas formas de discriminação devem estar atreladas à lógica da equidade, quando \npensadas dentro da estrutura curricular da Educação em Direitos Humanos.",
        "Objetivos": "1. Refletir e contribuir para a dialógica em vários contextos: nos valores civis, políticos, éticos, \nsociais, econômicos, culturais e ambientais; no processo articulado de forma transversal da \nrelação indissociável entre Educação e Direitos Humanos; \n2. Engajar o educando para participar de forma dinâmica na construção e aplicação do \nconhecimento e no enfretamento de situações críticas, propondo soluções e tendo \nautonomia para superá-las; \n3. Reflexão do educando a respeito da sua função social enquanto futuro docente em \nEducação Matemática, observando que a construção das justiças social e curricular, \ntambém passará pelas aulas ministradas por elas e eles no âmbito da educação básica.",
        "Conteúdo Programático": "1. Análise das relações de poder na escola com vistas à democracia e à inclusão social, \nconsiderando-se o multiculturalismo, a diversidade/diferenças, os direitos humanos; \n2. Análise da educação como direito e seus desdobramentos no que se refere à inclusão, à \ndiversidade e à democracia; \n3. Análise e compreensão das diferentes matrizes do pensamento sociológico acerca da \nrelação homem, sociedade, educação e escola; \n4. Historicidade dos processos educativos e das práticas escolares no Brasil; \n5. A educação na Constituição Federal: direito de cidadania e dever do Estado na sociedade \nbrasileira; \n6. Princípios normativos e históricos da organização da educação escolar no âmbito das \nDiretrizes e Bases da Educação Nacional, tendo em vista os condicionantes \nsocioeconômicos e políticos e suas imbricações no campo da política pública social \neducacional e da educação como direito; \n7. Princípios e Políticas da Educação Inclusiva no contexto educacional e nacional; \n8. Racismo, educação antirracista e os impactos nas relações escolares; \n9. Marcos históricos dos Direitos Humanos, sua relação com as realidades sociais brasileiras \ne seus reflexos na escola; \n10. A escola como espaço de convívio das diferenças como diversidade e de produção de uma \ncultura de Direitos Humanos; \n11. Diversidade, democracia, direitos humanos e inclusão: gênero, sexualidade, imigração, \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n95 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \ncomunidades indígenas, questões étnico-raciais, dentre outros."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Fundamentos de Geometria",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTFGEO",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Fundamentos de Geometria e Geometria Analítica. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n97 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Ementa": "O componente curricular desenvolve a compreensão dos teoremas da geometria Euclidiana por \nmeio da resolução de problemas geométricos.  Aborda a Geometria Elementar por meio das \nconstruções geométricas com régua e compasso com o foco na caracterização, justificativa e \nvalidade dos procedimentos utilizados. O componente curricular aborda, no contexto das novas \ntecnologias, o uso de programas de geometria dinâmica como ferramenta para demonstrações, \ninvestigações e resolução de situações problemas.",
        "Objetivos": "1. Estudar elementos da geometria plana destacando, suas construções, transformações e \nrelações com os conceitos de grandeza e medida, presentes no currículo da Educação \nBásica, possibilitando o estudo das diferentes geometrias; \n2. Compreender e analisar os conceitos e técnicas de construções geométricas com régua e \ncompasso, para resolver problemas de geometria euclidiana plana; \n3. Estudar procedimentos utilizados nas construções geométricas com régua e compasso, \nquestionando e justificando sua validade; \n4. Desenvolver a capacidade de construção e representação de figuras geométricas; \n5. Compreender e utilizar simbologia, notações e vocabulário específico da Geometria em \nsituações de construções geométricas e resolução de problemas; \n6. Promover o desenvolvimento do raciocínio dedutivo e da habilidade de resolução de \nproblemas geométricos; \n7. Utilizar e analisar programas computacionais adequados ao desenvolvimento do desenho \ngeométrico. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n98 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Conteúdo Programático": "1. Conceitos de pontos, retas, semirretas, segmentos de reta e ângulos; \n2. Proporções envolvendo retas paralelas e o Teorema de Tales; \n3. Conceitos, classificação, propriedades e construção de polígonos;  \n4. Triângulos: classificações, construção, congruência, semelhança, Teorema de Pitágoras, \nmediatrizes, cevianas, pontos notáveis; \n5. Conceitos e propriedades envolvendo circunferências e arcos; \n6. Áreas de regiões poligonais, de círculos e de setores; \n7. Conceito de lugar geométrico e suas aplicações; \n8. Noções sobre transformações geométricas: translações, reflexões e rotações; \n9. Construções Fundamentais com régua e compasso: segmentos, ângulos e arcos, retas \nparalelas e perpendiculares, Mediatriz, Bissetriz, Divisão de um segmento em partes iguais, \nTraçado das tangentes a uma circunferência;"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Fundamentos de Matemática 1",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTFMA1",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Fundamentos de Álgebra Linear; \nConhecimentos específicos / Fundamentos de Geometria e Geometria Analítica.",
        "Ementa": "Este componente curricular tem como focos a retomada e o aprofundamento dos conceitos de \nequação linear, sistema linear, matrizes e determinante. Para isso, serão abordadas situações-\nproblema em diversas áreas do conhecimento, demonstrações e investigações históricas \nrelacionadas ao tema. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n100 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Estudar sistemas lineares, utilizando matrizes e determinantes nos processos de resolução, \ndestacando a reflexão sobre seu ensino na Educação Básica, bem servir como \nfundamentação para a compreensão dos conceitos de Espaços Vetoriais e Transformações \nLineares e suas relações com outros componentes curriculares e aplicações em outras áreas \ndo conhecimento; \n2. Identificar a relação entre sistemas lineares com elementos da geometria plana e espacial, \nna busca de uma solução; \n3. Estudar, classificar e resolver sistemas lineares por meio de diferentes processos, inclusive \npelo método de Cramer e por escalonamento (método da eliminação de Gauss); \n4. Representar e interpretar uma tabela de números como uma matriz, identificando seus \nelementos, usos e propriedades; \n5. utilizar a linguagem matricial e as operações com matrizes como instrumentos para \ninterpretar dados; \n6. Calcular o determinante de matrizes e utilizá-lo para a resolução e discussão de sistemas \nlineares.",
        "Conteúdo Programático": "1. Sistemas lineares: métodos de resolução (escalonamento, Gauss) e discussão; \n2. Matrizes: definição, álgebra matricial, matrizes especiais, matrizes simétricas e ortogonais, \nmatriz transposta, operações com matrizes, matrizes invertíveis, cálculo de matriz inversa; \n3. Determinantes: definição, propriedades, cálculo de determinantes (regra de Sarrus, \nTeorema de Laplace e regra de Chió); determinantes e análise de sistemas; aplicações a \nresoluções de sistemas lineares (regra de Cramer)."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Matemática Discreta",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTMDIS",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Contagem, estatística e probabilidade.",
        "Ementa": "O componente curricular aborda a lógica formal de modo a fornecer ao aluno o entendimento do \nraciocínio matemático adequado que o prepare para lidar com teorias mais abstratas, com \ndemonstrações formais em matemática e com a lógica de programação. Além disso, este \ncomponente aborda tópicos elementares de matemática discreta, como combinatória, \nprobabilidade discreta e grafos.",
        "Objetivos": "1. Estudar diferentes procedimentos para a contagem de elementos selecionados de um \nconjunto, dos modelos estatísticos e dos conceitos de probabilidade em diversos \ncontextos; \n2. Prover o estudante de ferramentas de lógica e de estratégias de alguns tipos de \ndemonstrações matemáticas formais usuais; \n3. Fornecer conceitos da lógica formal, ampliando o raciocínio lógico-matemático e \npreparando para o estudo da lógica computacional; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n103 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n4. Apresentar conceitos e propriedades elementares de análise combinatória; \n5. Conhecer aspectos básicos da teoria de grafos e seus principais problemas e soluções.",
        "Conteúdo Programático": "1. Lógica formal: proposições lógicas, representações simbólicas, tabelas-verdade, \ntautologias, quantificadores, predicados, lógica proposicional, lógica de predicados; \n2. Técnicas de demonstração de teoremas (direta, por contraposição, por exaustão, por \ncontradição, contraexemplos); \n3. Fatorial, coeficiente binomial e suas propriedades, triângulo de Pascal, binômio de Newton \ne o Teorema Binomial; \n4. Análise combinatória: princípios fundamentais de contagem (aditivo e multiplicativo), \npermutações simples, permutações com repetição, combinações simples, combinações \ncom repetição, permutações circulares; \n5. Princípio da Casa dos Pombos; \n6. Grafos: definições, terminologias e propriedades de grafos e árvores, grafos bipartidos, \ngrafos direcionados, grafos ponderados, matriz de adjacências de um grafo, isomorfismos \nde grafos, grafos planares, fórmula de Euler e suas consequências, caminhos eulerianos, \nciclos hamiltonianos, caminho mínimo, árvore geradora mínima, coloração de grafos."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Metodologia de Pesquisa",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTMTPE",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Específicos / Língua Portuguesa na prática docente; \nConhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.2 Sociologia da Educação; \nConhecimentos Pedagógicos / 2. Didática / 2.3 Métodos e técnicas de ensino.",
        "Ementa": "Este componente aborda a conceituação do termo pesquisa e suas implicações sociais. Estuda os \nelementos constitutivos da pesquisa científica, a linguagem específica e argumentação de textos \ntécnico-científicos, assim como discute as principais abordagens metodológicas da pesquisa na \nárea de educação e educação matemática. Estuda a maneira pela qual a pesquisa científica pode \ncontribuir para o aprimoramento da prática docente e para a superação de problemáticas \neducacionais, sociais, ambientais e para o desenvolvimento científico e tecnológico. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n106 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Compreender o conceito de pesquisa científica, suas etapas e seus elementos constitutivos \nprincipais; \n2. Caracterizar e diferenciar abordagens metodológicas de pesquisa; \n3. Compreender as características teóricas, epistemológicas e metodológicas de pesquisas \nacadêmicas, em particular no campo da educação e da educação matemática; \n4. Conhecer e aplicar as normas técnicas de elaboração de textos acadêmicos e científicos; \n5. Realizar um estudo da Língua Portuguesa, contextualizado na prática docente, englobando \na abordagem de capacidades, estratégias de leitura, interpretação, produção oral, escrita \ne documentação de textos acadêmicos e científicos, reconhecendo sua importância social \ne cultural; \n6. Conhecer e produzir textos acadêmicos científicos, tais como: fichamento, resumo, \nresenha, artigo etc; \n7. Conhecer e compreender os impactos da pesquisa na vida em sociedade e no meio \nambiente.",
        "Conteúdo Programático": "1. Pesquisa: conceitos básicos; tipos, modelos básicos e paradigmas; \n2. Diferentes matrizes do pensamento filosófico e sociológico acerca da relação homem, \nsociedade, educação e escola presentes na pesquisa científica em educação e educação \nmatemática; \n3. Pesquisa como método pedagógico; \n4. Textos técnico-científicos: gênero acadêmico; fichamento; resumo; resenha; artigo \ncientífico; relatório; \n5. Estrutura de um projeto de pesquisa; \n6. Normas técnicas para a elaboração de trabalhos científicos; \n7. Estudos introdutórios sobre metodologias de pesquisas na educação e educação \nmatemática: pesquisas descritivas e de intervenção; estudo de caso; análise de conteúdo; \npesquisa experimental; pesquisa-ação; \n8. Relação entre pesquisa e desenvolvimento tecnológico; \n9. Relação entre ensino, pesquisa e extensão; \n10. Relação entre pesquisa, educação, sociedade e meio ambiente; \n11. Relação entre pesquisa, educação e inclusão social. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n107 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Resolução de Problemas nas aulas de Matemática",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTRPAM",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Metodologias de ensino; \nConhecimentos específicos / Tendências em Educação Matemática; \nConhecimentos pedagógicos / Didática / 2.1.Ensino e aprendizagem; \nConhecimentos pedagógicos / Didática / 2.3.Métodos e técnicas de ensino.",
        "Ementa": "O componente curricular aborda diferentes concepções e tendências em relação à Resolução de \nProblemas nas aulas de matemática contextualizadas histórico e socialmente, bem como na sua \nrelação com o processo de ensino e aprendizagem de matemática. Este componente curricular \nestuda diferentes abordagens de resolução de problemas no ensino de matemática e desenvolve \ntemas como situações problema, problematização, comunicação, letramento matemático e o \nestudo da concepção da Resolução de Problemas nos documentos oficiais da Educação Brasileira. \nCaracterísticas e aspectos de textos de problemas matemáticos são trabalhados a fim de refletir \nsobre possíveis ações didáticas para ensinar o estudante a ler, interpretar e elaborar problemas \nem diversos contextos usando vocabulários e termos específicos da área do conhecimento. A \nPrática como Componente Curricular (PCC) se dará pela análise, reflexão e proposição de ações \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n109 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \ndidáticas vivenciadas no decorrer do componente curricular.",
        "Objetivos": "1. Compreender e experimentar diferentes metodologias de ensino de números, geometria, \ngrandezas e medidas, álgebra, probabilidade e estatística; \n2. Conhecer as tendências em educação matemática destacando aspectos pedagógicos que \nenvolvem o ensino de resolução de problemas nas aulas de matemática; \n3. Compreender o papel da Resolução de Problemas nas aulas de Matemática \ncontextualizada dentro do processo social e histórico; \n4. Refletir sobre a relação da Resolução de Problemas e o processo de ensino e aprendizagem \nde Matemática; \n5. Refletir sobre a relação entre a Resolução de Problemas e o desenvolvimento da \ncomunicação nas aulas de Matemática e do Letramento Matemático; \n6. Refletir sobre práticas de ensino que permitem que o estudante se desenvolva na leitura, \ninterpretação, formulação e resolução de problemas; \n7. Conhecer a abordagem de Resolução de Problemas nos documentos oficiais brasileiros da \nEducação.",
        "Conteúdo Programático": "1. Concepções e abordagens para o trabalho com Resolução de Problemas nas aulas de \nmatemática; \n2. Perspectiva sociocultural do ensino de matemática nas práticas escolares relacionadas ao \nensino de Resolução de Problemas em diferentes contextos sociais; \n3. Tendências do Ensino de Matemática e suas relações com Resolução de Problemas nas \naulas de Matemática; \n4. Características e definições de problemas e situações problema; \n5. A proposição de diferentes tipos de problemas e situações problema nas aulas de \nmatemática; \n6. Problematização como metodologia de ensino; \n7. Leitura, interpretação e formulação de problemas matemáticos; \n8. Resolução de problemas e comunicação; \n9. Letramento matemático; \n10. A concepção de resolução de problema nos documentos oficiais da Educação do Brasil. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n110 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Cultura e Educação Matemática",
        "Semestre": "2",
        "Ano": "",
        "Código": "CBTCEDM",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Específicos / Educação das relações étnico- raciais e ensino de matemática na \nEducação Básica; \nConhecimentos Específicos / Educação em direitos humanos e educação ambiental no ensino de \nmatemática na Educação Básica; \nConhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.2 Sociologia da Educação; \nConhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.3 História da Educação; \nConhecimentos Pedagógicos / 2. Didática / 2.2 Planejamento e avaliação; \nConhecimentos Pedagógicos / 2. Didática / 2.3 Métodos e técnicas de ensino; \nConhecimentos Pedagógicos / 4. Política e Organização da Educação Brasileira / 4.2 Legislação; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão / 5.2 Educação para as \nrelações étnico- raciais e indígenas; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão / 5.3 Educação em \nDireitos Humanos. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n112 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Ementa": "Este componente aborda as concepções de cultura e educação recorrendo ao diálogo entre \nantropologia, história, filosofia, sociologia e pedagogia, procurando explicitar o modo como tais \nconcepções influenciam a prática pedagógica. Destaca a importância da cultura africana e \nindígena para a formação cultura brasileira. Visa introduzir o conceito de etnomatemática e \nampliar as discussões sobre o papel da escola na construção de uma sociedade que respeite o \nmeio ambiente, os direitos humanos e as diferenças políticas, sociais, étnico-raciais, de crença, de \ngênero, de orientação sexual, entre outras.",
        "Objetivos": "1. Conhecer sobre história e cultura africana e indígena, sua presença na formação do povo \nbrasileiro e suas implicações para a educação das relações étnico-raciais e para o ensino \nde matemática na Educação Básica, observando os seus processos próprios de ensino e \naprendizagem, a fim os legitimar como processos também utilizados no cotidiano \npedagógico; \n2. Conhecer sobre educação em direitos humanos e educação ambiental, seu papel na \nconsolidação de uma sociedade mais justa para todos os seres vivos, bem como estudar \npropostas e metodologias para sua utilização no ensino de matemática na Educação \nBásica; \n3. Apresentar e discutir diferentes concepções de cultura; \n4. Compreender o papel da cultura africana e indígena na formação da cultura brasileira; \n5. Refletir sobre as opções do trabalho pedagógico quando se leva em consideração os \n“saberes” dos alunos, suas concepções, conhecimentos e linguagem; \n6. Analisar criticamente a etnomatemática como procedimento metodológico para viabilizar \na prática pedagógica numa perspectiva cultural; \n7. Examinar criticamente o atual paradigma educacional, o qual visa o respeito às diferenças, \nbuscando alternativas de ação no que se refere ao planejamento, ao currículo, à avaliação, \nao enfoque transdisciplinar e às novas tecnologias.",
        "Conteúdo Programático": "1. Estudo das diferentes concepções de cultura e desmembramento do conceito, observando \no reconhecimento das mesmas de forma desierarquizada dentro da Educação Matemática; \n2. O papel da cultura na constituição do cotidiano escolar; \n3. Análise das relações de poder na escola com vistas à democracia e à inclusão social, \nconsiderando-se o multiculturalismo, a diversidade/diferenças, os direitos humanos; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n113 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n4. Análise da educação como direito e seus desdobramentos no que se refere à inclusão, à \ndiversidade e à democracia; \n5. Análise histórica da construção do conhecimento humano e do papel da escola nos \nprocessos de formação humana; \n6. A avaliação da aprendizagem como processo contínuo e formativo; \n7. Avaliação da aprendizagem, institucional e em larga escala; \n8. Práticas pedagógicas inclusivas; \n9. Aspectos legais sobre proteção da criança e do adolescente e o papel da escola e da família \nnesse processo a partir do estudo do Estatuto da Criança e do Adolescente; \n10. As lutas históricas dos negros e dos povos indígenas no Brasil; \n11. Culturas afro-brasileiras e indígenas e suas respectivas produções culturais; \n12. Políticas de Ações Afirmativas e Educação; \n13. Educação Quilombola e Indígena; \n14. O papel da Educação escolar na proteção e promoção das diversas expressões culturais; \n15. Diferenças, democracia, direitos humanos e inclusão: gênero, sexualidade, imigração, \ncomunidades indígenas, questões étnico-raciais, religiosidade, dentre outros;1 \n16. Formação e prática docente para atender às políticas de reconhecimento às diferenças na \nescola; \n17. A importância dos fatores culturais no processo de ensino e aprendizagem da Educação \nMatemática na educação básica; \n18. O papel da educação ambiental na consolidação de uma sociedade mais justa para todos \nos seres vivos."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Educação Especial e Práticas Educacionais na Perspectiva Inclusiva",
        "Semestre": "2",
        "Ano": "",
        "Código": "CBTEESP",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.2 Sociologia da Educação; \nConhecimentos Pedagógicos / 2. Didática / 2.3 Métodos e técnicas de ensino; \nConhecimentos Pedagógicos / 3. Currículo; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão / 5.1 Educação especial;  \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão / 5.3 Educação em \nDireitos Humanos.",
        "Ementa": "O componente curricular aborda a Educação Especial na Perspectiva Inclusiva. Contextualiza o \nassunto, partindo dos pressupostos filosóficos, sociais, educacionais, políticos e de Direitos \nHumanos.  Explora os aspectos históricos, conceituais e legais da Educação Especial. Destacando \no Atendimento Educacional Especializado e práticas pedagógicas inclusivas nos diversos níveis e \nmodalidades de ensino, trabalhando o tema inclusão social e acessibilidade, considerando a \nintegração sociedade/família/escola. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n116 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Analisar as relações de poder na escola, e a   escola como espaço e convívio da diversidade; \n2. Conhecer as políticas   educacionais de Educação Especial no contexto internacional e \nnacional na perspectiva da inclusão; \n3. Analisar as implicações do processo de inclusão dos estudantes público-alvo da Educação \nEspecial na escola regular em todos os níveis e modalidades; \n4. Compreender o Atendimento Educacional Especializado e as práticas pedagógicas \ninclusivas; \n5. Compreender o currículo, acessibilidade e aprendizagem no contexto da Educação \nEspecial; \n6. Analisar as implicações do processo de inclusão dos estudantes público-alvo da Educação \nEspecial na escola regular em todos os níveis e modalidades; \n7. Estudar, analisar e propor utilização de tecnologia assistiva.",
        "Conteúdo Programático": "1. Análise das relações de poder na escola com vistas à democracia e à inclusão social, \nconsiderando-se o multiculturalismo, a diversidade/diferenças, os direitos humanos; \n2. Análise da educação como direito e seus desdobramentos no que se refere à inclusão, à \ndiversidade e à democracia; \n3. Práticas pedagógicas inclusivas; \n4. Currículo no contexto da Educação Especial e Educação de Jovens e Adultos; \n5. Aspectos históricos e conceituais da Educação Especial numa perspectiva inclusiva; \n6. Princípios e Políticas da Educação Inclusiva no contexto educacional e nacional; \n7. Acessibilidade e aprendizagem escolar; \n8. Práticas pedagógicas inclusivas, nos diversos níveis e modalidades de ensino; \n9. A escola como espaço de convívio das diferenças como diversidade e de produção de uma \ncultura de Direitos Humanos. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n117 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Ensino e Aprendizagem de Números",
        "Semestre": "2",
        "Ano": "",
        "Código": "CBTEANU",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Metodologias de ensino; \nConhecimentos específicos / Tendências em Educação Matemática;  \nConhecimentos pedagógicos / Didática / 2.1.Ensino e aprendizagem; \nConhecimentos pedagógicos / Didática / 2.3.Métodos e técnicas de ensino.",
        "Ementa": "O componente curricular trata dos temas do eixo temático Números da Educação Básica por meio \ndo estudo e da reflexão sobre ações didáticas para o ensino e a aprendizagem dos conceitos dos \nnúmeros reais e suas operações. Este componente curricular apresenta abordagens para a \nconstrução do conceito de número e do Sistema de Numeração Decimal, bem como aborda \nestratégias para o ensino das características e operações de números reais e seus subconjuntos \nnuméricos, quais sejam: números naturais, números inteiros, números racionais escritos na forma \nfracionária e decimal, números irracionais. O componente estuda diferentes modalidades de \ncálculo como cálculo mental, estimativa e arredondamento. O componente curricular desenvolve \ntemas como letramento matemático, sentido numérico e mentalidades matemáticas por meio de \ntrabalhos de pesquisa envolvendo embasamento teórico e estratégias de ensino a fim de propiciar \nestudo e prática reflexivos das aulas de matemática. Materiais estruturados e não estruturados \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n120 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \npara o ensino de números e operações são objetos de estudo, assim como o uso de portadores \nnuméricos, jogos, brincadeiras, calculadoras e a proposição de sequências didáticas, projetos \ninvestigativos e outros pertinentes à educação básica. A Prática como Componente Curricular \n(PCC) se dará pela análise, reflexão e proposição de ações didáticas vivenciadas no decorrer do \ncomponente curricular.",
        "Objetivos": "1. Compreender e experimentar diferentes metodologias de ensino de números; \n2. Conhecer as tendências em educação matemática destacando aspectos pedagógicos que \nenvolvem o ensino de números e operações; \n3. Compreender como se dá a construção do conceito de números e do Sistema de \nNumeração Decimal e investigar possíveis intervenções para o aluno avançar na sua \ncompreensão; \n4. Discutir o significado das operações, assim como diferentes estratégias e modalidades de \ncálculo, incluindo procedimentos pessoais de cálculo e a algoritmos convencionais; \n5. Refletir sobre o ensino de números racionais e as dificuldades que os estudantes da \nEducação Básica costumam apresentar evidenciando a relação entre as ações didáticas e a \naprendizagem dos conceitos e significados desse campo numérico, bem como ao sentido \ne compreensão das operações para além dos algoritmos convencionais; \n6. Conhecer, explorar e investigar o uso de materiais estruturados e não estruturados que \npossam auxiliar o ensino de números reais e operações; \n7. Conhecer e refletir a respeito das diversas metodologias de ensino de números e \noperações.",
        "Conteúdo Programático": "1. A construção do conceito de número: contagem e os diversos sistemas de registro da \ncontagem; \n2. A compreensão do Sistema de Numeração Decimal; \n3. Significados das operações e suas propriedades; \n4. Procedimentos pessoais e algoritmos convencionais de cálculo; \n5. Cálculo mental; \n6. Materiais estruturados e não estruturados para o ensino do Sistema de Numeração decimal \ne das operações;  \n7. Recursos didáticos para o ensino de números e operações; \n8. O conceito de fração: parte/todo; medida; decimal; porcentagem; razão e operador \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n121 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nnumérico;  \n9. A relação entre diferentes representações de fração; \n10. Recursos didáticos para o ensino de frações; \n11. Conceito e operações com números irracionais;  \n12. Relação entre os subconjuntos dos números reais;"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Fundamentos de Matemática 2",
        "Semestre": "2",
        "Ano": "",
        "Código": "CBTFMA2",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Funções e Cálculo Diferencial e Integral.",
        "Ementa": "O componente curricular desenvolve o estudo da função exponencial e passa para a função \nlogarítmica resgatando também o conceito de função inversa. Aborda as construções gráficas, \ninterpretações e aplicações dessas funções. Sequências e progressões aritméticas e geométricas \nserão abordadas e relacionadas às funções afim, exponenciais e logarítmicas.  \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n124 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Compreender o conceito de função como um caso particular de relação, e ampliar o estudo \nde seu comportamento por meio de conceitos do Cálculo Diferencial e Integral, articulados \ncom outras áreas do conhecimento e com a Educação Básica; \n2. Ler e interpretar diferentes linguagens e representações envolvendo variações de \ngrandezas;  \n3. Reconhecer e utilizar a linguagem algébrica nas ciências, expressar a relação entre \ngrandezas e modelar situações-problema, construir modelos descritivos de fenômenos, \nfazendo conexões dentro e fora da Matemática; \n4. Relacionar os conceitos de funções estudados no Ensino Médio entre si de modo a \naprofundar o estudo de diferentes tipos de dependência entre variáveis nas funções  \nexponencial e logarítmica; \n5. Identificar regularidades em sequências e expressá-las por meio de linguagem algébrica; \ndeterminar a razão, o termo geral, o limite e a soma de n termos consecutivos de uma \nprogressão; resolver problemas envolvendo progressões aritméticas e geométricas.",
        "Conteúdo Programático": "1. Potenciação e radiciação; \n2. Função exponencial; \n3. Logaritmo e função logarítmica; \n4. Sequências e progressões: Progressão aritmética e Progressão geométrica."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Geometria Analítica",
        "Semestre": "2",
        "Ano": "",
        "Código": "CBTGEAN",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Fundamentos de Geometria e Geometria Analítica; \nConhecimentos específicos / Fundamentos de Álgebra Linear.",
        "Ementa": "Este Componente curricular desenvolverá as competências e habilidades relativas ao estudo da \nGeometria Analítica por meio da abordagem dos conceitos de coordenadas cartesianas; equação \nda reta; teorema angular; distância de um ponto a uma reta e cônicas.",
        "Objetivos": "1. Estudar elementos da geometria plana e espacial analítica, relacionando aspectos \nalgébricos e geométricos, bem como suas construções, transformações e relações com os \nconceitos de grandeza e medida, presentes no currículo da Educação Básica, possibilitando \no estudo das diferentes geometrias;  \n2. Permitir a interpretação dos sistemas lineares do ponto de vista geométrico, utilizando \nmatrizes e determinantes nos processos de resolução, destacando a reflexão sobre seu \nensino na Educação Básica, bem como um embasamento para a compreensão dos \nconceitos de Espaços Vetoriais e Transformações Lineares, conceitos estudados em \nsemestres seguintes no curso; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n127 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n3. Compreender o conceito de elipse e hipérbole e ampliar a compreensão sobre parábolas.",
        "Conteúdo Programático": "1. Estudo analítico do ponto: coordenadas cartesianas no plano; distância entre dois pontos; \npontos colineares; \n2. Estudo analítico da reta: equações, posições relativas, distância de ponto a reta, ângulo \nentre duas retas; \n3. Estudo analítico da circunferência: equações, posições relativas entre pontos e \ncircunferência, entre retas e circunferência e entre circunferências; \n4. Estudo analítico das cônicas: definição, elipse, hipérbole e parábola."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Geometria Euclidiana Plana",
        "Semestre": "2",
        "Ano": "",
        "Código": "CBTGEPL",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Fundamentos de Geometria e Geometria Analítica.",
        "Ementa": "O componente curricular propõe uma retomada das noções e proposições primitivas da \nGeometria a fim de definir com rigor: segmento de reta, ângulos, paralelismo, perpendicularidade, \npolígonos, circunferências e círculos. A Geometria métrica será outro foco do componente \ncurricular por meio de um estudo maior sobre triângulos envolvendo a noção de semelhança e \nresoluções acerca de triângulos retângulos e triângulos quaisquer utilizando teoremas. Os \nconceitos de Perímetro e área de figuras planas serão revisitados para além das aplicações de \nfórmulas, englobando as situações problemas relacionadas com as questões socioambientais e \ncom outras ciências, tais como a física, química e engenharia. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n129 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Estudar elementos da geometria plana, destacando aspectos empíricos, algébricos, \ntopológicos, axiomáticos, bem como suas construções, transformações e relações com os \nconceitos de grandeza e medida, presentes no currículo da Educação Básica; \n2. Relacionar as proposições primitivas da Geometria às definições comumente estudadas;  \n3. Identificar e definir polígonos a partir das suas propriedades;  \n4. Estabelecer relações entre propriedades relativas a uma figura ou entre figuras. As \ndefinições e a inclusão de classes passam a ter significado; \n5. Compreender a função dos axiomas, dos postulados, das definições, dos Teoremas e das \ndemonstrações geométricas; \n6. Desenvolver o pensamento geométrico e a percepção espacial;  \n7. Aplicar os conceitos de Geometria plana na resolução de situações problema envolvendo \ncálculo de medidas de comprimento e ângulo; \n8. Compreender o processo de ensino e aprendizagem de geometria plana na educação \nbásica.",
        "Conteúdo Programático": "1. Noções e proposições primitivas, segmentos de reta; \n2. Polígonos e circunferências: propriedades e inclusão hierárquica de classes;  \n3. Ângulos: Ângulos opostos pelo vértice; ângulos formados por retas paralelas cortadas por \numa transversal; soma dos ângulos internos de polígonos convexos; ângulos internos em \npolígonos regulares; \n4. Semelhança e congruência de triângulos: Casos de congruência e semelhança de \ntriângulos; \n5. Relações métricas no triângulo retângulo: Elementos; relações métricas;  \n6. Polígonos regulares inscritos em circunferências e comprimento de circunferência: Cálculo \nda medida de lado e de apótema de um polígono regular; \n7. Potência de um ponto em relação a uma circunferência; \n8. Áreas e medidas de superfícies: Triângulos; quadriláteros e polígonos regulares; círculo e \nsetor circular; cálculo aproximado de áreas; razão e semelhança de áreas;  \n9. Geometria métrica."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "História da Educação e da Educação Matemática",
        "Semestre": "2",
        "Ano": "",
        "Código": "CBTHEDM",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Específicos / Educação das relações étnico- raciais e ensino de matemática na \nEducação Básica; \nConhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.1 Filosofia da Educação; \nConhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.3 História da Educação; \nConhecimentos Pedagógicos / 3. Currículo.",
        "Ementa": "Este componente curricular apresenta e discute os momentos mais relevantes da História da \nEducação, destacando seu contexto histórico e principais pensadores. Visa promover a \ncompreensão da educação contextualizada dentro do processo histórico. Destaca os principais \nmomentos da História da Educação Matemática e suas relações com a própria História da \nEducação. Destaca também a relação entre as principais mudanças políticas, sociais e ideológicas \nbrasileiras e suas principais influências na evolução da História da Educação e da Educação \nMatemática. Nesse contexto, analisa as relações de poder e suas tensões no campo curricular \nmundial como uma das cruciais influências na construção do lugar ocupado pela matemática no \nuniverso escolar brasileiro. Discute a maneira pela qual a Matemática pode contribuir \npositivamente para a superação de questões socioambientais, de justiça social e de relações \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n132 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nétnico-raciais juntamente às contribuições para o desenvolvimento científico e tecnológico.",
        "Objetivos": "1. Possibilitar que o estudante conheça as questões gerais que são objetos de discussões e \npesquisas na Educação e na Educação Matemática, estreitando laços entre a sala de aula, \no desenvolvimento educacional, a pesquisa e a análise crítica e do papel da Educação \nMatemática em nossa sociedade; \n2. Conhecer sobre história e cultura africana e indígena, sua presença na formação do povo \nbrasileiro e suas implicações para a educação das relações étnico-raciais e para o ensino \nde matemática na Educação Básica.",
        "Conteúdo Programático": "1. História da Educação: conceito, caracterização, importância, contribuições e fatores \nrelevantes; \n2. Fases da História da Educação; \n3. Educação Primitiva, Educação Oriental, Educação Clássica, Educação Medieval Humanística, \nEducação Nacional, Educação Democrática; \n4. A Educação Religiosa Reformada (católica), Educação dos Jesuítas, Educação de outras \nordens religiosas, Pedagogistas e educadores da educação católica; \n5. A Educação nas Constituições brasileiras; \n6. A Educação Matemática: contexto histórico e sua importância; \n7. Relações entre a História da Educação e da Educação Matemática; \n8. Contribuições dos povos europeus, africanos e indígenas para a Educação Brasileira."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Libras",
        "Semestre": "2",
        "Ano": "",
        "Código": "CBTLIBS",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Específicos / LIBRAS no ensino de matemática; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão / 5.1 Educação especial.",
        "Ementa": "A disciplina visa ao estudo das diferentes línguas de sinais, enfatizando a organização linguística \nda Libras para usos informais e cotidianos, abrangendo o vocabulário, morfologia, sintaxe e \nsemântica. Nesse contexto, a expressão corporal será abordada como elemento linguístico. A \ndisciplina prevê uma discussão aprofundada sobre as relações entre línguas de sinais e as minorias \nlinguísticas no uso das terminologias matemáticas. Estudo da Legislação vigente quanto a \nAcessibilidade, Políticas Educacionais e Políticas Linguísticas.",
        "Objetivos": "1. Conhecer as concepções sobre surdez;  \n2. Compreender a constituição do sujeito surdo; \n3. Difundir a Língua Brasileira de Sinais quanto à Linguística: Fonética, Fonologia, Morfologia, \nSintaxe, Semântica e Pragmática;  \n4. Identificar os parâmetros e conceitos relacionados à Libras;  \n5. Permear a história da Língua Brasileira de Sinais enquanto elemento constituidor do sujeito \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n135 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nsurdo, especificando sua cultura e identidade surda; \n6. Estudar novos sinais da matemática em Libras no contexto educacional.",
        "Conteúdo Programático": "1. Introdução aos conceitos básicos: Surdez; \n2. Deficiência auditiva; \n3. Sujeito surdo; \n4. Cultura, comunidade, identidade surda e legalização comunicativa;  \n5. Língua Brasileira de Sinais – Libras; \n6. Conceitos; \n7. História da língua de sinais;  \n8. Língua/linguagem; \n9. Mitos; \n10. Introdução à Libras – aspectos linguísticos;  \n11. Características da língua, seu uso, variações regionais, sociais e históricas;  \n12. Noções básicas da Libras/Parâmetros: configurações de mão, movimento, locação, \norientação da mão, direção, expressões faciais e corporais; \n13. Vocabulários/Glossário Prático em construção; \n14. Morfologia, sintaxe, números; expressões socioculturais positivas: cumprimento, \nagradecimento; \n15. Desculpas, expressões socioculturais negativas: desagrado, verbos e pronomes, noções de \ntempo, de horas, datilologia, classificadores;  \n16. Numerais cardinais e numerais para quantidades;  \n17. Legislação específica: Lei N.º 10.436, de 24/04/2002, e Decreto N.º 5.626, de 22/12/2005;  \n18. Lei Brasileira da Inclusão N.º 13.146/2015 (Estatuto das pessoas com deficiências); \n19. Decreto Nº 6.949/2009."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Trigonometria, Números Complexos e Polinômios",
        "Semestre": "2",
        "Ano": "",
        "Código": "CBTTNCP",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Trigonometria.",
        "Ementa": "Este componente curricular retoma o estudo dos conteúdos da Educação básica sobre três tópicos \nimportantes: trigonometria, números complexos e polinômios, levando o aluno a entender seus \nconceitos e compreender sobre a maneira pela qual eles podem contribuir para o \ndesenvolvimento científico e tecnológico.",
        "Objetivos": "1. Compreender os conceitos trigonométricos, abordando suas diversas aplicações na \nmatemática e em outras áreas do conhecimento, bem como as questões referentes ao seu \nensino; \n2. Expressar a medida de um ângulo em graus e em radianos; \n3. Compreender o conceito de razões trigonométricas no triângulo retângulo e calcular \ndistâncias inacessíveis usando essas relações; \n4. Compreender que as razões trigonométricas podem ser entendidas como funções a partir \ndo círculo trigonométrico; identificar sinal, periodicidade e raízes na representação das \nfunções seno, cosseno e tangente; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n138 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n5. Resolver equações e inequações trigonométricas; \n6. Identificar um número complexo por sua forma algébrica, gráfica e trigonométrica;  \n7. Resolver equações cujas raízes não são reais; \n8. Compreender polinômios e utilizar os conceitos relacionados no estudo de funções e na \nresolução de problemas algébricos; \n9. Determinar as raízes de equações polinomiais e estabelecer relações entre coeficientes e \nraízes;  \n10. Refletir sobre o desenvolvimento histórico e epistemológico dos conceitos estudados; \nreconhecer e discutir possíveis aplicações; \n11. Compreender o processo de ensino e aprendizagem de trigonometria, números complexos \ne polinômios na educação básica.",
        "Conteúdo Programático": "1. Trigonometria no triângulo retângulo; \n2. Trigonometria em triângulos quaisquer; \n3. Trigonometria na circunferência de raio unitário; \n4. Funções trigonométricas: funções circulares; transformações trigonométricas; funções \ncirculares inversas; \n5. Equações e inequações trigonométricas; \n6. Números complexos: definição, propriedades, forma trigonométrica;  \n7. Polinômios: função polinomial e operações; \n8. Equações polinomiais: definição; resolução; teorema fundamental da álgebra e teorema da \ndecomposição; multiplicidade de uma raiz; relação de Girard; raízes imaginárias e pesquisa \nde raízes racionais."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Cálculo Diferencial e Integral 1",
        "Semestre": "3",
        "Ano": "",
        "Código": "CBTCDF1",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Específicos / Função e Cálculo Diferencial e Integral; \nConhecimentos Específicos / Fundamentos de Análise.",
        "Ementa": "Este componente curricular prevê a retomada das discussões a respeito do conceito de função de \numa variável, suas representações, diversidade de casos e aplicações. Estende-se o estudo das \nfunções introduzindo o conceito de limite, de continuidade, a definição de derivada pautada na \nideia de limite, a ideia de taxa de variação, as regras de derivação de funções e aplicações das \nderivadas.  \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n141 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Proporcionar ao estudante a revisão e ampliação do estudo das funções de uma variável; \n2. Construir e aplicar as noções de limite e continuidade; \n3. Introduzir o conceito de derivada pautado na ideia de limite, o conceito de taxa de variação \ne regras de derivação de funções explícitas e implícitas; \n4. Estudar e propor aplicações das derivadas; \n5. Compreender o conceito de função como um caso particular de relação, e ampliar o estudo \nde seu comportamento por meio de conceitos do Cálculo Diferencial e Integral, articulados \ncom outras áreas do conhecimento e com a Educação Básica; \n6. Conceder conceitos que estruturam o Cálculo Diferencial e Integral, assim como as outras \náreas da matemática, trazendo discussões que abordam questões reflexivas sobre como a \nsimbologia e a linguagem matemática, as formas de demonstração e o deslocamento do \nsaber científico influenciam no processo de ensino e aprendizagem da matemática.",
        "Conteúdo Programático": "1. Funções: Definição; Formas de representação; Domínio e imagem; Estudo do sinal de \nfunções; Funções polinomial, exponencial, logarítmica, trigonométricas e envolvendo \nmódulo; \n2. Limites: Definição; Propriedades operatórias; Limites laterais, Limites Infinitos, Limites no \nInfinito, Assíntotas horizontais e Verticais; Limites fundamentais Trigonométrico e \nExponencial; Continuidade; Aplicações de Limites; \n3. Derivadas: Definição; Equação da reta tangente; Regras de derivação: derivada da função \nconstante, da função polinomial, exponencial, logarítmica e trigonométrica, regra do \nproduto, regra do quociente, regra da cadeia, regra de L’Hospital; Teorema do Valor Médio; \nDerivadas de funções implícitas, Derivadas superiores; Aplicações das derivadas ao estudo \nde gráficos e outros problemas."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Extensão 1",
        "Semestre": "3",
        "Ano": "",
        "Código": "CBTEXS1",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "6",
        "Total de aulas": "114",
        "CH Ensino": "0",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Prática",
        "Lab": "Sim",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Metodologias de ensino; \nConhecimentos específicos / Língua Portuguesa na prática docente; \nConhecimentos pedagógicos / 2. Didática; \nConhecimentos pedagógicos / 5. Diversidade, direitos humanos e inclusão.",
        "Ementa": "Este componente busca articular o conhecimento científico com as necessidades da comunidade \nde modo a transformar a realidade social, abordando princípios da cultura extensionista, sua \nevolução histórica no Brasil, aspectos legais, documentação institucional no IFSP, metodologias e \ntécnicas de pesquisa e demais elementos necessários para o desenvolvimento e execução de \nprojeto de extensão cujas ações prevejam a realização protagonizada pelos estudantes de \nprestação de serviço educacional para a comunidade ou preparação e oferecimento de curso(s) \nde interesse social, de modo que tais atividades estejam vinculadas à formação do aluno para a \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n144 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nprática docente, consistindo integralmente também em prática como componente curricular \n(PCC).",
        "Objetivos": "1. Propiciar ao licenciando a oportunidade de experimentar a realização de ações \nextensionistas de modo vinculado à sua formação docente; \n2. Desenvolver o protagonismo estudantil, contribuindo para a sua formação integral; \n3. Realizar a interação dialógica com a comunidade e os arranjos produtivos, culturais, \nartísticos e sociais locais e regionais; \n4. Promover os impactos social e acadêmico dos cursos, de discentes e servidores do IFSP; \n5. Desenvolver atividades práticas relacionadas à extensão; \n6. Possibilitar que os alunos utilizem e divulguem os conhecimentos científicos adquiridos \nao longo do seu curso, em particular os conhecimentos matemáticos, na contribuição do \ndesenvolvimento social externo ao seu ambiente acadêmico; \n7. Experimentar nas atividades extensionistas diferentes metodologias de ensino de \nmatemática; \n8. Utilizar a Língua Portuguesa, contextualizada na prática docente e nas atividades \nextensionistas.",
        "Conteúdo Programático": "1. Evolução histórica, conceitual, princípios, diretrizes, concepções e práticas da Extensão em \nInstituições de Ensino Superior; \n2. A Extensão no IFSP: Política de Extensão, documentação institucional vigente e ações de \nextensão; \n3. Técnicas de pesquisa e articulação dialógica junto à comunidade para identificação de \ndemandas, elaboração e desenvolvimento de projetos e programas extensionistas; \n4. O protagonismo estudantil e a Extensão na formação discente; Projetos e programas \nextensionistas, relatos de experiência e extensão em outras instituições; \n5. Observação, pesquisa, reflexão e discussão sobre problemas e ocasiões da comunidade \nexterna ao campus que podem ser positivamente intervencionadas por ações \nextensionistas; \n6. Estudo e implementação de metodologias ativas de ensino e aprendizagem e de gestão \nde projetos; \n7. Estudo, análise, reflexão e discussão de projeto(s) ou programa(s) de extensão previamente \naprovado(s) que possa(m) ser executado(s) ao longo desta disciplina; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n145 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n8. Divisão de tarefas, organização em grupos e preparação para a realização do(s) projeto(s) \nou programa(s) de extensão vinculados à disciplina; \n9. Execução das ações previstas pelo(s) projeto(s) ou programa(s) de extensão vinculados à \ndisciplina; \n10. Acompanhamento e observação de necessidades de adaptação das atividades previstas \nno(s) projeto(s) ou programa(s) à medida em que o(s) mesmo(s) estiver(em) sendo \nexecutado(s); \n11. Avaliação e discussão sobre os resultados observados na realização das atividades \nextensionistas relacionadas à disciplina e suas contribuições na formação dos estudantes \nprotagonistas dessas ações."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Geometria Analítica Vetorial",
        "Semestre": "3",
        "Ano": "",
        "Código": "CBTGANV",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Fundamentos de Geometria e Geometria Analítica;  \nConhecimentos específicos / Fundamentos de Álgebra Linear.",
        "Ementa": "Este componente curricular apresenta o conceito de vetor e suas operações básicas. Define base, \nproduto escalar, produto vetorial e produto misto. Explora sistemas de coordenadas no espaço, \nequações da reta e do plano e cálculo de distâncias no espaço cartesiano. Estuda as equações de \nsuperfícies quádricas.",
        "Objetivos": "1. Estudar elementos da geometria plana, espacial e analítica, destacando aspectos \nempíricos, algébricos, topológicos, axiomáticos, bem como suas construções, \ntransformações e relações com os conceitos de grandeza e medida, presentes no currículo \nda Educação Básica, possibilitando o estudo das diferentes geometrias; \n2. Compreender o papel dos sistemas lineares, utilizando matrizes e determinantes nos \nprocessos de resolução, destacando a reflexão sobre seu ensino na Educação Básica; \n3. Conhecer e utilizar os princípios da álgebra vetorial e da geometria analítica no espaço;  \n4. Promover a compreensão do aluno a respeito do uso de vetores como um instrumento \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n148 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \npara resolver problemas geométricos que envolvem relações entre pontos, retas e planos; \n5. Desenvolver a capacidade de reconhecer curvas e superfícies por meio de suas equações; \n6. Compreender o processo de ensino e aprendizagem de Geometria analítica na educação \nbásica.",
        "Conteúdo Programático": "1. Vetores: segmentos orientados, vetores, operações, dependência linear, base; \n2. Produtos: escalar, vetorial e misto; \n3. Sistema de coordenadas no espaço; \n4. Reta e plano no espaço: equações, posições relativas, perpendicularidade e \nortogonalidade, ângulos e distâncias; \n5. Mudança de sistema de coordenadas; \n6. Superfícies quádricas."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Geometria Euclidiana Espacial",
        "Semestre": "3",
        "Ano": "",
        "Código": "CBTGEES",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Fundamentos de Geometria e Geometria Analítica.",
        "Ementa": "Este componente curricular abrange tópicos de Geometria Espacial que vão desde postulados e \ndeterminação de retas e planos, posições relativas entre retas e planos e entre dois planos, \ndistâncias até definições de diedros, poliedros e poliedros regulares. Prismas, Pirâmides, Cilindros, \nCones e Esferas serão abordados e suas relações aprofundadas. O estudo de superfícies, de \npropriedades gerais, e cálculo de área das superfícies e volume dos sólidos (Princípio de Cavalieri). \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n150 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Estudar os elementos da geometria espacial, destacando aspectos empíricos, algébricos, \ntopológicos, axiomáticos, bem como suas construções, transformações e relações com os \nconceitos de grandeza e medida, presentes no currículo da Educação Básica, possibilitando \no estudo das diferentes geometrias; \n2. Desenvolver a percepção, explorar e representar o espaço físico, através do estudo da \ngeometria espacial; \n3. Compreender o método dedutivo para argumentar e concluir corretamente a partir de \ndados/fatos aceitos como verdadeiros; \n4. Investigar e explorar as propriedades gerais dos sólidos geométricos por meio da \nconstrução de modelos destes sólidos e de sua representação em perspectiva ou \nplanificada, por meio de desenho no papel ou com o uso de software e aplicativo; \n5. Calcular as áreas das superfícies destes sólidos e seus volumes; \n6. Compreender o processo de ensino e aprendizagem de Geometria Espacial na educação \nbásica.",
        "Conteúdo Programático": "1. Postulados de reta e plano;  \n2. Paralelismo e perpendicularismo entre retas, retas e planos e entre planos;  \n3. Distância entre dois pontos, de ponto a plano, de ponto a reta, entre retas, entre planos, \nentre reta e plano;  \n4. Poliedros, Poliedros de Platão, Teorema de Euler; \n5. Áreas e volumes (prismas, pirâmides, cilindros, cones e esferas)."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Introdução à Lógica de Programação",
        "Semestre": "3",
        "Ano": "",
        "Código": "CBTILPR",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Sim",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Interdisciplinaridade e desenvolvimento de projetos na Educação \nBásica; \nConhecimentos específicos / Tecnologias educacionais no ensino e aprendizagem da Matemática.",
        "Ementa": "Este componente curricular capacitará o estudante a construir algoritmos, assim como a assimilar \nmais facilmente qualquer linguagem de programação existente ou futura.",
        "Objetivos": "1. Capacitar o aluno a programar em qualquer linguagem, incluindo a linguagem orientada \na objetos; \n2. Contribuir para a construção de conhecimentos de programação que possam ser usados \ncomo ferramenta em estudos posteriores; \n3. Realizar a discussão de conhecimentos matemáticos articulados às diversas áreas do \nconhecimento humano, promovendo para uma visão interdisciplinar das Ciências, \nvalorizando a Matemática como campo de saber essencial à resolução de situações do \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n153 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nmundo real e dando subsídios para o desenvolvimento de projetos na Educação Básica; \n4. Garantir subsídios para a compreensão, utilização e criação de tecnologias educacionais, \nincluindo as tecnologias digitais de informação e comunicação, que auxiliam o ensino e a \naprendizagem da Matemática.",
        "Conteúdo Programático": "1.  Representação de algoritmos na forma descritiva e por fluxogramas; \n2.  Símbolos utilizados em fluxogramas. Introdução às linguagens de programação; \n3.  Representação de algoritmos matemáticos simples utilizando fluxogramas; \n4.  Ambiente de programação: edição e execução do programa; \n5.  Declaração e tipos de Variáveis, operadores, atribuição de valores e linhas de comentário; \n6.  Comandos de entrada e saída de dados; \n7.  Estruturas sequenciais; \n8.  Estruturas condicionais; \n9.  Estruturas e Repetição; \n10.  Estruturas com variáveis indexadas unidimensionais (arrays); \n11.  Estruturas com variáveis indexadas multidimensionais (matrizes); \n12.  Criação de Funções; \n13.  Criação de sub-rotinas (Procedimentos); \n14.  Recursividade; \n15.  Introdução à Programação Orientada a Objeto."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Organização e Gestão de Espaços Formais, não Formais e Informais de",
        "Semestre": "3",
        "Ano": "",
        "Código": "CBTOGEF",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.2 Sociologia da Educação; \nConhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.3 História da Educação; \nConhecimentos Pedagógicos / 2. Didática / 2.3 Métodos e técnicas de ensino; \nConhecimentos Pedagógicos / 4. Política e Organização da Educação Brasileira / 4.2 Legislação.",
        "Ementa": "Este componente curricular discute a organização e a gestão dos espaços formais, não-formais e \ninformais de educação e os conceitos teóricos envolvidos nesta temática, visando a promoção da \naprendizagem de pessoas em diferentes fases de desenvolvimento humano, considerando os \nfundamentos legais específicos. Analisa as estratégias de intervenção, animação sociocultural, \nsocioambiental e a produção de pesquisas que contribuam para a compreensão e realização \ndessas práticas.  \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n156 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Compreender o conceito de espaço formal, não-formal e informal de educação e suas \ninterrelações; \n2. Conhecer e refletir a respeito de experiências exitosas desenvolvidas em espaços formais, \nnão-formais e informais de educação; \n3. Promover a pesquisa, a análise e a reflexão da educação nos espaços formais e não-\nformais, enfatizando sua organização e gestão; \n4. Conhecer e compreender os diversos espaços educativos onde se desenvolvem atividades \nmatemáticas; \n5. Compreender os “porquês” da importância dos espaços formais, não-formais e informais \nde educação e os desafios para o estabelecimento de um diálogo entre os referidos \nespaços.",
        "Conteúdo Programático": "1. Organização e gestão de sistemas de ensino e das escolas; \n2. O conceito de educação formal e não-formal; \n3. Programas e projetos atuais de educação não-formal: escola da família, cidade educadora, \nentre outros; \n4. Construção de relações e espaços democráticos no âmbito escolar; \n5. Experiências educativas em espaços formais e não-formais; \n6. Redes de aprendizagem: educação inclusiva, educação do campo, educação social, \neducação indígena, Educação de Jovens e Adultos; \n7. Espaços formais e não-formais para o ensino de matemática; \n8. Normas de segurança nos espaços educativos formais e não-formais (NR 4, 5, 6, 9, 23 e \n24); \n9. Análise de espaços educativos formais, informais e não-formais e suas relações com a \nconstrução de saberes; \n10. Estudos sobre o ato de educar, dentro e fora da escola, ao longo da história da \nhumanidade, analisando a influência de aspectos religiosos, políticos, econômicos e \nfilosóficos que fundamentam a construção das diversas ideologias formativas; \n11. Práticas pedagógicas inclusivas; \n12. Transversalidade na educação. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n157 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Sociologia da Educação",
        "Semestre": "3",
        "Ano": "",
        "Código": "CBTSEDU",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.2 Sociologia da Educação; \nConhecimentos Pedagógicos / 6. Educação Profissional e Tecnológica.",
        "Ementa": "O componente curricular introduz o pensamento sociológico relacionado à educação e aborda as \ndiversas concepções de educação e sociedade e seus diferentes enfoques. Discute a escolarização \ncomo um valor da modernidade problematiza a relação entre as classes sociais, a estrutura social \ne a função social da escola. Discute as diferentes vertentes sociológicas que compreendem a \nescola como instituição de reprodução social e transmissão de conhecimento e àquelas que \nanalisam a escola como ponto central das transformações sociais. O impacto das revoluções \ntecnológicas nos processos civilizatório e a função social da escola; a relação da escola com a \nsociedade; a escola e seu processo de exclusão e inclusão; a educação para as questões \nsocioambientais e de direitos humanos. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n159 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Introduzir os estudantes aos temas da Sociologia da Educação por intermédio de \nabordagem de autores clássicos - Karl Marx, Max Weber e Émile Durkheim - e dos seus \nenfoques contemporâneos; \n2. Favorecer a compreensão das dimensões sociais da Educação, na sociedade moderna, a \npartir de categorias analíticas das principais teorias sociológicas; \n3. Analisar a relevância da educação nas relações sociais; \n4. Refletir acerca do papel social da escola diante das relações de desigualdade, de poder e \nde dominação.",
        "Conteúdo Programático": "1. A Sociologia da Educação no quadro das Ciências Sociais; \n2. Dimensões da educação na sociedade moderna; \n3. Educação enquanto sistema educativo; \n4. A Escola e a reprodução social e produção cultural;  \n5. Desigualdades sociais e desigualdades escolares;  \n6. Escola e diversidade;  \n7. Escola e Sociedade: educação e contextos sociais;  \n8. Educação e desenvolvimento econômico e social;  \n9. Perspectiva histórica do sistema educativo; \n10. Fracasso e sucesso escolar; \n11. A Escola e a reprodução social e produção cultural; \n12. A cultura escolar e os valores e comportamentos dos jovens;  \n13. Precarização da escola no contexto do neoliberalismo; \n14. Educação e trabalho; \n15. Cidadania, direitos humanos e a escola da educação básica."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Tecnologias Educacionais",
        "Semestre": "3",
        "Ano": "",
        "Código": "CBTTNED",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Sim",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Específicos / Tecnologias educacionais no ensino e aprendizagem da Matemática; \nConhecimentos Específicos / Metodologias de Ensino; \nConhecimentos Específicos / Tendências em Educação Matemática; \nConhecimentos Pedagógicos / 2. Didática / 2.3 Métodos e técnicas de ensino; \nConhecimentos Pedagógicos / 2. Didática / 2.4 Tecnologia e Mídias; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão  / 5.1 Educação \nespecial.",
        "Ementa": "Este componente curricular discute amplamente o conceito de tecnologia e promove uma reflexão \nsobre a importância da tecnologia nas atividades humanas, principalmente na educação. Estuda a \nmaneira pela qual as tecnologias podem contribuir positivamente para a superação de \nproblemáticas educacionais, sociais, ambientais e para o desenvolvimento científico e tecnológico. \nAborda a apropriação das tecnologias na prática pedagógica, com vistas a formar um docente \nque conheça, compreenda, utilize, crie e integre essas tecnologias às suas ações, com destaque \npara as digitais, de informação e comunicação e aquelas que possibilitem a prática de uma \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n162 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \neducação mais inclusiva. Discute a Educação a Distância (EaD), assim como seus recursos mais \nutilizados. Adota recursos de informática e contextos de ensino e aprendizagem tecnológicos, a \nfim de preparar os futuros educadores para a complexidade, a diversidade e a não fragmentação \ndo conhecimento. Promove discussões e propõe a elaboração de projetos ou sequências de \nensino de matemática para a Educação Básica que integrem as tecnologias de forma crítica e \nreflexiva.",
        "Objetivos": "1. Compreender, utilizar e criar tecnologias educacionais, incluindo as tecnologias digitais de \ninformação e comunicação, que auxiliam o ensino e a aprendizagem da Matemática, nas \ndiferentes modalidades de educação, discutindo-as de forma crítica, significativa, reflexiva \ne ética nas diversas práticas docentes; \n2. Realizar a curadoria educacional, utilizar as tecnologias digitais, os conteúdos virtuais e \noutros recursos tecnológicos e incorporá-los à prática pedagógica, com vistas a \npotencializar e transformar as experiências de aprendizagem dos estudantes da Educação \nBásica e estimular uma atitude investigativa; \n3. Conhecer e utilizar tecnologias educacionais que possibilitem práticas pedagógicas \ninclusivas no ensino de matemática na Educação Básica; \n4. Estudar, compreender e utilizar diferentes metodologias de ensino de matemática para a \nEducação Básica que integrem de forma crítica e reflexiva as novas tecnologias para a \neducação; \n5. Estudar as tendências em educação matemática que discutem as novas tecnologias para a \neducação com vistas a implementá-las no processo de ensino e aprendizagem de \nmatemática na Educação Básica; \n6. Compreender o papel e o potencial das tecnologias digitais e de informação e \ncomunicação no ensino de matemática presencial, híbrido e on-line; \n7. Estudar a Educação a Distância e seus recursos, dentre eles: videoaula, ambientes virtuais \nde aprendizagem, videoconferência, chats e fóruns, bibliotecas virtuais entre outros; \n8. Conhecer e elaborar sequências de ensino de matemática que integrem as novas \ntecnologias educacionais e permitem a implementação de metodologias de aprendizagem \nativas e colaborativas; \n9. Compreender os impactos das tecnologias na vida em sociedade e no meio ambiente.",
        "Conteúdo Programático": "1. O conceito de tecnologia, suas características e importância para a atividade humana; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n163 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n2. Tipos de tecnologia: analógica, digital, informática, educacional, de gestão, da inteligência \nentre outras; \n3. A evolução tecnológica no Brasil e no mundo, seus aspectos históricos e filosóficos; \n4. Tecnologia, inovação, obsolescência programada, consumismo e meio ambiente; \n5. A tecnologia no trabalho docente e na prática pedagógica; \n6. A ação pedagógica mediada por recursos tecnológicos e sua relação com a equidade e \njustiça social; \n7. O processo de ensino e aprendizagem de Matemática com tecnologias na Educação Básica; \n8. O ensino e a aprendizagem de matemática com tecnologias na BNCC; \n9. Recursos tecnológicos para o ensino de matemática: materiais manipulativos, calculadora, \nsoftwares de geometria dinâmica, de programação, de computação algébrica, planilhas \neletrônicas, editores de texto, jogos digitais entre outros; \n10. Tecnologia, acessibilidade e práticas inclusivas no ensino e aprendizagem de matemática \nna Educação Básica; \n11. Tecnologias e metodologias ativas e colaborativas de ensino e aprendizagem; \n12. Conceito de Educação a Distância, suas caraterísticas, sua história e recursos."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Álgebra Linear",
        "Semestre": "4",
        "Ano": "",
        "Código": "CBTALIN",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Fundamentos de Álgebra Linear.",
        "Ementa": "Este componente curricular define espaços e subespaços vetoriais. Aborda os conceitos base e \ndimensão de um subespaço vetorial. Estuda transformações lineares, autovetores e autovalores.",
        "Objetivos": "1. Realizar o estudo dos sistemas lineares, utilizando matrizes e determinantes nos processos \nde resolução, destacando a reflexão sobre seu ensino na Educação Básica, bem como a \nfundamentação para a compreensão dos conceitos de Espaços Vetoriais e Transformações \nLineares, suas relações com outros componentes curriculares e aplicações em outras áreas \ndo conhecimento; \n2. Introduzir o conceito de Espaço Vetorial, Transformação Linear, Autovalor e Autovetor;  \n3. Capacitar o aluno a resolver problemas envolvendo sistemas de equações lineares, \ntransformações lineares, cálculo matricial, cálculo vetorial, autovalores e autovetores.",
        "Conteúdo Programático": "Projeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n166 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n1. Espaços vetoriais; \n2. Subespaços vetoriais; \n3. Combinações lineares; \n4. Dependência linear; \n5. Base e dimensão de um subespaço vetorial; \n6. Coordenadas; \n7. Matriz de mudança de base; \n8. Transformações lineares; \n9. A matriz de uma transformação linear; \n10. Autovalores e autovetores; \n11. Diagonalização de matrizes."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Cálculo Diferencial e Integral 2",
        "Semestre": "4",
        "Ano": "",
        "Código": "CBTCDF2",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Específicos / Função e Cálculo Diferencial e Integral; \nConhecimentos Específicos / Fundamentos de Análise.",
        "Ementa": "Este componente curricular pretende explorar o conceito de integral indefinida e definida, \ndestacar as diferentes técnicas de integração de funções, bem como usar tais conceitos para o \ncálculo de áreas, volumes, entre outras aplicações.",
        "Objetivos": "1. Explorar os conceitos da integral, avançando em regras de integração e o cálculo de \nintegrais definidas, fazendo aplicações de integrais; \n2. Compreender o conceito de função como um caso particular de relação, e ampliar o estudo \nde seu comportamento por meio de conceitos do Cálculo Diferencial e Integral, articulados \ncom outras áreas do conhecimento e com a Educação Básica;  \n3. Conceder conceitos que estruturam o Cálculo Diferencial e Integral, assim como as outras \náreas da matemática, trazendo discussões que abordam questões reflexivas sobre como a \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n168 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nsimbologia e a linguagem matemática, as formas de demonstração e o deslocamento do \nsaber científico influenciam no processo de ensino e aprendizagem da matemática.",
        "Conteúdo Programático": "1. Integrais: Primitivas Imediatas; Integral indefinida; Definição de integral; Integral definida; \nTeorema Fundamental do Cálculo; Área entre curvas; \n2. Técnicas de integração: Integração por substituição de variáveis; Integração por partes; \nIntegração de potências das funções trigonométricas; Integração por substituição \ntrigonométrica; Integração de funções racionais por frações parciais; Aplicações de \nIntegrais; Noções de integrais impróprias."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Ensino de Medidas e sua relação com os Números Racionais",
        "Semestre": "4",
        "Ano": "",
        "Código": "CBTEMRR",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Fundamentos de Geometria e Geometria Analítica; \nConhecimentos específicos / Metodologias de ensino.",
        "Ementa": "O eixo Grandezas e Medidas será foco do componente, desde os conceitos relacionados à medição \ndireta e indireta até à geometria métrica. Para isso, serão explorados instrumentos de medição de \nacordo com diferentes grandezas a serem medidas. O componente retomará aos fundamentos de \nnúmeros racionais de modo a relacioná-lo sob o viés histórico e conceitual relativo ao \nconhecimento de unidade de medida. A carga horária de PCC deve ser destinada às discussões e \nelaboração de projetos sobre o ensino e aprendizagem de medidas na educação básica.",
        "Objetivos": "1. Estudar elementos da geometria plana e espacial, destacando suas relações com os \nconceitos de grandeza e medida, presentes no currículo da Educação Básica, possibilitando \no estudo das diferentes geometrias; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n170 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n2. Compreender e experimentar diferentes metodologias de ensino de números racionais e \ngrandezas e medidas; \n3. Compreender que medir é comparar direta ou indiretamente uma grandeza e investigar \ndiferentes formas de medição; \n4. Explorar as grandezas abordadas nos Ensinos Fundamental e Médio a fim de refletir sobre \npossibilidades do ensino; \n5. Efetuar medições, reconhecendo, em cada situação, a necessária precisão de dados ou de \nresultados e estimando margens de erro; \n6. Relacionar o eixo Grandezas e Medidas ao conceito dos números racionais de modo a \nrefletir sobre as possibilidades de ensino; \n7. Utilizar propriedades geométricas para medir, quantificar e fazer estimativas de \ncomprimentos, áreas e volumes;  \n8. Compreender o processo de ensino e aprendizagem de medidas na educação básica.",
        "Conteúdo Programático": "1. Noção de Grandeza e medição; \n2. Grandezas, comprimento, superfície, capacidade, volume, massa, tempo e ângulo: \nprocessos de medição, instrumentos e unidades de medidas, estimativa, precisão e \nmargens de erro; \n3. Relação entre os números racionais e medidas;  \n4. O ensino de frações e decimais nas séries iniciais do Ensino Fundamental;  \n5. A abordagem das operações com frações e decimais no Ensino Fundamental utilizando o \nconceito de área; \n6. Geometria métrica: medição e as propriedades geométricas das formas;  \n7. O processo de ensino e aprendizagem de medidas na educação básica."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Estruturas Algébricas 1",
        "Semestre": "4",
        "Ano": "",
        "Código": "CBTEAL1",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Pensamento algébrico e Estruturas algébricas.",
        "Ementa": "Este componente curricular aborda temas que solidificam o conhecimento do aluno em estruturas \nmatemáticas elementares, como conjuntos, relações, funções e operações, e preparam o \nestudante para, após este curso, ter condições de desenvolver estudos sobre as estruturas \nalgébricas mais comuns.",
        "Objetivos": "1. Compreender o desenvolvimento do pensamento algébrico e das Estruturas algébricas, \nalém de suas potencialidades para a fundamentação do ensino e da aprendizagem da \nmatemática e para a reflexão sobre a prática docente; \n2. Solidificar o conhecimento e o domínio sobre conceitos abstratos envolvendo conjuntos e \nfunções; \n3. Apresentar e explorar o conceito de relação binária, em especial tratando sobre relações \nde equivalência e relações de ordem; \n4. Compreender o conceito de conjunto quociente, em especial tratando sobre o conjunto \ndos inteiros módulo m; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n173 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n5. Conhecer os conceitos e as principais propriedades envolvendo leis de composição interna \n(operações); \n6. Preparar o estudante para um estudo posterior sobre as estruturas algébricas mais comuns.",
        "Conteúdo Programático": "1. Conjuntos: conceitos elementares, subconjuntos, diagramas de Venn, operações entre \nconjuntos (união, intersecção e complementar), produto cartesiano, cardinalidade; \n2. Relações binárias: conceitos elementares, propriedades, relações de equivalência, classes \nde equivalência, conjunto quociente, partição de um conjunto, relação de ordem; \n3. Funções (aplicações): conceitos elementares, injetividade, sobrejetividade, bijetividade, \ncomposição de funções, invertibilidade, monotonicidade; \n4. Operações (leis de composição internas): conceitos elementares, propriedades \n(associatividade, comutatividade, elemento neutro, elemento simétrico, regularidade, \nfechamento), tábua de uma operação; \n5. Conjunto dos inteiros módulo m (Zm): conceitos elementares e operações; \n6. Noções sobre permutações: conceitos elementares, composição de permutações, o \nconjunto das permutações Sn, ciclos e transposições. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n174 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Extensão 2",
        "Semestre": "4",
        "Ano": "",
        "Código": "CBTEXS2",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "6",
        "Total de aulas": "114",
        "CH Ensino": "0",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Prática",
        "Lab": "Sim",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Metodologias de ensino; \nConhecimentos específicos / Língua Portuguesa na prática docente; \nConhecimentos pedagógicos / 2. Didática; \nConhecimentos pedagógicos /  5. Diversidade, direitos humanos e inclusão. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n176 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Ementa": "Este componente curricular busca articular o conhecimento científico com as necessidades da \ncomunidade de modo a transformar a realidade social através da execução de projeto de extensão \ncujas ações prevejam a realização protagonizada pelos estudantes de prestação de serviço \neducacional para a comunidade ou preparação e oferecimento de curso(s) de interesse social, de \nmodo que tais atividades estejam vinculadas à formação do aluno para a prática docente, \nconsistindo integralmente também em prática como componente curricular (PCC).",
        "Objetivos": "1. Propiciar ao licenciando a oportunidade de experimentar a realização de ações \nextensionistas de modo vinculado à sua formação docente; \n2. Desenvolver o protagonismo estudantil, contribuindo para a sua formação integral; \n3. Realizar a interação dialógica com a comunidade e os arranjos produtivos, culturais, \nartísticos e sociais locais e regionais; \n4. Promover os impactos social e acadêmico dos cursos, de discentes e servidores do IFSP; \n5. Desenvolver atividades práticas relacionadas à extensão; \n6. Possibilitar que os alunos utilizem e divulguem os conhecimentos científicos adquiridos \nao longo do seu curso, em particular os conhecimentos matemáticos, na contribuição do \ndesenvolvimento social externo ao seu ambiente acadêmico; \n7. Experimentar nas atividades extensionistas diferentes metodologias de ensino de \nmatemática; \n8. Utilizar a Língua Portuguesa, contextualizada na prática docente e nas atividades \nextensionistas. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n177 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Conteúdo Programático": "1. Observação, pesquisa, reflexão e discussão sobre problemas e ocasiões da comunidade \nexterna ao campus que podem ser positivamente intervencionadas por ações \nextensionistas; \n2. Estudo e implementação de metodologias ativas de ensino e aprendizagem e de gestão \nde projetos; \n3. Estudo, análise, reflexão e discussão de projeto(s) ou programa(s) de extensão previamente \naprovado(s) que possa(m) ser executado(s) ao longo desta disciplina; \n4. Divisão de tarefas, organização em grupos e preparação para a realização do(s) projeto(s) \nou programa(s) de extensão vinculados à disciplina; \n5. Execução das ações previstas pelo(s) projeto(s) ou programa(s) de extensão vinculados à \ndisciplina; \n6. Acompanhamento e observação de necessidades de adaptação das atividades previstas \nno(s) projeto(s) ou programa(s) à medida em que o(s) mesmo(s) estiver(em) sendo \nexecutado(s); \n7. Avaliação e discussão sobre os resultados observados na realização das atividades \nextensionistas relacionadas à disciplina e suas contribuições na formação dos estudantes \nprotagonistas dessas ações."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Filosofia da Educação",
        "Semestre": "4",
        "Ano": "",
        "Código": "CBTFEDU",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.1 Filosofia da Educação; \nConhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.2 Sociologia da Educação; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão / 5.2 Educação para as \nrelações étnico- raciais e indígenas; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão / 5.3 Educação em \nDireitos Humanos; \nConhecimentos Pedagógicos / 6. Educação Profissional e Tecnológica.",
        "Ementa": "Discutir as principais teorias do conhecimento produzidas pela filosofia ocidental e não ocidental \nna busca de sentido e fundamentação da educação de forma ampla e, da educação matemática, \nde forma específica a fim de que, tais teorias, possam embasar filosoficamente a reflexão crítica e \na prática docentes dos egressos do curso de licenciatura em matemática. Ainda, relacionar as \nmatrizes da educação contemporânea brasileira e os problemas pedagógicos cotidianos com a \nreflexão e a crítica filosófica na formação de sujeitos sensíveis aos problemas educacionais atuais. \nFinalmente, a disciplina, a partir do pensamento filosófico clássico e contemporâneo, irá pensar \nas questões axiológicas e epistemológicas que permeiam a educação escolar brasileira; as relações \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n180 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nidentitárias e de gênero, passando por questões étnico-raciais e direitos humanos; os usos e \nabusos das novas tecnologias aplicadas ao mundo do trabalho e ao universo educacional; as \nperspectivas e os impasses da educação escolar brasileira; as relações da educação escolar oficial \ncom o Estado, a sociedade, o mundo do trabalho e o meio ambiente.",
        "Objetivos": "1. Fundamentar filosoficamente o papel da educação ao longo da história e \ncontemporaneamente;  \n2. Pensar e interpretar, à luz dos pensadores clássicos e contemporâneos, o lugar da \neducação escolar na formação de sujeitos críticos e reflexivos; \n3. Articular através das teorias soluções práticas para os problemas e impasses que afetam a \neducação escolar brasileira; \n4. Fazer a análise de textos filosóficos relacionando-os à educação escolar no sentido lato e \nà educação matemática no sentido estrito; \n5. Abordar a relação histórico-filosófica para entender os princípios da educação escolar \nbrasileira, os impasses e possíveis projeções de novos rumos;  \n6. Criar condições para que o licenciando em matemática consiga relacionar os temas \ntrabalhados em sala com o respeito às diferenças, com o mundo do trabalho, com o meio \nambiente e à realização pessoal.",
        "Conteúdo Programático": "1. Introdução à filosofia: O que é filosofia? Relação entre conhecimento filosófico e os \nconhecimentos mítico, senso comum, religioso, artísticos e científicos. As divisões da \nfilosofia - axiologia (ética e estética), epistemologia, metafísica, teoria política e lógica - e \nsuas relações com o pensamento pedagógico. Filosofia: para quê e para quem? \n2. A construção do conhecimento e o papel da escola nos processos de formação humana, \nsob a perspectiva histórica-filosófica; \n3. Análise filosófica sobre a formação humana como processo e como produto social e as \nteorias educacionais decorrentes das diferentes formas de pensar o ser humano, a \nnatureza, a sociedade e a cultura; \n4. A construção da contemporaneidade e das epistemologias hegemônicas, não-\nhegemônicas e contra- hegemônicas e suas relações com a educação, sob o viés crítico da \nfilosofia; \n5. Alteridade e educação: análise filosófica das relações de poder na escola; a educação \nescolar e a construção da consciência democrática; escola e a responsabilidade social de \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n181 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \ninclusão dos diferentes, das diferenças e das múltiplas formas de ser pensar e ser na \nsociedade;  \n6. Análise filosófica das teorias antirracistas e antissexista na construção de uma escola plural. \nPolíticas inclusivas e educação: impasses e possibilidades; \n7. Impasses e perspectivas da educação: análise à luz dos pensadores clássicos e \ncontemporâneos da filosofia e através de diferentes olhares do pensamento educacional: \naspectos epistemológicos, éticos e políticos; \n8. A construção da ética no espaço escolar e na atuação docente, considerando-se que a ética \né a base da ação educativa e que dela deriva; \n9. Quem educa quem e para quê? Análise filosófica sobre os sujeitos, os fins e as finalidades \nda educação; \n10. Análise filosófica-pedagógica sobre os usos e abusos das tecnologias de informação e \ncomunicação no mundo do trabalho e suas aplicações no processo de ensino-\naprendizagem. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n182 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Pedagogias Inovadoras",
        "Semestre": "4",
        "Ano": "",
        "Código": "CBTPINO",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Tecnologias educacionais no ensino e aprendizagem da Matemática; \nConhecimentos específicos / Tendências em Educação Matemática; \nConhecimentos Pedagógicos / 2. Didática / 2.1 Ensino e aprendizagem; \nConhecimentos Pedagógicos / 2. Didática / 2.3 Métodos e técnicas de ensino; \nConhecimentos Pedagógicos / 2. Didática / 2. Didática / 2.4 Tecnologia e Mídias.",
        "Ementa": "Este componente curricular aborda aspectos inovadores metodológicos, filosóficos, políticos, \ncientíficos, tecnológicos e legais sobre formação e prática docente, bem como formas de gestão \ne de organização do processo formativo e educativo em Matemática, em escolas de ensino \nfundamental II e ensino médio e em processos de educação permanente em Matemática. Discute \na maneira pela qual o ensino de Matemática inovador pode contribuir positivamente para a \nsuperação de problemáticas educacionais, sociais, ambientais e para o desenvolvimento científico \ne tecnológico. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n185 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Conhecer processos pedagógicos inovadores de formação e prática docente e refletir \nsobre sua implementação no ensino e aprendizagem de Matemática; \n2. Estudar as tendências em educação matemática destacando os aspectos políticos, \nculturais, sociais, pedagógicos e filosóficos que envolvem o ensino de matemática; \n3. Conhecer os princípios da Educação Matemática Crítica e compreender as possibilidades \ndo trabalho com cenários de investigação e resolução de problemas em contextos \nrelevantes para esta geração, incluindo aqueles que abordam as problemáticas \neducacionais, sociais, políticas e ambientais; \n4. Conhecer, compreender e aplicar novas metodologias no ensino de matemática na \neducação básica; \n5. Compreender, utilizar e criar tecnologias educacionais, incluindo as tecnologias digitais de \ninformação e comunicação, que auxiliam o ensino e a aprendizagem da Matemática, nas \ndiferentes modalidades de educação, discutindo-as de forma crítica, significativa, reflexiva \ne ética nas diversas práticas docentes; \n6. Estudar as tendências em educação matemática destacando os aspectos políticos, \nculturais, sociais, pedagógicos e filosóficos que envolvem o ensino de matemática.",
        "Conteúdo Programático": "1. Aspectos e bases filosóficas, políticas e legais inovadoras sobre formação e prática \ndocente; \n2. Novas Tecnologias da Informação e da Comunicação na formação e prática docente; \n3. Inovação e pesquisa na formação e prática docente; \n4. Tendências em Educação Matemática; \n5. Metodologias inovadoras de ensino e aprendizagem de Matemática: ensino híbrido, \naprendizagem baseada em projetos, problemas e histórias, cultura maker e outras \nmetodologias ativas; \n6. O processo de ensino e aprendizagem baseado na resolução de problemas ou em cenários \nde investigação, sua relação com o desenvolvimento científico, tecnológico e suas \nimplicações para a vida em sociedade, sustentabilidade e meio ambiente; \n7. Trabalho colaborativo e participativo; \n8. Direitos humanos e práticas inovadoras na educação. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n186 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Pesquisa em Educação Matemática",
        "Semestre": "4",
        "Ano": "",
        "Código": "CBTPQEM",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Específicos / Tendências em Educação Matemática; \nConhecimentos Específicos / Língua Portuguesa na prática docente; \nConhecimentos Pedagógicos / 2. Didática / 2.3 Métodos e técnicas de ensino.",
        "Ementa": "Este componente apresenta e discute temas e pesquisas atuais em educação matemática. Dessa \nforma, serão objetos de estudo as tendências temáticas e metodológicas na área, dentre elas, \npesquisa experimental, pesquisa-ação, estudo de caso, estudo etnográfico, análise de conteúdo, \npesquisa histórica e pesquisa bibliográfica. Métodos qualitativos e quantitativos na pesquisa em \neducação e educação matemática serão abordados de modo a subsidiar a formulação e condução \nde projetos de pesquisa. Estuda a maneira pela qual a pesquisa científica pode contribuir para o \naprimoramento da prática docente e para a superação de problemáticas educacionais, sociais, \nambientais e para o desenvolvimento científico e tecnológico.",
        "Objetivos": "1. Reconhecer os problemas concebidos em pesquisas acadêmicas da área da educação e da \neducação matemática e a forma como esses problemas de pesquisa são estudados e \ntratados; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n188 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n2. Refletir sobre a coerência interna de pesquisas acadêmicas na área da educação e da \neducação matemática; \n3. Conhecer e compreender as pesquisas acadêmicas que tratam das tendências em \neducação matemática, destacando os aspectos políticos, culturais, sociais, pedagógicos e \nfilosóficos que envolvem o ensino de matemática; \n4. Caracterizar e diferenciar pesquisa qualitativa e quantitativa, bem como buscar exemplos \nde cada tipo na educação e na educação matemática; \n5. Compreender e diferenciar os paradigmas epistemológicos e refletir sobre a relação deles \ncom as metodologias de pesquisa científica utilizadas na educação e educação \nmatemática; \n6. Realizar estudo da Língua Portuguesa, contextualizado na prática docente, englobando a \nabordagem de capacidades, estratégias de leitura, interpretação, produção oral, escrita e \ndocumentação de textos acadêmicos e científicos, reconhecendo sua importância social e \ncultural; \n7. Elaborar fichamentos e resenhas críticas de pesquisas acadêmicas para compreender suas \npartes principais e os processos de revisão bibliográfica; \n8. Elaborar plano ou projeto de pesquisa.",
        "Conteúdo Programático": "1. Paradigmas epistemológicos e sua relação com a pesquisa científica; \n2. Características da pesquisa qualitativa e quantitativa; \n3. Característica das principais metodologias da pesquisa em educação e educação \nmatemática: pesquisas descritivas e pesquisas de intervenção, estudo de caso, estudo \netnográfico, análise de conteúdo, pesquisa experimental, pesquisa quase experimental, \npesquisa ação, pesquisa participante etc.; \n4. Outras abordagens metodológicas de pesquisa: estudos transversais e longitudinais, \npesquisa histórica, estudos narrativos, estudos comparativos causais, estudos \ncorrelacionais e pesquisa de revisão bibliográfica; \n5. Pesquisa como método pedagógico; \n6. Estrutura de um projeto de pesquisa; \n7. Argumentação e coerência teórica e metodológica. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n189 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Teoria dos Números",
        "Semestre": "4",
        "Ano": "",
        "Código": "CBTTNUM",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Pensamento algébrico e Estruturas algébricas.",
        "Ementa": "Este componente curricular discute tópicos elementares de teoria dos números, tais como o \nprincípio da boa ordenação no conjunto dos números inteiros, divisibilidade, aritmética modular \netc. Apresenta os conceitos de modo a evidenciar o caráter dedutivo do conhecimento \nmatemático, por meio do trabalho com provas e demonstrações. Estabelece relações entre a teoria \ndos números e o estudo das estruturas algébricas. Estabelece relações entre a teoria dos números \ne a matemática escolar.",
        "Objetivos": "1. Conhecer e compreender tópicos elementares da teoria dos números, resolvendo \nproblemas, exercícios e elaborando provas e demonstrações; \n2. Compreender as relações entre os conceitos estudados em teoria dos números e o estudo \ndas estruturas algébricas abstratas; \n3. Conhecer e compreender as relações entre os conceitos estudados em teorias dos números \ne o ensino e aprendizagem de número e operações na educação básica; \n4. Introduzir conceitos básicos para a compreensão do desenvolvimento do pensamento \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n191 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nalgébrico e das estruturas algébricas, além de suas potencialidades para a fundamentação \ndo ensino e da aprendizagem da matemática e para a reflexão sobre a prática docente.",
        "Conteúdo Programático": "1. Tipos de prova: contraexemplo, prova direta, prova por contraposição, redução ao absurdo, \nindução finita entre outras; \n2. Axiomas de Peano, princípio da boa ordenação e princípio de indução matemática; \n3. Conjunto dos números inteiros: características, operações e propriedades; \n4. Divisibilidade, MDC, MMC e algoritmo da divisão no conjunto dos números inteiros; \n5. Equações diofantinas lineares; \n6. Números Primos e compostos; \n7. Teorema Fundamental da Aritmética e aplicações; \n8. Congruência, equivalência e aritmética modular; \n9. Relações entre os conceitos da teoria dos números e a matemática escolar; \n10. Relações entre os conceitos da teoria dos números e o estudo das estruturas algébricas. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n192 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Cálculo Diferencial e Integral 3",
        "Semestre": "5",
        "Ano": "",
        "Código": "CBTCDF3",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Função e Cálculo Diferencial e Integral;  \nConhecimentos específicos / Fundamentos de Análise.",
        "Ementa": "Este componente curricular prevê a introdução ao Cálculo de funções de várias variáveis, \ndestacando os conceitos de limite, derivada e integral para esses tipos de função.  \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n194 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Compreender o conceito de função como um caso particular de relação, e ampliar o estudo \nde seu comportamento por meio de conceitos do Cálculo Diferencial e Integral, articulados \ncom outras áreas do conhecimento e com a Educação Básica; \n2. Conceder conceitos que estruturam o Cálculo Diferencial e Integral, assim como as outras \náreas da matemática, trazendo discussões que abordam questões reflexivas sobre como a \nsimbologia e a linguagem matemática, as formas de demonstração e o deslocamento do \nsaber científico influenciam no processo de ensino e aprendizagem da matemática; \n3. Estender o conceito de limite, continuidade, derivada e integral no contexto das funções \nde várias variáveis; \n4. Compreender os conceitos e as propriedades de continuidade e diferenciabilidade, das \nfunções reais (escalares) de várias variáveis reais e das funções vetoriais de uma e várias \nvariáveis reais; \n5.  Estudar o conceito de derivada direcional e gradiente e aplicá-los à construção do plano \ntangente e ao encontro de extremos locais; \n6. Estudar integrais duplas e triplas e seus métodos de cálculo.",
        "Conteúdo Programático": "1. Cálculo diferencial de funções de mais de uma variável: funções de mais de uma variável, \nparametrização de curvas, limite de funções de mais de uma variável, continuidade de \nfunções de mais de uma variável, derivadas parciais, diferenciabilidade e diferencial total, \nregra da cadeia, derivadas parciais de ordem superior; \n2. Derivadas direcionais e aplicações das derivadas parciais: derivadas direcionais e \ngradientes, planos tangentes e normais a superfícies, extremos de funções de duas \nvariáveis; \n3. Integração múltipla: integral dupla, cálculo de integrais duplas e integrais iteradas, integral \ndupla em coordenadas polares, área de uma superfície, integral tripla, integral tripla em \ncoordenadas cilíndricas e esféricas, mudança de variáveis em integrais múltiplas. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n195 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Cálculo Numérico",
        "Semestre": "5",
        "Ano": "",
        "Código": "CBTCANU",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "N/A",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Função e Cálculo Diferencial e Integral.",
        "Ementa": "O componente curricular desenvolve importantes ferramentas para a resolução de problemas \noriundos da própria matemática, ou de outras áreas, estabelecendo um elo entre matemática e \nproblemas práticos de áreas específicas.  Para a resolução desses problemas, o cálculo numérico \nirá focar na quantificação dos erros cometidos nas diversas etapas de aproximação numérica, tais \ncomo arredondamento e truncamento, e com questões mais refinadas no escopo dos processos \nde aproximação, como discretização e iteração, e principalmente, da taxa de convergência das \nsequências de soluções aproximadas para as soluções exatas dos modelos matemáticos sob \ninvestigação.  \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n197 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Compreender o conceito de função como um caso particular de relação, e ampliar o estudo \nde seu comportamento por meio de conceitos do Cálculo Diferencial e Integral, articulados \ncom outras áreas do conhecimento e com a Educação Básica; \n2. Compreender como os números são representados nas calculadoras e computadores e \ncomo são realizadas as operações nestes sistemas; \n3. Conhecer e aplicar os principais métodos numéricos para a solução de certos problemas;  \n4. Estimar e analisar os erros obtidos;  \n5. Utilizar as tecnologias digitais, com destaque para os recursos que envolvem o uso de \nlinguagens de programação, para abordar os principais métodos e processos do Cálculo \nNumérico.",
        "Conteúdo Programático": "1. Noções básicas sobre erros; \n2. Zeros reais de funções reais:  isolamento das raízes; refinamento; métodos da bissecção, \nda posição falsa, do ponto fixo, de Newton-Raphson e da secante; \n3. Resolução de sistemas lineares:  métodos diretos; métodos iterativos; \n4. Interpolação: interpolação polinomial; estudo do erro na interpolação; \n5. Ajuste de curvas:  caso discreto e contínuo; método dos mínimos quadrados;  \n6.  Integração numérica:  regra dos trapézios; regra de Simpson;  \n7. Soluções numéricas de equações diferenciais ordinárias: problemas de valor inicial; \nequações de ordem superior. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n198 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Ensino de Geometria",
        "Semestre": "5",
        "Ano": "",
        "Código": "CBTEGEO",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Fundamentos de Geometria e Geometria Analítica; \nConhecimentos específicos / Metodologias de ensino; \nConhecimentos específicos / Tendências em Educação Matemática;  \nConhecimentos pedagógicos / Didática / 2.1.Ensino e aprendizagem; \nConhecimentos pedagógicos / Didática / 2.3.Métodos e técnicas de ensino. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n200 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Ementa": "O componente curricular trata dos temas de Geometria por meio do estudo e da reflexão sobre \nações didáticas para o ensino e a aprendizagem dos objetos do conhecimento desse eixo temático \nda Educação Básica. Aborda o desenvolvimento do pensamento e percepção geométricos, bem \ncomo o letramento matemático como competência para resolver situações problema de \ngeometria. Materiais estruturados e não estruturados para o ensino Geometria Plana e não plana \nsão objetos de estudo e análise, bem como o uso de jogos, o ensino da linguagem, das notações \ne do vocabulário geométricos, o trabalho com construções geométricas, a proposição de \nsequências didáticas e outras abordagens pertinentes ao ensino de Geometria na Educação Básica. \nA Prática como Componente Curricular (PCC) se dará pela análise, reflexão e proposição de ações \ndidáticas vivenciadas no decorrer do componente curricular.",
        "Objetivos": "1. Compreender e experimentar diferentes metodologias de ensino geometria; \n2. Estudar elementos da geometria plana, espacial, destacando aspectos empíricos, \nalgébricos, axiomáticos, bem como suas construções, transformações e relações com os \nconceitos de grandeza e medida, presentes no currículo da Educação Básica, possibilitando \no estudo das diferentes geometrias;  \n3. Estudar tendências em educação matemática envolvendo o ensino de geometria; \n4. Refletir sobre o desenvolvimento da percepção espacial dos alunos e investigar \npossibilidades de intervenção para que os alunos avancem; \n5. Compreender teorias de diferentes autores sobre o desenvolvimento do pensamento \ngeométrico e relacionar com propostas de ensino de Geometria; \n6. Refletir sobre o ensino de geometria e as dificuldades que os estudantes da Educação \nBásica costumam apresentar evidenciando a relação entre as ações didáticas e a \naprendizagem dos conceitos; \n7. Conhecer, explorar e investigar o uso de materiais estruturados e não estruturados e outros \nrecursos associados ao ensino de geometria discutindo suas potencialidades e limitações \nno processo de aprendizagem; \n8. Conhecer, explorar e investigar e discutir as potencialidades e limitações de recursos \ndidáticos, como materiais estruturados e não estruturados para o Ensino de Geometria; \n9. Conhecer a abordagem do eixo temático Geometria nos documentos oficiais brasileiros \nda Educação e refletir sobre o ensino praticado ao longo do tempo. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n201 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Conteúdo Programático": "1. Desenvolvimento de percepção espacial e de Pensamento Geométrico; \n2. O Ensino de figuras planas: polígonos e não polígonos; \n3. O Ensino de figuras não planas; \n4. O Ensino das transformações geométricas; \n5. Construções geométricas e o ensino de geometria; \n6. Ensino/aprendizagem de geometria nos documentos oficiais da Educação do Brasil;  \n7. Recursos didáticos para o ensino de Geometria."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Estruturas Algébricas 2",
        "Semestre": "5",
        "Ano": "",
        "Código": "CBTEAL2",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Pensamento algébrico e Estruturas algébricas. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n203 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n3 – EMENTA:    \nEste componente curricular aborda de maneira introdutória as estruturas algébricas mais comuns: \ngrupos, anéis e corpos. Destaca-se nesta componente o estudo sobre anéis de polinômios, \nprincipalmente aqueles com coeficientes racionais e reais, e a menção ao Teorema Fundamental \nda Álgebra.  \n4 – OBJETIVOS: \n1. Compreender o desenvolvimento do pensamento algébrico e das Estruturas algébricas, \nalém de suas potencialidades para a fundamentação do ensino e da aprendizagem da \nmatemática e para a reflexão sobre a prática docente; \n2. Apresentar de maneira introdutória a teoria de grupos devidamente contextualizada a fim \nde compreender seu papel histórico na impossibilidade de solução da equação quíntica \natravés de radicais e sua associação com a teoria de simetrias; \n3. Compreender a teoria básica de anéis, incluindo um bom entendimento sobre ideais e seus \nprincipais tipos; \n4. Compreender o conceito de corpo e reconhecer os principais corpos comumente \nutilizados; \n5. Explorar a teoria de anéis de polinômios como uma aplicação da teoria geral de anéis; \n6. Compreender a equivalente definição do corpo dos números complexos através do \nquociente do anel dos polinômios com coeficientes reais pelo ideal gerado pelo polinômio \nx²+1; \n7. Solidificar a compreensão do estudante sobre expressões algébricas, a fim de que o \naprofundamento aqui proposto contribua positivamente na sua prática docente. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n204 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Ementa": "Este componente curricular aborda de maneira introdutória as estruturas algébricas mais comuns: \ngrupos, anéis e corpos. Destaca-se nesta componente o estudo sobre anéis de polinômios, \nprincipalmente aqueles com coeficientes racionais e reais, e a menção ao Teorema Fundamental \nda Álgebra.",
        "Objetivos": "1. Compreender o desenvolvimento do pensamento algébrico e das Estruturas algébricas, \nalém de suas potencialidades para a fundamentação do ensino e da aprendizagem da \nmatemática e para a reflexão sobre a prática docente; \n2. Apresentar de maneira introdutória a teoria de grupos devidamente contextualizada a fim \nde compreender seu papel histórico na impossibilidade de solução da equação quíntica \natravés de radicais e sua associação com a teoria de simetrias; \n3. Compreender a teoria básica de anéis, incluindo um bom entendimento sobre ideais e seus \nprincipais tipos; \n4. Compreender o conceito de corpo e reconhecer os principais corpos comumente \nutilizados; \n5. Explorar a teoria de anéis de polinômios como uma aplicação da teoria geral de anéis; \n6. Compreender a equivalente definição do corpo dos números complexos através do \nquociente do anel dos polinômios com coeficientes reais pelo ideal gerado pelo polinômio \nx²+1; \n7. Solidificar a compreensão do estudante sobre expressões algébricas, a fim de que o \naprofundamento aqui proposto contribua positivamente na sua prática docente. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n204 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Conteúdo Programático": "1. Grupos: definições elementares, propriedades, subgrupos, grupos finitos, homomorfismos \ne isomorfismos de grupos, potências e múltiplos, grupos cíclicos, classes laterais, Teorema \nde Lagrange; \n2. Anéis: definições elementares, propriedades, subanéis, tipos de anéis, domínios de \nintegridade, homomorfismos e isomorfismos de anéis; \n3. Corpos: definições elementares, propriedades, corpos de frações de domínios de \nintegridade; \n4. Ideais em anéis comutativos: definições elementares, ideais gerados, ideais e anéis \nprincipais, ideais primos e maximais, anéis quociente; \n5. Anéis de polinômios: construção, definições elementares e propriedades sobre polinômios \ne suas raízes, algoritmo euclidiano de divisão de polinômios, Teorema do Resto, \nirredutibilidade de polinômios, critério de irredutibilidade de Eisenstein; \n6. Noções gerais sobre corpos algebricamente fechados e o Teorema Fundamental da \nÁlgebra."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Cálculo Diferencial e Integral 4",
        "Semestre": "6",
        "Ano": "",
        "Código": "CBTCDF4",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Função e Cálculo Diferencial e Integral;  \nConhecimentos específicos / Fundamentos de Análise.",
        "Ementa": "Este componente curricular prevê a introdução ao cálculo vetorial e a construção, utilização e \naplicação dos conceitos de sequências e séries infinitas.",
        "Objetivos": "1. Proporcionar ao estudante conhecimento elementar de cálculo vetorial, seus principais \nresultados e aplicações; \n2. Proporcionar ao estudante conhecimento sobre sequências e séries infinitas, seus aspectos \nteóricos e aplicações; \n3. Compreender o conceito de função como um caso particular de relação, e ampliar o estudo \nde seu comportamento por meio de conceitos do Cálculo Diferencial e Integral, articulados \ncom outras áreas do conhecimento e com a Educação Básica; \n4. Conceder conceitos que estruturam o Cálculo Diferencial e Integral, assim como as outras \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n214 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \náreas da matemática, trazendo discussões que abordam questões reflexivas sobre como a \nsimbologia e a linguagem matemática, as formas de demonstração e o deslocamento do \nsaber científico influenciam no processo de ensino e aprendizagem da matemática. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n215 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Conteúdo Programático": "1. Noções de curvas parametrizadas: limite, continuidade, derivada, reta tangente, integral, \ncomprimento de curva; \n2. Cálculo vetorial: campos vetoriais, integrais de linha, Teorema Fundamental da Integrais \nde Linha, Teorema de Green, rotacional e divergente, superfícies parametrizadas, integrais \nde superfície, áreas de superfícies, fluxo, Teorema de Stokes, Teorema de Gauss; \n3. Sequências numéricas: definições elementares, limite e convergência, subsequências; \n4. Séries numéricas: definições elementares, convergência, convergência absoluta, série \nharmônica, teste da divergência, séries alternadas, testes de convergência (da integral, da \ncomparação, de Leibniz, da razão e da raiz), séries de potências, séries de Taylor."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Ensino de Álgebra",
        "Semestre": "6",
        "Ano": "",
        "Código": "CBTENAL",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Metodologias de ensino; \nConhecimentos específicos / Pensamento algébrico e Estruturas algébricas; \nConhecimentos pedagógicos / 2. Didática / 2.3 Métodos e técnicas de ensino.",
        "Ementa": "O foco deste componente curricular é o estudo do desenvolvimento do pensamento algébrico e \ndos conceitos de álgebra na educação básica. Diversos recursos didáticos e estratégias de ensino \nserão estudados e discutidos de modo a desenvolver a relação entre álgebra, a generalização de \nconceitos matemáticos e o uso de linguagens cada vez mais formais pelos alunos dos futuros \nprofessores. Estuda a maneira pela qual a matemática pode contribuir positivamente para a \nsuperação de problemáticas educacionais, sociais, ambientais e para o desenvolvimento científico \ne tecnológico. Contempla a Prática como Componente Curricular (PCC), portanto discute a \nelaboração de sequências de ensino, planos de aula, regências supervisionadas, desenvolvimento \nde projetos e pesquisas sobre o ensino e aprendizagem de álgebra na educação básica. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n217 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Compreender as diferentes funções e concepções da álgebra e sua relação com o ensino; \n2. Entender o desenvolvimento do pensamento algébrico e das estruturas algébricas, além \nde suas potencialidades para a fundamentação do ensino e da aprendizagem da \nmatemática e para a reflexão sobre a prática docente; \n3. Conhecer, compreender e experimentar diferentes metodologias de ensino álgebra; \n4. Investigar práticas de ensino e explorar diferentes recursos didáticos, incluindo jogos e \ntecnologias digitais, que permitam o desenvolvimento do pensamento algébrico e a \ncompreensão dos conceitos de álgebra na educação básica; \n5. Conhecer as competências e habilidades relacionadas ao ensino de álgebra e presentes \nnos referenciais curriculares brasileiros, em especial na BNCC; \n6. Conhecer, compreender e refletir sobre o significado da igualdade, da equivalência, da \nvariação de grandezas e dos padrões e regularidades no ensino de álgebra na educação \nbásica.",
        "Conteúdo Programático": "1. Álgebra: seu significado e suas funções; \n2. As ideias da álgebra: aritmética generalizadora, resolução de problemas, estudo das \nestruturas e estudo da variação de grandezas (função); \n3. Igualdade e equivalência de números e operações; \n4. Padrões, regularidades e generalizações; \n5. A trajetória do ensino da álgebra na educação básica retratada nos documentos \ncurriculares nacionais; \n6. Dificuldades na aprendizagem de álgebra na educação básica; \n7. Recursos metodológicos e tecnológicos para o ensino de álgebra na educação básica. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n218 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Extensão 4",
        "Semestre": "6",
        "Ano": "",
        "Código": "CBTEXS4",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "6",
        "Total de aulas": "114",
        "CH Ensino": "0",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Sim",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Metodologias de ensino; \nConhecimentos específicos / Língua Portuguesa na prática docente; \nConhecimentos pedagógicos / 2. Didática; \nConhecimentos pedagógicos / 5. Diversidade, direitos humanos e inclusão.",
        "Ementa": "Este componente curricular busca articular o conhecimento científico com as necessidades da \ncomunidade de modo a transformar a realidade social através da execução de projeto(s) de \nextensão cujas ações prevejam, de modo protagonizado pelos estudantes, a organização de algum \nevento acadêmico e a prestação de serviço educacional para a comunidade ou a preparação e o \noferecimento de curso(s) de interesse social. Parte das atividades de extensão executadas nessa \ndisciplina devem estar vinculadas à formação do aluno para a prática docente, consistindo em \nhoras de prática como componente curricular (PCC). \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n220 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Permitir que o licenciando tenha a experiência prática de participar da organização de \nalgum evento de ensino, pesquisa ou extensão; \n2. Propiciar ao licenciando a oportunidade de experimentar a realização de ações \nextensionistas de modo vinculado à sua formação docente; \n3. Desenvolver o protagonismo estudantil, contribuindo para a sua formação integral; \n4. Realizar a interação dialógica com a comunidade e os arranjos produtivos, culturais, \nartísticos e sociais locais e regionais; \n5. Promover os impactos social e acadêmico dos cursos, de discentes e servidores do IFSP; \n6. Desenvolver atividades práticas relacionadas à extensão; \n7. Possibilitar que os alunos utilizem e divulguem os conhecimentos científicos adquiridos \nao longo do seu curso, em particular os conhecimentos matemáticos, na contribuição do \ndesenvolvimento social externo ao seu ambiente acadêmico; \n8. Experimentar nas atividades extensionistas diferentes metodologias de ensino de \nmatemática; \n9. Utilizar a Língua Portuguesa, contextualizada na prática docente e nas atividades \nextensionistas.",
        "Conteúdo Programático": "1. Estudo, análise, reflexão e discussão de projeto(s) ou programa(s) de extensão previamente \naprovado(s) que possa(m) ser executado(s) ao longo desta disciplina; \n2. Estudo e discussão sobre aspectos a serem considerados na organização de um evento \nacadêmico; \n3. Divisão de tarefas, organização em grupos e preparação para a realização do(s) projeto(s) \nou programa(s) de extensão vinculados à disciplina; \n4. Preparação, desenvolvimento e execução do evento acadêmico proposto para ser \norganizado ao longo desta disciplina; \n5. Execução das ações previstas pelo(s) projeto(s) ou programa(s) de extensão vinculados à \ndisciplina; \n6. Acompanhamento e observação de necessidades de adaptação das atividades previstas \nno(s) projeto(s) ou programa(s) à medida em que o(s) mesmo(s) estiver(em) sendo \nexecutado(s); \n7. Avaliação e discussão sobre os resultados observados na realização das atividades \nextensionistas relacionadas à disciplina e suas contribuições na formação dos estudantes \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n221 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nprotagonistas dessas ações. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n222 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Física 1",
        "Semestre": "6",
        "Ano": "",
        "Código": "CBTFSC1",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Interdisciplinaridade e desenvolvimento de projetos na Educação \nBásica.",
        "Ementa": "O componente curricular representa uma introdução à física e a relação do fenômeno natural \nexplicado através da linguagem matemática. O componente aborda tópicos de Mecânica \n(Cinemática e Dinâmica) do Ensino Médio, possibilitando a interação com o professor de Física e \na construção de projetos interdisciplinares entre ambas as áreas, além de relacionar a física com \no meio ambiente. São também aplicações dos conceitos de Cálculo Diferencial Integral e Vetores \nà Mecânica, não só fundamentando o aprendizado das disciplinas de Cálculo mas também \npossibilitando uma compreensão mais profunda dos tópicos estudados.",
        "Objetivos": "1. Discutir conhecimentos matemáticos articulados às diversas áreas do conhecimento \nhumano, promovendo para uma visão interdisciplinar das Ciências, valorizando a \nMatemática como campo de saber essencial à resolução de situações do mundo real, para \nentender questões ambientais e dando subsídios para o desenvolvimento de projetos na \nEducação Básica; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n224 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n2. Representar a realidade como um modelo matemático; \n3. Possibilitar que o estudante perceba as relações entre a Física, Matemática e meio \nambiente, percebendo as operações vetoriais e o cálculo diferencial e integral se \nrelacionando com a natureza dos fenômenos Físicos, simetrias e conservações.",
        "Conteúdo Programático": "1. Medidas Físicas; \n2. Unidades de Medida e Sistema Internacional de Unidades; \n3. Cinemática Escalar: Velocidade média e instantânea, Aceleração média e instantânea; \nFunções Horárias e gráficos do Movimento Uniforme (M.U.); Funções Horárias e gráficos \ndo Movimento Uniformemente Variado (M.U.V.); Derivadas e Integrais de funções horárias; \n4. Cinemática Vetorial: Grandezas Escalares e Vetoriais; Lançamentos; Movimento Circular; \n5. Dinâmica: Forças; Leis de Newton; Estática; Trabalho e Energia Cinética; Forças \nConservativas e Energia Potencial em uma e mais dimensões; Energia Mecânica e sua \nconservação; Dinâmica impulsiva; Conservação do Momento Linear e Colisões. \n6. Uso da Física Mecânica para explicar o meio ambiente."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Gestão e Políticas Educacionais",
        "Semestre": "6",
        "Ano": "",
        "Código": "CBTGPED",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.2 Sociologia da Educação; \nConhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.3 História da Educação; \nConhecimentos Pedagógicos / 2. Didática / 2.2 Planejamento e avaliação; \nConhecimentos Pedagógicos / 3. Currículo; \nConhecimentos Pedagógicos / 4. Política e Organização da Educação Brasileira / 4.1 Gestão; \nConhecimentos Pedagógicos / 4. Política e Organização da Educação Brasileira / 4.2 Legislação; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão / 5.2 Educação para as \nrelações étnico- raciais e indígenas; \nConhecimentos Pedagógicos / 6. Educação Profissional e Tecnológica.",
        "Ementa": "Este componente curricular prevê a leitura, discussão e análise da legislação existente para a \nEducação Básica: LDB; Parâmetros Curriculares Nacionais, Diretrizes Curriculares Nacionais para a \nFormação de Professores da Educação Básica, Estatuto da Criança e do Adolescente, Educação \nProfissional e Tecnológica e o Plano Nacional da Educação, entre outras. Além disso, pretende \napresentar e refletir sobre os componentes da estrutura educacional brasileira e da estrutura da \nescola, enfatizando as relações entre seus principais agentes. Discute temas como globalização, \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n226 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \ndireitos humanos, avaliações em larga escala, políticas públicas de meio ambiente, de inclusão \nsocial, e de respeito a diversidade de gênero, étnico-racial, de faixa geracional, de orientação \nsexual, política e religiosa.",
        "Objetivos": "1. Permitir ao futuro educador uma visão ampla de todo o processo educacional, entendendo \nos problemas decorrentes de fatores estruturais e organizacionais; \n2. Contribuir para que o estudante reflita sobre o papel do professor na organização escolar \ne sobre os princípios, finalidades e objetivos da educação estabelecidos na legislação \nvigente; \n3. Entender as relações de poder que em seus tempos históricos, discutindo os \nengendramentos que determinam os caminhos das políticas educacionais brasileiras e \nseus reflexos nos processos dos vários tipos de Gestão educacional;  \n4. Discutir a função social das/dos futuras/os docentes dentro da educação matemática, \npercebendo que tal função não se restringe às especificidades do componente curricular, \nmas sim dentro de um espraiamento mais amplo e, nesse sentido, a depreensão da Gestão \ne políticas educacionais.",
        "Conteúdo Programático": "1. Análise das relações de poder na escola com vistas à democracia e à inclusão social, \nconsiderando-se o multiculturalismo, a diversidade/diferenças, os direitos humanos;  \n2. Análise de espaços educativos formais, informais e não-formais e suas relações com a \nconstrução de saberes; \n3. Análise da educação como direito e seus desdobramentos no que se refere à inclusão, à \ndiversidade e à democracia; \n4. Educação e Sociedade: perspectivas contemporâneas emergentes; \n5. Historicidade dos processos educativos e das práticas escolares no Brasil; \n6. Estudos sobre as políticas educacionais e correntes pedagógicas no percurso histórico da \neducação brasileira; \n7. Reflexões teóricas/conceituais/práticas sobre o planejamento educacional em seus \ncontextos macro e micro, considerando a necessária articulação entre as diretrizes \ncurriculares, o currículo, o projeto político pedagógico da escola, os planos de ensino e os \nplanos de aula; \n8. Cotidiano da escola como um espaço/tempo de pesquisa e formação continuada; \n9. Currículo como construção social e cultural: ideologia, relações de poder na seleção de \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n227 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nconhecimentos e de conteúdos escolares; \n10. O Estado, os direitos sociais e a políticas públicas e educacionais; \n11. Gestão educacional e escolar considerando a função social da escola no contexto das \ntensões existentes na sociedade de classes; \n12. Políticas de Avaliação Escolar; \n13. Financiamento da educação: FUNDEF, FUNDEB, CAQ e CAQI - análise histórico-crítica; \n14. Princípios e concepções da gestão democrática e a atuação do professor na construção do \nProjeto Pedagógico; \n15. O público e o privado na educação brasileira; \n16. Políticas de Ações Afirmativas e Educação; \n17. Educação profissional e tecnológica: perspectivas históricas e legais; \n18. Educação em direitos humanos, visando o respeito a diversidade étnico-racial, de gênero, \nde faixa geracional, de raça, de orientação sexual, religiosa e política; \n19. Educar no e para o trabalho como promoção humana; Formação politécnica; Trabalho, \neducação, ciência e tecnologia; Juventude, trabalho e inclusão; Políticas de educação \nprofissional e de educação de jovens e adultos."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Probabilidade e Estatística 1",
        "Semestre": "6",
        "Ano": "",
        "Código": "CBTPES1",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Contagem, estatística e probabilidade.",
        "Ementa": "Este componente curricular disponibiliza ao discente um conjunto de ferramentas para o \ntratamento e análise de dados e informações quantitativas. Desta forma, visa desenvolver a \nconfiança dos acadêmicos ao lidar com situações que envolvam a necessidade de interpretações \nde problemas da vida cotidiana e de diversas áreas do conhecimento. Este componente também \ndisponibiliza ao discente os conceitos fundamentais de probabilidade e busca capacitar o \nestudante na tradução da ocorrência de fenômenos probabilísticos nas diversas áreas do \nconhecimento, reconhecendo tendências e tomando decisões dentro limites éticos e morais \nenvolvidos no desenvolvimento tecnológico. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n230 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Estudar diferentes procedimentos para a contagem de elementos selecionados de um \nconjunto, dos modelos estatísticos e dos conceitos de probabilidade em diversos \ncontextos; \n2. Desenvolver conhecimentos das diversas etapas que compõem uma análise estatística, \nincluindo a elaboração de inferências e a tomada de decisões assertivas; \n3. Coletar e organizar dados; \n4. Apresentar os dados por intermédio de tabelas e/ou gráficos; \n5. Analisar dados aplicando os recursos estatísticos necessários; \n6. Compreender os fundamentos e conceitos clássicos de probabilidade.; \n7. Compreender os modelos probabilísticos aplicáveis a análise de problemas reais; \n8. Compreender a literatura científica da área; \n9. Compreender o processo de ensino e aprendizagem de Probabilidade e Estatística na \neducação básica.",
        "Conteúdo Programático": "1. A natureza da Estatística: Métodos estatísticos e séries estatísticas; \n2. População e amostra: Elementos de amostragem e Estrutura de pesquisa; \n3. Apresentação de dados: tabelas de distribuição de frequências e gráficos estatísticos \n(gráficos de barras, coluna, setor, histograma, polígono de frequência, ogiva); \n4. Medidas de tendência central: média, moda, mediana; \n5. Medidas de dispersão: variância, desvio padrão, coeficiente de variação, critério de \nhomogeneidade; \n6. Medidas separatrizes: quartil, decil e percentil; \n7. Assimetria, curtose e normalidade; \n8. O processo de ensino e aprendizagem de Estatística na educação básica; \n9. Noções básicas: experimentos aleatórios, espaço amostral e eventos; \n10. Definições de probabilidade: clássica, frequentista e subjetiva de probabilidade; \n11. Probabilidade condicional, independência de eventos; \n12. Variáveis aleatórias discretas e contínuas \n13. Distribuição de probabilidades de variáveis aleatórias discretas e contínuas; \n14. Esperança matemática de variáveis aleatórias discretas e contínuas; \n15. O processo de ensino e aprendizagem de probabilidade na educação básica. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n231 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Currículo, Planejamento e Avaliação no Ensino de Matemática",
        "Semestre": "7",
        "Ano": "",
        "Código": "CBTCPAE",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "N/A",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Pedagógicos / Fundamentos da Educação / 1.1 Filosofia da Educação; \nConhecimentos Pedagógicos / Fundamentos da Educação / 1.2 Sociologia da Educação; \nConhecimentos Pedagógicos / Didática / 2.2 Planejamento e avaliação; \nConhecimentos Pedagógicos / Currículo / 3 Currículo; \nConhecimentos Pedagógicos / 4. Política e Organização da Educação Brasileira / 4.2 Legislação.",
        "Ementa": "O componente curricular discute a organização escolar e do ensino a partir do currículo, \nplanejamento e avaliação e suas relações entre si. Problematiza o contexto político-social e suas \nrelações com a organização do trabalho pedagógico, a avaliação e o currículo escolar, abordando \nos fatores intra e extraescolares associados à aprendizagem e as determinações mais amplas \nadvindas da sociedade. Introduz reflexão sobre diferentes concepções curriculares e o papel da \navaliação para a promoção da inclusão, democratização do ensino e do sucesso escolar. São \nexaminados os vários níveis da avaliação educacional (em sala de aula, institucional e de redes de \nensino) e suas relações entre si. Discutem-se novas abordagens para o trabalho pedagógico que \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n233 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \npermitam inserir novas formas de avaliação. Articula a vivência no estágio com a teoria discutida \nno componente, proporcionando tempo e espaço de reflexão e discussão sobre a prática cotidiana \nvivenciada e observada na escola estagiada.",
        "Objetivos": "1. Conhecer diferentes concepções curriculares; \n2. Problematizar documentos oficiais curriculares e analisá-los na perspectiva do ensino de \nMatemática; \n3. Refletir sobre os diferentes âmbitos de um planejamento em Matemática e seus princípios \norganizadores;  \n4. Debater sobre a avaliação educacional (em sala de aula, externa e institucional) em \ninterface com a organização do trabalho pedagógico; \n5. Discutir sobre qualidade social da escola pública e a formação humana de seus estudantes \n6. Refletir sobre diferentes concepções e instrumentos de avaliação ; \n7. Problematizar a relação entre avaliação, currículo e planejamento; \n8. Elaborar planejamentos, avaliações e análises curriculares no âmbito da Educação \nMatemática.",
        "Conteúdo Programático": "1. Currículo: história e significado; \n2. Currículo como construção social e cultural: ideologia, relações de poder na seleção de \nconhecimentos e de conteúdos escolares; \n3. Teorias do currículo: tradicionais, críticas e pós-críticas. \n4. Currículos organizados por conteúdos, competências e habilidades; \n5. Currículo e os contextos social, econômico, cultural e político-educacional; \n6. Currículo escolar na perspectiva interdisciplinar e transversal; \n7. Currículo formal, oculto e interpretado; \n8. Currículo no contexto da Educação Profissional; \n9. Planejamento educacional em seus contextos macro e micro;  \n10. Planejamento participativo na escola;  \n11. A aula como organização do trabalho pedagógico e como ação pedagógica para a \npromoção humana; \n12. Projeto Político Pedagógico e sua articulação com o planejamento, a avalição e o currículo; \n13. Relação entre currículo e avaliação; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n234 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n14. Função social da escola e a interface com a avaliação educacional; \n15. Qualidade social da escola pública e a formação humana; \n16. Fins e finalidades da educação escolar; \n17. Avaliação da aprendizagem, avaliação institucional e avaliação em larga escala; \n18. Avaliação diagnóstica, formativa e somativa; \n19. Avaliação formal e informal; \n20. Avaliação, inclusão e democratização do ensino: análise das relações de poder na escola."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Equações Diferenciais Ordinárias",
        "Semestre": "7",
        "Ano": "",
        "Código": "CBTEDON",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Função e Cálculo Diferencial e Integral.",
        "Ementa": "Esta componente curricular visa apresentar introdutoriamente conceitos e técnicas de equações \ndiferenciais ordinárias, notadamente as de primeira e segunda ordens, destacando algumas de \nsuas aplicações à física e à geometria.",
        "Objetivos": "1. Conhecer os principais conceitos e técnicas elementares envolvendo equações diferenciais \nordinárias de primeira e segunda ordens; \n2. Observar a importância das ferramentas do cálculo diferencial e integral nos problemas \nenvolvendo equações diferenciais; \n3. Compreender a importância das equações diferenciais ordinárias enquanto ferramenta \nmatemática aplicada a outras áreas, como geometria e física; \n4. Compreender o conceito de função como um caso particular de relação, e ampliar o estudo \nde seu comportamento por meio de conceitos do Cálculo Diferencial e Integral, articulados \ncom outras áreas do conhecimento e com a Educação Básica. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n236 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Conteúdo Programático": "1. Equações diferenciais ordinárias (EDOs) de primeira ordem lineares, homogêneas e não-\nhomogêneas, e aplicações; \n2. EDOs separáveis e aplicações; \n3. Teorema da Existência e Unicidade de soluções das EDOs de primeira ordem; \n4. Equações de Bernoulli e de Riccati; \n5. Equações exatas, equações homogêneas e aplicações; \n6. Campos de direções e o método de Euler; \n7. EDOs de segunda ordem, homogêneas e não-homogêneas; \n8. EDOs de segunda ordem com coeficientes constantes, homogêneas e não-homogêneas; \n9. Resolução de EDOs de segunda ordem por séries de potências; \n10. Aplicações das EDOs de segunda ordem; \n11. Noções de EDOs de ordem superior."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Estudos Integradores 1",
        "Semestre": "7",
        "Ano": "",
        "Código": "CBTEIN1",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos/ Interdisciplinaridade e desenvolvimento de projetos na Educação \nBásica; \nConhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.2 Sociologia da Educação; \nConhecimentos Pedagógicos / 2. Didática / 2.1 Ensino e aprendizagem; \nConhecimentos Pedagógicos/ 2. Didática / 2.2 Planejamento e avaliação; \nConhecimentos Pedagógicos/ 2. Didática / 2.3 Métodos e técnicas de ensino; \nConhecimentos Pedagógicos / 2. Didática / 2.4 Tecnologia e Mídias; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão/ 5.1 Educação especial; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão/ 5.2 Educação para as \nrelações étnico- raciais.",
        "Ementa": "Este componente incentiva a articulação entre as estratégias e conhecimentos adquiridos pelos \nestudantes nos diferentes componentes do curso, com o propósito de elaborar, por meio de \nprojetos, materiais e recursos didático-pedagógicos (e-book, mídias digitais, vídeos, peças \nteatrais, entre outros), visando a transposição de conhecimentos matemáticos em saber escolar. \nDiscute a maneira pela qual a Matemática pode contribuir positivamente para a superação de \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n238 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nquestões das relações étnico-raciais, socioambientais e para o desenvolvimento científico e \ntecnológico. A carga horária de PCC deve ser destinada às discussões e elaboração de projetos \nque visem o desenvolvimento de materiais didáticos e pedagógicos, os quais possam ser \nutilizados no processo de ensino e aprendizagem de Matemática na educação básica.",
        "Objetivos": "1. Discutir conhecimentos matemáticos articulados às diversas áreas do conhecimento \nhumano, promovendo para um diálogo intradisciplinar entre as várias áreas da \nMatemática, valorizando a Matemática como campo de saber essencial à resolução de \nsituações do mundo real e dando subsídios para o desenvolvimento de projetos na \nEducação Básica; \n2. Compreender as etapas de pesquisa, elaboração e uso de materiais didáticos e \npedagógicos; \n3. Desenvolver possibilidades de ensino e aprendizagem na Educação Matemática, \nconstruindo projetos a partir da zona de interesse das/dos graduandos; \n4. Estabelecer um diálogo intradisciplinar, unindo as diversas áreas da Matemática, a partir \ndas propostas contidas nos projetos individuais ou/em grupos; \n5. Propor alternativas de ensino e aprendizagem a partir do diálogo entre os conhecimentos \nformais, não-formais e informais presentes nas comunidades escolar e loco-regional; \n6. Construir alternativas pedagógicas e materiais didáticos relacionados às áreas específicas \nda matemática, nas quais os projetos forem desenvolvidos; \n7. Discutir as relações de poder que conferem à Educação Matemática o “status” que a \nmantém dentro de certas traduções, estigmas e acessos, nos quais mecanismos de \nexclusão são perpetuados a partir de uma “visão míope” a respeito da produção de \nconhecimento legitimado.",
        "Conteúdo Programático": "1. O papel da cultura na constituição do cotidiano escolar; \n2. Análise das relações de poder na escola com vistas à democracia e à inclusão social, \nconsiderando-se o multiculturalismo, a diversidade/diferenças, os direitos humanos;  \n3. Análise de espaços educativos formais, informais e não-formais e suas relações com a \nconstrução de saberes; \n4. Análise da educação como direito e seus desdobramentos no que se refere à inclusão, às \ndiferenças e à democracia; \n5. Análise de estratégias de ensino e de aprendizagem, da natureza dos conteúdos e das \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n239 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nformas de avaliação; \n6. A importância da Didática no âmbito da formação docente, no contexto político-\neducacional contemporâneo; \n7. Mediação pedagógica; \n8. A relação pedagógica como cerne da Didática: os vínculos entre professor, aluno e \nconhecimento; \n9. A aula como organização do trabalho pedagógico como ação pedagógica para a \npromoção humana; \n10. Reflexões teóricas/conceituais/práticas sobre o planejamento educacional em seus \ncontextos macro e micro, considerando a necessária articulação entre as diretrizes \ncurriculares, o currículo, o projeto político pedagógico da escola, os planos de ensino e os \nplanos de aula; \n11. Práxis como eixo do trabalho pedagógico;  \n12. Cotidiano da escola como um espaço/tempo de pesquisa e formação continuada;  \n13. A avaliação da aprendizagem como processo contínuo e formativo; \n14. Estratégias e recursos de ensino e aprendizagem tendo em vista as especificidades dos \nníveis e modalidades de ensino; \n15. Metodologias de aprendizagem ativas e colaborativas; \n16. Práticas pedagógicas inclusivas; \n17. Transversalidade na educação; \n18. Recursos didático-pedagógicos tendo em vista as especificidades dos níveis e \nmodalidades de ensino; \n19. Utilização de tecnologias digitais para a aprendizagem; \n20. Ação pedagógica mediada por recursos tecnológicos e sua relação com a equidade e \njustiça social; \n21. Acessibilidade e aprendizagem; \n22. Relação entre mídia, tecnologia educacional, cultura e subjetividade.  Modalidades \neducacionais e processos formativos: presencial, virtual, híbrido; \n23. Princípios e Políticas da Educação Inclusiva no contexto educacional e nacional;  \n24. Acessibilidade e aprendizagem escolar; \n25. Práticas pedagógicas inclusivas, nos diversos níveis e modalidades de ensino; \n26. Culturas afro-brasileiras e indígenas e suas respectivas produções culturais; \n27. Fundamentos e princípios metodológicos da Educação antirracista; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n240 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n28. Políticas de Ações Afirmativas e Educação."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Física 2",
        "Semestre": "7",
        "Ano": "",
        "Código": "CBTFSC2",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Interdisciplinaridade e desenvolvimento de projetos na Educação \nBásica.",
        "Ementa": "O componente curricular aprofunda o estudo de fenômenos naturais explicados através da \nlinguagem matemática. O componente aborda tópicos de Termodinâmica e Ondulatória, \npossibilitando a interação com o professor de Física e a construção de projetos interdisciplinares \nentre ambas as áreas, além de relacionar a física com o meio ambiente. São também aplicações \ndos conceitos de Cálculo Diferencial Integral e Vetores, não só fundamentando o aprendizado das \ndisciplinas de Cálculo, mas também possibilitando uma compreensão mais profunda dos tópicos \nestudados.",
        "Objetivos": "1. Discutir conhecimentos matemáticos articulados às diversas áreas do conhecimento \nhumano, promovendo para uma visão interdisciplinar das Ciências, valorizando a \nMatemática como campo de saber essencial à resolução de situações do mundo real, para \nentender questões ambientais e dando subsídios para o desenvolvimento de projetos na \nEducação Básica; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n242 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n2. Representar a realidade como um modelo matemático; \n3. Possibilitar que o estudante perceba as relações entre a Física, Matemática e meio \nambiente, principalmente na termologia e ondulatória.",
        "Conteúdo Programático": "1. Densidade e massa específica; \n2. Pressão hidrostática e pressão atmosférica; \n3. Hidrodinâmica; \n4. Termometria \n5. Dilatação de sólidos e Líquidos; \n6. Calor Sensível e Calor Latente; \n7. Transmissão de Calor; \n8. Gás ideal; \n9. Leis da Termodinâmica; \n10. Máquinas Térmicas; \n11. Fenômenos periódicos e o Movimento Harmônico Simples; \n12. Ondas e som; \n13. Ondas Estacionárias; \n14. Luz e espelhos; \n15. Lentes; \n16. Difração; \n17. Uso da Física Termodinâmica e Ondulatória para explicar questões ambientais. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n243 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "História da Matemática",
        "Semestre": "7",
        "Ano": "",
        "Código": "CBTHISM",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / História da matemática.",
        "Ementa": "O componente curricular aborda o estudo dos períodos históricos clássicos e modernos, \nenfatizando os principais fatos, avanços e pesquisadores matemáticos. Para consolidar a ideia de \nmatemática como ciência em movimento, o componente também aborda aspectos da matemática \ncontemporânea e discute as contribuições da história da matemática no processo de ensino e \naprendizagem. Discute a maneira pela qual a Matemática pode contribuir positivamente para a \nsuperação de questões socioambientais e para o desenvolvimento científico e tecnológico. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n245 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Conhecer a história da matemática numa perspectiva sociocultural, percebendo que os \npadrões de rigor e as técnicas e métodos matemáticos se transformam e são expressão do \ncontexto social em que são formulados, promovendo nesse processo o reconhecimento \nda existência de diferentes práticas matemáticas e sobre as possibilidades de utilização da \nhistória no ensino-aprendizagem da matemática; \n2. Conhecer fatos básicos referentes à história da matemática desde a antiguidade e \ncompreender que a matemática, como atividade humana, foi construída ao longo dos \ntempos por diferentes povos; \n3. Perceber como a atividade matemática se desenvolveu ao longo dos anos e o papel das \nmulheres e homens matemáticos nesse desenvolvimento; \n4. Observar que o desenvolvimento da matemática não ocorre apenas através de \npesquisadores considerados gênios, mas principalmente através de cientistas dedicados \nenvoltos em contextos propícios; \n5. Verificar como certos conceitos abstratos aparecem historicamente a fim de dar \ncompreensão e rigor adequados a uma teoria visando solucionar problemas matemáticos \nimportantes; \n6. Compreender que o uso da história da matemática como recurso torna o processo de \naprendizagem mais significativo. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n246 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Conteúdo Programático": "1. A definição de matemática e as hipóteses sobre a matemática na pré-história; \n2. Matemática na Mesopotâmia: aspectos gerais e sistema sexagesimal posicional; \n3. Matemática no Antigo Egito: aspectos gerais, numeração egípcia, problemas envolvendo \nfrações e papiro de Rhind; \n4. Matemática na Antiga Grécia: aspectos gerais, pensamento racional grego, Tales de Mileto, \nescola pitagórica, numeração grega, Atenas do século V a.C., os três problemas clássicos \ngregos, problemas de quadratura, curva de Hípias, descoberta da incomensurabilidade, \nAcademia Platônica de Atenas e teoria das proporções de Eudoxo, Os Elementos de \nEuclides, contribuições de Arquimedes de Siracusa, as Cônicas de Apolônio; \n5. Matemática durante a Antiguidade tardia e a Idade Média: desenvolvimento matemático \nna Alexandria, a Aritmética de Diofanto, numeração hindu, as contribuições de Aryabhata, \nBrahmagupta e Bhaskara II, a matemática árabe, a álgebra de Al-Khwarizmi e de Omar \nKhayam, a difusão da Álgebra no Ocidente e o uso do simbolismo, a ciência medieval na \nEuropa, as contribuições de Fibonacci, o problema das cúbicas e quárticas; \n6. A revolução científica: Renascimento, surgimento das primeiras universidades, a síntese no \nséculo XVI, a Arte Analítica de Viète, os interlocutores do padre Mersenne, contribuições \nde Galileu, Descartes e Fermat; \n7. A análise matemática nos séculos XVII e XVIII: a cicloide, o cálculo de áreas e a arte da \ninvenção, o surgimento do Cálculo e as contribuições de Newton e Leibniz, as diferenças \nentre o Cálculo de Newton e de Leibniz, D’Alembert e o conceito de limite, a noção de \nfunção, as contribuições de Euler, Laplace, Lagrange e Fourier; \n8. A matemática do século XIX: a matemática francesa e as contribuições de Cauchy, a \nascensão da matemática alemã, as contribuições de Gauss, Abel, Galois, Dirichlet, Riemann, \nDedekind e Weierstrass, a teoria dos conjuntos de Cantor, a caracterização dos números \nreais; \n9. A matemática do século XX: o surgimento das sociedades matemáticas e do Congresso \nInternacional de Matemáticos, as contribuições de Poincaré e Hilbert, os 23 problemas de \nHilbert, as contribuições de Emmy Noether e de Bourbaki, discussões sobre a concepção \nmoderna de função; \n10. Aspectos gerais sobre a história da matemática no Brasil e sobre a matemática \ncontemporânea no mundo; \n11. Discussões sobre o uso da história da matemática como ferramenta no ensino de \nmatemática no Ensino Básico. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n247 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Interdisciplinaridades",
        "Semestre": "7",
        "Ano": "",
        "Código": "CBTINTR",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Interdisciplinaridade e desenvolvimento de projetos na Educação \nBásica.",
        "Ementa": "O componente curricular visa estudar conceitos de química e de biologia, permitindo o diálogo \nentre as áreas, fornecendo assim ferramentas para uma abordagem interdisciplinar da \nmatemática. Discute a maneira pela qual a biologia e química podem contribuir positivamente \npara a superação de problemáticas ambientais e para o desenvolvimento científico e tecnológico.",
        "Objetivos": "1. Discutir conhecimentos matemáticos articulados às diversas áreas do conhecimento \nhumano, promovendo para uma visão interdisciplinar das Ciências, valorizando a \nMatemática como campo de saber essencial à resolução de situações do mundo real e \ndando subsídios para o desenvolvimento de projetos na Educação Básica; \n2. Utilizar conceitos da biologia e da química para contextualizar as atividades matemáticas \nna Educação Básica; \n3. Modelar matematicamente situações problemas relacionados às ciências naturais. \n4. Incentivar a compreensão e resolução de problemas contextualizados, em que a \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n249 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nmatemática pode ser aplicada, incluindo aqueles relacionados às questões educacionais, \nsociais, tecnológicas e ambientais. \n5. Compreender a ligação entre questões de natureza biológica, química e ambientais.",
        "Conteúdo Programático": "1. Tópicos interdisciplinares em Biologia, considerando assuntos como a organização dos \nseres vivos, célula, divisão celular, estimativa populacional em Ecologia; \n2. Interdisciplinaridade, Sustentabilidade e Meio Ambiente; \n3. Tópicos interdisciplinares em Química, considerando, entre outros, os assuntos átomo, \nmolécula e reações químicas, estequiometria, equilíbrio, pH, radiação e meia-vida;  \n4. Interdisciplinaridade e modelagem em Ciências da Natureza e Matemática."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Probabilidade e Estatística 2",
        "Semestre": "7",
        "Ano": "",
        "Código": "CBTPES2",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Contagem, estatística e probabilidade.",
        "Ementa": "Este componente curricular irá aprofundar os estudos em Estatística, destacando os \nprocedimentos para a inferência, a tomada de decisões e introduzindo a análise multivariada de \ndados. Pode-se realizar projetos que envolvam o uso da Estatística como ferramenta para a \ncompreensão do desempenho dos estudantes nas aulas de matemática, bem como projetos que \ndestaquem sua importância para a pesquisa em educação matemática.",
        "Objetivos": "1. Estudar diferentes procedimentos para a contagem de elementos selecionados de um \nconjunto, dos modelos estatísticos e dos conceitos de probabilidade em diversos \ncontextos; \n2. Desenvolver conhecimentos das diversas etapas que compõem uma análise estatística, \nincluindo a elaboração de inferências e a tomada de decisões assertivas; \n3. Fazer inferências e previsões interpretando os resultados numéricos fornecidos; \n4. Utilizar profissionalmente métodos científicos da teoria estatística em seu campo de \ntrabalho; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n251 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n5. Compreender a literatura científica da área; \n6. Utilizar ferramentas estatísticas adequadas para analisar e interpretar fenômenos coletivos, \n7. Tomar decisões e fazer previsões; \n8. Compreender o processo de ensino e aprendizagem de Estatística na educação básica; \n9. Utilizar a Estatística como ferramenta nas diversas atividades docentes e acadêmicos-\ncientíficas.",
        "Conteúdo Programático": "1. Modelos probabilísticos discretos: modelos binomial, geométrico, hipergeométrico e de \nPoisson; \n2. Modelos probabilísticos contínuos: modelos uniforme, normal, exponencial, gama e de \nWeibull; \n3. Intervalos de Confiança; \n4. Testes de Hipóteses e Significância; \n5. Teste Qui-Quadrado; \n6. Análise de Variância; \n7. Análise de Decisão Bayesiana; \n8. Ajustamento de Curvas e o Método dos Mínimos Quadrados; \n9. Teoria da Correlação e de Correlação Parcial e Múltipla; \n10. Regressão Múltipla e Análise de Correlação; \n11. Análise de Séries Temporais; \n12. Números Índices; \n13. Teorias das da Decisão; \n14. Testes Não-Paramétricos; \n15. Introdução à Análise Multivariada de Dados; \n16. Uso de Softwares Específicos de Estatística; \n17. O processo de ensino e aprendizagem de Estatística na educação básica. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n252 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Ensino de Probabilidade e Estatística",
        "Semestre": "8",
        "Ano": "",
        "Código": "CBTENPE",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Contagem, estatística e probabilidade; \nConhecimentos específicos / Metodologias de ensino; \nConhecimentos pedagógicos /  2. Didática / 2.3 Métodos e técnicas de ensino.",
        "Ementa": "O foco do componente está no desenvolvimento do pensamento estatístico relacionado de modo \nintrínseco à cidadania dos estudantes. Para isso serão exploradas as diferentes etapas de uma \npesquisa estatística de modo a refletir sobre o ensino da estatística que permita a inferência a \npartir dos dados e emissão de juízos sobre informações. Além disso, o componente aborda os \nconceitos e as formas de ensino e aprendizagem de análise combinatória e probabilidade. Estuda-\nse a maneira pela qual a matemática pode contribuir positivamente para a superação de \nproblemáticas educacionais, sociais, ambientais e para o desenvolvimento científico e tecnológico. \nContempla a Prática como Componente Curricular (PCC), portanto discute a elaboração de \nsequências de ensino, planos de aula, regências supervisionadas, desenvolvimento de projetos e \npesquisas sobre o ensino e aprendizagem de estatística, análise combinatória e probabilidade na \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n254 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \neducação básica.",
        "Objetivos": "1. Realizar o estudo de diferentes procedimentos para a contagem de elementos \nselecionados de um conjunto, dos modelos estatísticos e dos conceitos de probabilidade \nem diversos contextos. Conhecer as diversas etapas que compõem uma análise estatística, \nincluindo a elaboração de inferências e a tomada de decisões assertivas; \n2. Ler e interpretar dados e informações de caráter estatístico apresentados em diferentes \nlinguagens e representações, na mídia ou em outros textos ou meios de comunicação e \nrefletir sobre o ensino dessas habilidades; \n3. Compreender o papel das medidas de tendência central, de separação e dispersão em \nestatística e seu papel na formação do estudante; \n4. Calcular probabilidades de diferentes formas e em contextos diversos e interpretar os \nresultados obtidos de modo assertivo visando à tomada de decisões em situações de risco; \n5. Caracterizar e diferenciar os conceitos de literacia estatística, raciocínio estatístico e \npensamento estatístico e conhecer as competências e habilidades relacionadas a esses \nconceitos presentes nos documentos oficiais da educação brasileira, em especial na BNCC; \n6. Compreender, refletir sobre e experimentar diferentes metodologias de ensino e \naprendizagem de estatística, análise combinatória e probabilidade.",
        "Conteúdo Programático": "1. Conceito de Educação Estatística; \n2. Literacia estatística, raciocínio estatístico e pensamento estatístico; \n3. O ensino e a aprendizagem de estatística, enfatizando: coleta e organização de dados, \nconstrução e análise de tabelas simples e de dupla entrada, construção e análise de \ngráficos e infográficos, leitura e interpretação de dados em diferentes níveis de \ncomplexidade; \n4. O ensino e a aprendizagem de medidas de tendência central, de separação e dispersão em \nestatística; \n5. O ensino e a aprendizagem de análise combinatória e probabilidade; \n6. O ensino de Probabilidade e Estatística retratado em livros didáticos e em documentos \noficiais da Educação do Brasil, em especial na BNCC; \n7. Estratégias, recursos didático-pedagógicos e metodologias de ensino e aprendizagem de \nestatística, análise combinatória e probabilidade na educação básica. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n255 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Estudos Integradores 2",
        "Semestre": "8",
        "Ano": "",
        "Código": "CBTEIN2",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "2",
        "Total de aulas": "38",
        "CH Ensino": "28,5",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Interdisciplinaridade e desenvolvimento de projetos na Educação \nBásica; \nConhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.2 Sociologia da Educação; \nConhecimentos Pedagógicos / 2. Didática / 2.1 Ensino e aprendizagem; \nConhecimentos Pedagógicos/ 2. Didática / 2.2 Planejamento e avaliação; \nConhecimentos Pedagógicos/ 2. Didática / 2.3 Métodos e técnicas de ensino; \nConhecimentos Pedagógicos / 2. Didática / 2.4 Tecnologia e Mídias; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão /  5.1 Educação \nespecial; \nConhecimentos Pedagógicos / 5. Diversidade, direitos humanos e inclusão / 5.2 Educação para as \nrelações étnico- raciais.",
        "Ementa": "Este componente curricular tem como finalidade a orientação para que o estudante da licenciatura \ndesenvolva uma pesquisa científica no âmbito da Educação Matemática. Propõe caminhos dentro \nda Metodologia da Pesquisa Científica para a identificação, coleta e análise de dados qualitativos \ne/ou quantitativos. Discute propostas de possibilidades pelas quais a Matemática possa contribuir \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n257 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \npositivamente para a superação de diversas questões presentes na contemporaneidade, tais como \nas relacionadas às várias formas de exclusão (étnico-raciais, culturais, etária, comportamental, \nentre outras) e às questões socioambientais, tomando como suporte o desenvolvimento humano, \ncientífico e tecnológico, observando o trânsito delas no ambiente escolar e as consequências \ndessa presença. Tem como eixos fundantes a prática interdisciplinar e a construção de \npossibilidades para o sucesso escolar em Educação Matemática, a partir das pesquisas \ndesenvolvidas pelas/pelos graduandas/os. A carga horária de PCC deve ser destinada às \ndiscussões e elaboração de projetos pesquisa, os quais visam compreender as problemáticas do \nprocesso de ensino e aprendizagem de conceitos matemáticos.",
        "Objetivos": "1. Discutir conhecimentos matemáticos articulados às diversas áreas do conhecimento \nhumano, promovendo para uma visão interdisciplinar das Ciências, valorizando a \nMatemática como campo de saber essencial à resolução de situações do mundo real e \ndando subsídios para o desenvolvimento de projetos na Educação Básica; \n2. Compreender as etapas de pesquisa, elaboração e uso de materiais didáticos e \npedagógicos; \n3. Desenvolver possibilidades de ensino e aprendizagem na Educação Matemática, \nconstruindo pesquisas como continuidades dos projetos iniciados na disciplina de Estudos \nIntegradores 1, a partir da zona de interesse das/dos graduandos; \n4. Estabelecer um diálogo interdisciplinar, unindo as diversas áreas da Matemática, a partir \ndas propostas contidas nos projetos iniciais individuais ou/em grupos, avançando para a \npesquisa como continuidade/consequência direta dessa realização; \n5. Propor alternativas de ensino e aprendizagem a partir do diálogo entre os conhecimentos \nformais, não-formais e informais presentes nas comunidades escolar e loco-regional; \n6. Construir alternativas pedagógicas e materiais didáticos relacionados às áreas específicas \nda matemática, nas quais os projetos forem desenvolvidos; \n7. Constituir uma visão da Interdisciplinaridade como “pensamento”, onde as relações entre \nas diversas áreas do conhecimento estejam presente em quaisquer situações de ensino e \naprendizagem vivenciadas no desenvolvimento de seus projetos/pesquisas; \n8. Engendrar caminhos que estimulem o interesse pela Matemática, a partir de situações de \nensino e aprendizagem construídas em parceria com as diversas áreas do conhecimento. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n258 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Conteúdo Programático": "1. O papel da cultura na constituição do cotidiano escolar; \n2. Análise das relações de poder na escola com vistas à democracia e à inclusão social, \nconsiderando-se o multiculturalismo, a diversidade/diferenças, os direitos humanos;  \n3. Análise de espaços educativos formais, informais e não-formais e suas relações com a \nconstrução de saberes; \n4. Análise da educação como direito e seus desdobramentos no que se refere à inclusão, às \ndiferenças e à democracia; \n5. Análise de estratégias de ensino e de aprendizagem, da natureza dos conteúdos e das \nformas de avaliação; \n6. A importância da Didática no âmbito da formação docente, no contexto político-\neducacional contemporâneo; \n7. Mediação pedagógica; \n8. A relação pedagógica como cerne da Didática: os vínculos entre professor, aluno e \nconhecimento; \n9. A aula como organização do trabalho pedagógico como ação pedagógica para a \npromoção humana;  \n10. Reflexões teóricas/conceituais/práticas sobre o planejamento educacional em seus \ncontextos macro e micro, considerando a necessária articulação entre as diretrizes \ncurriculares, o currículo, o projeto político pedagógico da escola, os planos de ensino e os \nplanos de aula; \n11. Práxis como eixo do trabalho pedagógico;  \n12. Cotidiano da escola como um espaço/tempo de pesquisa e formação continuada;  \n13. A avaliação da aprendizagem como processo contínuo e formativo; \n14. Estratégias e recursos de ensino e aprendizagem tendo em vista as especificidades dos \nníveis e modalidades de ensino;  \n15. Metodologias de aprendizagem ativas e colaborativas; \n16. Pesquisa e interdisciplinaridade como método pedagógico; \n17. Práticas pedagógicas inclusivas; \n18. Transversalidade na educação; \n19. Recursos didático-pedagógicos tendo em vista as especificidades dos níveis e \nmodalidades de ensino; \n20. Utilização de tecnologias digitais para a aprendizagem;  \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n259 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n21. Ação pedagógica mediada por recursos tecnológicos e sua relação com a equidade e \njustiça social;  \n22. Acessibilidade e aprendizagem;  \n23. Relação entre mídia, tecnologia educacional, cultura e subjetividade.  Modalidades \neducacionais e processos formativos: presencial, virtual, híbrido; \n24. Princípios e Políticas da Educação Inclusiva no contexto educacional e nacional;  \n25. Acessibilidade e aprendizagem escolar;  \n26. Práticas pedagógicas inclusivas, nos diversos níveis e modalidades de ensino; \n27. Culturas afro-brasileiras e indígenas e suas respectivas produções culturais; \n28. Fundamentos e princípios metodológicos da Educação antirracista. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n260 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Física 3",
        "Semestre": "8",
        "Ano": "",
        "Código": "CBTFSC3",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Interdisciplinaridade e desenvolvimento de projetos na Educação \nBásica.",
        "Ementa": "O componente curricular complementa o estudo de fenômenos naturais explicados através da \nlinguagem matemática. O componente aborda tópicos de Eletricidade e Magnetismo do Ensino \nMédio, possibilitando a interação com o professor de Física e a construção de projetos \ninterdisciplinares entre ambas as áreas, além de relacionar a física com o meio ambiente. São \ntambém aplicações dos conceitos de Cálculo Diferencial e Integral e Vetores à Mecânica, não só \nfundamentando o aprendizado das disciplinas de Cálculo, mas também possibilitando uma \ncompreensão mais profunda dos tópicos estudados.",
        "Objetivos": "1. Discutir conhecimentos matemáticos articulados às diversas áreas do conhecimento \nhumano, promovendo para uma visão interdisciplinar das Ciências, valorizando a \nMatemática como campo de saber essencial à resolução de situações do mundo real, para \nentender questões ambientais e dando subsídios para o desenvolvimento de projetos na \nEducação Básica; \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n262 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \n2. Representar a realidade como um modelo matemático; \n3. Possibilitar que o estudante perceba as relações entre a Física, Matemática e meio \nambiente, principalmente no eletromagnetismo e Física Moderna. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n263 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Conteúdo Programático": "1. Carga Elétrica; \n2. Força Elétrica; \n3. Campo Elétrico; \n4. Potencial Elétrico e trabalho da força elétrica; \n5. Capacitores; \n6. Corrente Elétrica e Resistência Elétrica; \n7. Potência e Energia Elétrica; \n8. Magnetismo; \n9. Campo Magnético; \n10. Força Magnética; \n11. Corrente e Força Eletromotriz induzida; \n12. Elementos de estrutura da matéria; \n13. Noções de Relatividade; \n14. Noções de Radioatividade. \n15. Uso da Física Elétrica-Eletromagnética para explicar questões ambientais."
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Introdução à Análise Real",
        "Semestre": "8",
        "Ano": "",
        "Código": "CBTIARE",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Funções e Cálculo Diferencial e Integral;  \nConhecimentos específicos / Fundamentos de Análise.",
        "Ementa": "O componente curricular estuda as funções reais de uma variável real de uma maneira mais \ndetalhada e teórica do que um curso elementar de cálculo diferencial e integral. A abordagem \ndedica especial atenção ao enunciado e às demonstrações dos principais teoremas básicos ligados \nà continuidade, à diferenciabilidade e à integração de funções reais de uma variável.  \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n265 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Conhecer conceitos que estruturam o Cálculo Diferencial e Integral, assim como as outras \náreas da matemática, trazendo discussões que abordam questões reflexivas sobre como a \nsimbologia e a linguagem matemática, as formas de demonstração e o deslocamento do \nsaber; \n2. Compreender o conceito de função como um caso particular de relação, e ampliar o estudo \nde seu comportamento por meio de conceitos do Cálculo Diferencial e Integral, articulados \ncom outras áreas do conhecimento e com a Educação Básica; \n3. Propiciar conhecimento introdutório da análise matemática; \n4. Conhecer a definição axiomática dos números reais, considerando sua evolução histórica; \n5. Apresentar um estudo detalhado das principais ferramentas e teoremas ligados à \ncontinuidade, diferenciabilidade e integração de funções reais de uma variável real; \n6. Conhecer as principais noções e ideias ligadas aos conceitos e demonstrações de teoremas \nsobre funções reais; \n7. Ampliar o domínio de simples técnicas de demonstração matemática.",
        "Conteúdo Programático": "1. Definição axiomática dos números reais, valor absoluto, intervalos reais e enumerabilidade \nde conjuntos; \n2. Sequências e séries de números reais; \n3. Pontos de acumulação e limites de funções reais; \n4. Continuidade de funções reais: definições, noções e propriedades elementares, o Teorema \ndo Valor Intermediário, o Teorema de Weierstrass para funções contínuas em intervalos \nfechados; \n5. Diferenciabilidade de funções reais: definições, operações e propriedades básicas da \nderivação, crescimento e decrescimento local, máximos e mínimos locais, o Teorema de \nRolle, o Teorema do Valor Médio, a fórmula de Taylor; \n6. Integração de Riemann de funções reais: a integral de Riemann, funções integráveis, o \nTeorema Fundamental do Cálculo e integração por partes. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n266 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Matemática Financeira",
        "Semestre": "8",
        "Ano": "",
        "Código": "CBTMAFI",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos específicos / Educação Financeira.",
        "Ementa": "A disciplina aborda os conceitos de juros simples e compostos e suas aplicações nas operações \nde descontos e de equivalência de capitais. Também são discutidas as operações mais comuns de \nfinanciamentos, aplicações e investimentos, contribuindo para a compreensão sobre o \nfuncionamento do sistema financeiro e para a tomada de decisões assertivas. Privilegia a utilização \nde calculadora financeira e planilhas eletrônicas para resolver problemas da Matemática \nFinanceira. Apresenta o conceito de Educação Financeira, suas conexões com o consumismo, meio \nambiente e justiça social e suas possíveis abordagens na Educação Básica. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n268 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA",
        "Objetivos": "1. Apresentar conceitos da Educação Financeira, seus impactos e implicações na gestão \nfinanceira familiar, no desenvolvimento pessoal, social e ambiental para o fortalecimento \nda cidadania e apoio a ações que ajudem a população a tomar decisões financeiras mais \nautônomas e conscientes;  \n2. Reconhecer a Matemática Financeira como conhecimento matemático aplicado em uma \ndiversidade de situações cotidianas; \n3. Construir um significado para os conceitos de capital, juros, taxa de juros, tempo e \nmontante; \n4.  Aplicar e diferenciar os conceitos de juros simples e juros compostos; \n5.  Realizar operações de equivalência de taxas e de capitais; \n6. Compreender as principais sistemáticas de investimentos, empréstimos e amortizações; \n7. Manusear as calculadoras científica e financeira; \n8. Resolver problemas clássicos e tradicionais no campo da Matemática Financeira; \n9. Compreender o processo de ensino e aprendizagem de Matemática Financeira na \neducação básica.",
        "Conteúdo Programático": "1. Conceitos fundamentais: Porcentagem, Proporção, Potência e Logaritmo. \n2. Fluxo de caixa e orçamentos; \n3. Capitalização simples; \n4. Capitalização composta; \n5. Operações de descontos; \n6. Equivalência de Capitais; \n7. Financiamento e Sistemas de amortização; \n8. Análise de Investimos; \n9. O processo de ensino e aprendizagem de Matemática Financeira na educação básica;  \n10. Educação financeira: a importância do dinheiro, orçamento familiar, o papel da rede \nbancária, consumo e meio ambiente. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n269 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    },
    {
        "Curso": "Licenciatura em Matemática",
        "Componente curricular": "Reflexões sobre a Prática no Ensino de Matemática",
        "Semestre": "8",
        "Ano": "",
        "Código": "CBTRPEM",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "Número de docentes": "1",
        "Número de aulas semanais": "4",
        "Total de aulas": "76",
        "CH Ensino": "57",
        "CH Presencial": "",
        "CH a Distância": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Conhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.1 Filosofia da Educação; \nConhecimentos Pedagógicos / 1. Fundamentos da Educação / 1.4 Psicologia da Educação; \nConhecimentos Pedagógicos / 2. Didática / 2.1 Ensino e aprendizagem; \nConhecimentos Pedagógicos / 2. Didática / 2.2 Planejamento e avaliação; \nConhecimentos Pedagógicos / 2. Didática / 2.3 Métodos e técnicas de ensino.",
        "Ementa": "Este componente curricular tem por objetivo aprofundar a reflexão sobre a prática, possibilitando \no debate de ideias e situações didáticas experienciadas no estágio supervisionado à luz da teoria \ndiscutida e aprendida, contribuindo para a práxis do futuro professor.  \nArticulando-se ao estágio, fomenta, ainda, análises críticas sobre o papel da escola, do docente e \ndo ensino de Matemática no contexto contemporâneo, articulando dados de observação ao \nreferencial teórico.",
        "Objetivos": "1. Refletir sobre as experiências no estágio supervisionado em sala de aula, mediadas pela \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n271 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA \nteoria;  \n2. Fomentar atitude ética e relações de autonomia e de responsabilidade, pessoal e coletiva \nno exercício da docência; \n3. Construir repertório teórico-prático sobre a atividade docente, possibilitando a análise \ncrítica e a intervenção na realidade.",
        "Conteúdo Programático": "1. Fins e as finalidades da educação; \n2. Professor reflexivo e professor pesquisador;  \n3. A produção do registro do professor: compreensão das relações e do processo de \naprendizagem; \n4. O papel e a postura pedagógica do professor;  \n5. A escola e seu projeto político pedagógico; \n6. A avaliação da aprendizagem: a favor do desenvolvimento e sucesso escolar; \n7. Debate sobre estratégias de ensino-aprendizagem, conteúdos e formas de avaliação \nobservadas no estágio; \n8. Elementos estruturantes da organização didática da aula; \n9. Mediação pedagógica na sala de aula; \n10. A dimensão ética da aula; \n11. A escola como local de formação contínua e desenvolvimento profissional; \n12. Relações interpessoais no contexto pedagógico e suas implicações para a aprendizagem \ne trabalho docente; \n13. Práxis como eixo do trabalho pedagógico; \n14. Práticas pedagógicas inclusivas e democratização do ensino; \n15. Relação escola-família. \n\n \n \nProjeto Pedagógico do Curso Licenciatura em Matemática - Presencial \n272 \n \nCÂMPUS CUBATÃO \nLICENCIATURA EM MATEMÁTICA"
    }
]