[
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "Arte",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTMART",
        "Tipo": "Obrigatório/Linguagens",
        "Núcleo": "NEC",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "76",
        "C.H. Ensino": "",
        "C.H. Presencial": "57",
        "Abordagem Metodológica": "",
        "Lab": "20h",
        "Grupos de Conhecimentos Essenciais": "Fundamentos das linguagens artísticas/Arte \nApreciação, leitura e fruição de obras de arte/Arte \nCriação em Arte/Arte \nMediações, culturas e arte/Arte \nHistória e historiografias da arte e de suas linguagens/Arte \nPatrimônio cultural/Arte \nArtes híbridas/Arte",
        "Ementa": "A disciplina visa a compreensão da arte como área de conhecimento. \nExperimentação prática, leitura de obras e compreensão crítica das \n\n \n64 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \nmanifestações artísticas como formas de criação e expressão de conceitos, \nidentidades e sensibilidades, atrelados aos contextos social/históricos. Respeito \nà diversidade, valorização do patrimônio cultural e do potencial mobilizador da \narte no passado e no presente, com abertura para diferentes culturas, \nexpressões, períodos e temas.",
        "Objetivos": "• Compreender a arte como área de conhecimento, elaborada em linguagem \ne códigos específicos. \n• Compreender as manifestações artísticas como formas de criação e \nexpressão de conceitos, identidades e sensibilidades atreladas a ao seu \ncontexto social/histórico. \n• Apreciar e valorizar a diversidade cultural e as trocas culturais. \n• Conhecer \ne \nvalorizar manifestações \nculturais \nlocais, \nnacionais \ne \ninternacionais, do presente e do passado. \n• Criar a sua poética pessoal por meio do fazer e da experimentação. \n• Estimular o debate e a troca de ideias, a pesquisa e a crítica, a colaboração \nem grupo e o uso adequado dos materiais.",
        "Conteúdo Programático": "1. Projeto prático: Criação em arte  \n1.1. Identidades e expressões artísticas como fruto do diálogo entre o \nindividual e o social \n1.2. Processo de criação e reflexão sobre conceitos  \n1.3. Fundamentos das linguagens artísticas \n1.4. Fazer artístico. \n1.5. Apreciação, leitura e fruição dos trabalhos elaborados. \n2. Mediações, Culturas e artes \n2.1. Partilha e apreciação de culturas e manifestações variadas,   inclusive as \ntrazidas pelos alunos. \n2.2. Reflexões sobre repertório cultural, diversidade, cultura de massa, \ncultura contemporânea, mídias. \n3. História da Arte no presente \n\n \n65 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \n3.1. Renascimento e Barroco como marcas históricas na cultura e arte \nocidentais. \n3.2. Arte moderna  e  Arte contemporânea:  rupturas com a arte do passado. \n3.3. Apreciação, leitura e fruição das obras de arte. \n3.4. Patrimônio cultural, histórico e artístico \n4. Projeto de pesquisa e criação: Questões contemporâneas \n4.1. Trabalho \na \npartir \nde \ntemáticas \ne \nquestões \nrelevantes \nna \ncontemporaneidade. Entre os temas possíveis de serem abordados \nestão: cultura popular dos povos originários, africana e afro-brasileira; \nmulticulturalidade; arte, novas mídias e tecnologias; arte e política; \npreservação e valorização dos bens culturais; arte urbana, arte e meio-\nambiente, relações de gênero, inclusão; intersecção da arte com outras \náreas; campos de formação e atuação profissional na área de arte."
    },
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "Educação Física 1",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTMEF1",
        "Tipo": "Obrigatório / Linguagens",
        "Núcleo": "NEC",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "76",
        "C.H. Ensino": "",
        "C.H. Presencial": "57",
        "Abordagem Metodológica": "",
        "Lab": "Não se aplica",
        "Grupos de Conhecimentos Essenciais": "Práticas da cultura corporal em contextos de saúde e exercício físico/Educação \nFísica. \nPráticas da cultura corporal em contextos econômicos, midiáticos e de \nconsumo/Educação Física. \nPráticas da cultura corporal em contextos lúdicos, juvenis e virtuais/Educação \nFísica. \nPráticas da cultura corporal e modos de vida/Educação Física. \nPráticas da cultura corporal enquanto fenômeno e patrimônio humano e \nsocial/Educação Física.",
        "Ementa": "Esta disciplina contribui para a formação de um sujeito crítico, reflexivo e com \nautonomia para dialogar com as diferentes práticas corporais. Ao promover \nexperiências práticas e de reflexão, este componente curricular possibilita aos \n\n \n68 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \nestudantes uma leitura de mundo (de distintas óticas) que perpassa pelas \ndimensões sociopolítica, econômica, artística, afetiva e motora dos elementos \nda cultura corporal.",
        "Objetivos": "- Compreender que a disciplina de Educação Física, no espaço escolar, trabalha \ncom os diversos elementos da cultura corporal.  \n- Refletir e experienciar as práticas corporais oriundas de diferentes regiões do \nBrasil e do mundo. \n- Compreender os sistemas de jogos e realizar de forma prática as táticas em \nesportes de invasão e de rede (individuais, coletivos e adaptados). \n- Refletir sobre gênero e relações de poder em determinados jogos e esportes. \n- Analisar os padrões estéticos de beleza e os elementos da cultura corporal \nveiculados na mídia televisiva e nas redes sociais. \n- Analisar a relação entre sedentarismo, atividade física, exercício físico e \nesporte de alto rendimento, de modo a compreender o conceito ampliado de \nsaúde. \n- Abordar e experienciar as potencialidades afetivas e estéticas do corpo e da \nexpressão artística e cultural. \n- Possibilitar aos estudantes uma leitura de mundo (de distintas óticas) que \nperpassa pela experiência prática e conceitual dos jogos, danças, lutas, \nginásticas e esportes. Nesse ínterim, busca-se analisar a dimensão sociopolítica \ndesses elementos da cultura corporal.",
        "Conteúdo Programático": "▪ \nJogos, brinquedos e brincadeiras.  \n- Jogos e brincadeiras de diferentes origens e culturas (africanas, indígenas, \neuropeias, asiáticas etc.). \n- A ludicidade e a infância em diferentes regiões e períodos históricos.  \n- Os jogos eletrônicos e sua expansão na atualidade. \n\n \n69 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \n \n▪ \nEsportes \n- Sistemas de jogos e táticas de uma modalidade esportiva coletiva.  \n- Sistemas de jogos e táticas de uma modalidade esportiva individual. \n- O autocuidado e o cuidado com o outro. O fairplay e os valores nas práticas \nesportivas.  \n- Esporte e mídia: compreensão do fenômeno esportivo contemporâneo como \num espetáculo midiático. \n- A (in)visibilidade feminina no esporte;  \n- Indústria cultural, publicidade e esporte.  \n \n▪ \nCirco  \n- A história do circo: origens, modalidades e personagens. \n- Acrobacias de solo, malabares, palhaçaria e improviso. \n- As dificuldades de ser artista na sociedade contemporânea. \n \n▪ \nImagem corporal e padrões de beleza \n- Análise crítica dos estereótipos e dos padrões estéticos de beleza corporal.  \n- O corpo na mídia. \n- Distúrbios alimentares e de comportamento.  \n- Anabolizantes e seus impactos nos homens e nas mulheres.  \n- Sedentarismo, atividade física, exercício físico, esporte de alto rendimento e \no conceito ampliado de saúde (benefícios e malefícios)."
    },
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "Língua Portuguesa 1",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTMPO1",
        "Tipo": "Obrigatório / Linguagens",
        "Núcleo": "NEC",
        "N° de docentes": "1",
        "Nº de aulas semanais": "3",
        "Total de aulas": "114",
        "C.H. Ensino": "",
        "C.H. Presencial": "85,5",
        "Abordagem Metodológica": "",
        "Lab": "0h",
        "Grupos de Conhecimentos Essenciais": "Língua, identidade e sociedade / Língua Portuguesa \nConstrução de sentido, leitura e produção de textos orais e escritos / Língua \nPortuguesa \nLinguagem, tecnologia e mundo do trabalho / Língua Portuguesa \nHistória da Língua Portuguesa, gramática e sociedade / Língua Portuguesa \nLiteratura, história e cultura / Língua Portuguesa",
        "Ementa": "O componente curricular consiste em uma introdução ao estudo do português \ncomo língua viva e dinâmica. Apresenta noções introdutórias sobre língua e \nlinguagem em suas concepções e dimensões cognitiva, social, cultural, \nhistórica, subjetiva e ideológica. Aborda aspectos linguístico-discursivos do \nportuguês brasileiro que permitem construir bases para o desenvolvimento da \n\n \n72 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \nprática de leitura e de produção de textos escritos, orais e multimodais, com \nfoco em textos do campo do narrar. Apresenta estudantes aos conhecimentos \nintrodutórios sobre literatura e suas manifestações em língua portuguesa, \nincluindo, também em perspectiva comparativa, a brasileira, a portuguesa, a \nindígena, a africana e a afro-brasileira, entre outras. Desenvolve procedimentos \nbásicos para as práticas de interpretação de textos literários escritos em língua \nportuguesa, canônicos e não-canônicos. Inclui, entre seus temas, os direitos das \ncrianças e dos adolescentes; a prevenção de todas as formas de violência contra \na criança, o adolescente e a mulher; educação em direitos humanos; educação \ndigital.",
        "Objetivos": "• Desenvolver noções básicas sobre língua, linguagem e seu uso vivo e \ndinâmico, tais como: oralidade, escrita, graus de formalidade, variação \nlinguística, entre outros; \n• Compreender conceitos da fonética e da fonologia da língua portuguesa, \nbem como de aspectos estruturais da língua tais como a concordância \nnominal, e suas implicações para o uso; \n• Conhecer aspectos fundamentais da expressão escrita, tais como a \npontuação e a ortografia; \n• Desenvolver procedimentos para a produção de textos do campo do narrar, \narticulando também elementos de diferentes linguagens e suportes; \n• Compreender elementos básicos constituintes dos três grandes gêneros \nliterários e a circulação destes na contemporaneidade; \n• Conhecer aspectos das literaturas de expressão em língua portuguesa de \ndiferentes países e povos (brasileira, portuguesa, africanas e indígenas, entre \noutras), por meio de ferramentas da crítica literária, considerando seus \ncontextos de produção e seu diálogo com o presente; \n• Ampliar repertório cultural por meio do estudo da literatura dos séculos XIII \nao XVI em língua portuguesa e sua relação com outras artes e seu contexto \nhistórico de produção.",
        "Conteúdo Programático": "73 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \n1. Noções dos conceitos de língua, código, gramática, oralidade e escrita; \n2. Noções dos conceitos de língua portuguesa, português brasileiro e o \nportuguês falado em outros países; \n3. Relações entre o português e outras línguas e linguagens, reconhecendo a \ndiversidade linguística como patrimônio cultural e objeto de estudo; \n4. Introdução à semântica: sinonímia, antonímia, hiponímia, hiperonímia, \npolissemia e ambiguidade; \n5. Teoria da comunicação e funções da linguagem; \n6. Figuras de linguagem; \n7. Formalidade e informalidade como um continuum na língua em seus \ndiferentes contextos; \n8. Uso e análise contextualizados dos elementos linguístico-discursivos do \nportuguês brasileiro, relacionando-os, quando for o caso, com a variação \nlinguística e com as noções de grau de formalidade: \n8.1. Textualidade, coesão e coerência \n8.2. Pontuação \n8.3. Concordância nominal, variação linguística e grau de formalidade \n8.4. Noções de fonética no contexto do uso vivo e dinâmico da língua:  \n8.4.1. Sons, letras e classificação dos fonemas; \n8.4.2. Sílabas e divisão silábica; \n8.4.3. Encontros vocálicos e consonantais, dígrafos; \n8.4.4. Ortografia e acentuação. \n9. Produção e interpretação de textos do campo do narrar e da criação \nartística, tais como: microconto, conto, fábula, esquete teatral, crônica \nliterária, poema, letra de música, videoclipe, slam, fanfiction, entre outros; \n10. Introdução à leitura e produção de textos relacionados à esfera da \ntecnologia e do trabalho; \n11. Variação linguística e a natureza viva e dinâmica das línguas: \n11.1. \nConceitos de norma padrão e variedades linguísticas: variedades \nde prestígio, variedades estigmatizadas, relações de poder e definição \nda norma;  \n11.2. \nVariação linguística histórica; \n\n \n74 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \n11.3. \nA língua portuguesa e o português brasileiro como práticas \nsociais. \n12. Introdução aos estudos literários: o que é literatura \n13. Os grandes gêneros literários, suas características estruturais e suas \ncondições de produção e circulação contemporâneas: poesia, prosa e \ndrama; \n14. Práticas de leitura, estudo e análise de obras literárias diversas; \n15. Produção e circulação contemporâneas de literatura nas plataformas \ndigitais e cibercultura (por exemplo, blogs literários, fanfiction, entre outros); \n16. Noções sobre o conceito de cânone literário e sua constituição sócio-\nhistórica como espaço de conflito; \n17. Obras e autores/as representativos/as de literaturas africanas, indígenas e \nafro-brasileiras, bem como de movimentos literários populares e periféricos, \ncom foco no reconhecimento de valores e na apreciação estética da \nprodução; \n18. Identificação de aspectos formais e linguísticos das obras literárias dos \ndiferentes gêneros e análise de sua contribuição para a construção do \nsentido da obra; \n19. Obras e autores representativos do Trovadorismo, do Humanismo e do \nClassicismo; \n20. O Renascimento e sua importância para as artes; \n21. As condições de produção e circulação de textos literários escritos nos \nperíodos citados, bem como o papel das obras estudadas como expressão \nde formas de pensamento e de realidades de diferentes épocas, locais, \ngêneros, etnias e grupos sociais; \n22. Literatura comparada como ferramenta para prática de leitura literária, \npermitindo o estabelecimento de relações entre textos de diferentes \nautores/as, lugares, períodos, estilos, linguagens artísticas e gêneros \ntextuais; \n23. Formas contemporâneas de fruição de obras literárias em diferentes \nsuportes e linguagens, visando também à reflexão sobre a alteridade e a \ninclusão de pessoas com necessidades educacionais específicas (livros \n\n \n75 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \nimpressos, audiolivros, adaptações em quadrinhos, vídeos e outros \nsuportes, entre outros)."
    },
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "Língua Espanhola Iniciante",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTMES1",
        "Tipo": "Obrigatório / Linguagens",
        "Núcleo": "NEC",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "76",
        "C.H. Ensino": "",
        "C.H. Presencial": "57",
        "Abordagem Metodológica": "",
        "Lab": "0h",
        "Grupos de Conhecimentos Essenciais": "Uso da língua/Espanhol \nAspectos socioculturais/Espanhol \nRelações com o trabalho/Espanhol",
        "Ementa": "O componente curricular aborda a Língua Espanhola através de atividades de \nleitura, compreensão e interpretação para iniciar a construção de repertório \nlinguístico, literário e cultural dos aprendizes, considerando diferentes gêneros \ntextuais, orais e escritos. A competência comunicativa deve ser abordada em \ncontextos do mundo do trabalho, fundamentalmente, na área de Informática. \nO conhecimento acerca da pluralidade linguístico-cultural dos povos \nhispânicos é trabalhado de forma crítica.",
        "Objetivos": "77 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \n• Conhecer a fonética e fonologia:  sons do espanhol; aspectos contrastivos \nentre sons do espanhol e do português; \n• Estudar a morfologia:   classe   de   palavras (artigo, numeral, substantivo, \nadjetivo, advérbio, pronome, verbo e conjunção); \n• Compreender a variação linguística: algumas diferenças regionais; \ndiferenças de léxico em diferentes países hispano-falantes; diferenças de \nexpressões informais de acordo com o contexto ou grupos sociais; \n• Enfatizar a leitura e produção de textos descritivos; \n• Desenvolver a comunicação em contextos profissionais de eventos culturais; \n• Conhecer aspectos culturais relacionados à diversidade sociocultural dos \npaíses hispano-falantes; costumes folclóricos e tradições orais.",
        "Conteúdo Programático": "1. Apresentação e identificação pessoal, descrição da casa, da família, do \ntrabalho, da cidade e país, de pessoas, lugares e objetos, dos hábitos no \npresente, gostos e preferências; \n2. Identificação de diferenças linguísticas básicas: morfossintáticas, lexicais e \nfonológicas, que distinguem variedades do espanhol; \n3. Pronúncia e regras de acentuação; \n4. Estudo dos pronomes pessoais, dos pronomes oblíquos e das diferenças de \ntratamento de distintas variedades do espanhol, formas e usos dos artigos; \ndos demonstrativos; das preposições (para, a, en, hacia, hasta, de, desde); \ndos possessivos; dos interrogativos; das estruturas comparativas e dos \nsuperlativos; \n5. Conjugação regular e irregular do Presente de Indicativo; \n6. Verbos que expressam preferências, (Verbo Gustar); \n7. Prática de compreensão e expressão oral e escrita a partir de diferentes \ngêneros textuais que abordem o mundo do trabalho e contextos \nmulticulturais."
    },
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "Língua Inglesa 1",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTMIN1",
        "Tipo": "Obrigatório / Linguagens",
        "Núcleo": "NEC",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "76",
        "C.H. Ensino": "",
        "C.H. Presencial": "57",
        "Abordagem Metodológica": "",
        "Lab": "0h",
        "Grupos de Conhecimentos Essenciais": "Aspectos léxico-gramaticais/Inglês \nPráticas discursivas e textuais/Inglês \nRelações entre identidade, cultura e sociedade/Inglês \nLíngua inglesa para a formação integral e cidadã no mundo do trabalho/Inglês \nMultiletramentos/Inglês",
        "Ementa": "O componente curricular aborda os fundamentos da língua inglesa, de forma \ncontextualizada e integrada, para o desenvolvimento das competências \ncomunicativas em língua inglesa por meio de exercícios de leitura, \ncompreensão, interpretação e exploração de gramática em textos de caráter \ngeral. Busca, também, construir repertório linguístico e morfossintático para a \ncompreensão de diferentes tipos textuais, orais e escritos, e de situações de \n\n \n80 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \ninterações por meio da língua inglesa. Busca, ainda, promover relação entre as \ncompetências e habilidades do currículo ao mundo do trabalho.",
        "Objetivos": "• Explorar textos a partir da coesão, da forma e da coerência do pensamento; \n• Estudar formas gramaticais que auxiliem o trabalho de leitura e \ncompreensão de textos; \n• Desenvolver estratégias de leitura (títulos, ilustrações, diagramas, scanning \ne skimming, inferência e repetições) \n• Reconhecer marcadores do discurso; \n• Deduzir o significado e uso de vocabulário não-familiar; \n• Desenvolver estratégias de incorporação de vocabulário;  \n• Desenvolver atitudes de autoestima, autoconfiança e motivação; \n• Desenvolver atitudes de pesquisa;  \n• Promover reflexão acerca da saúde e do meio ambiente (Temas \nContemporâneos Transversais).",
        "Conteúdo Programático": "1. Conhecimento gramatical:  \n1.1. Pronome Pessoal: sujeito / objeto; \n1.2. Pronomes possessivos; \n1.3. Pronomes relativos; \n1.4. Adjetivos; \n1.5. Advérbios; \n1.6. Preposições; \n1.7. Verbo To Be; \n1.8. Pronomes interrogativos;  \n1.9. Presente Simples;  \n1.10. \nImperativo; \n1.11. \nVerbo modal: Can; \n1.12. \nPresente contínuo; \n1.13. \nComparativos; \n1.14. \nSuperlativos; \n\n \n81 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \n1.15. \nFonética e fonologia - aspectos gerais. \n2. Vocabulário:  \n2.1. Palavras transparentes; \n2.2. Grupos de palavras; \n2.3. Formação de palavras; \n2.4. Sinônimos; \n2.5. Frases substantivas; \n2.6. Marcadores de discurso; \n2.7. Palavras compostas."
    },
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "Matemática 1",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTMMA1",
        "Tipo": "Obrigatório / Matemática",
        "Núcleo": "NEC",
        "N° de docentes": "1",
        "Nº de aulas semanais": "3",
        "Total de aulas": "114",
        "C.H. Ensino": "",
        "C.H. Presencial": "85,5",
        "Abordagem Metodológica": "",
        "Lab": "0h",
        "Grupos de Conhecimentos Essenciais": "Números/Matemática \nGeometria/Matemática \nÁlgebra/Matemática \nGrandezas e medidas/Matemática",
        "Ementa": "Neste componente curricular, os estudantes têm a oportunidade de conhecer \na teoria dos conjuntos utilizando corretamente as notações, nomenclaturas e \npropriedades, resolver operações entre conjuntos e problemas por meio \ndesses conceitos. Aprofunda-se o conhecimento sobre os conjuntos numéricos \nutilizando as notações de intervalos para representar e operar com \nsubconjuntos dos números reais. Retomam-se os conceitos básicos de álgebra \nde modo a obter maior destreza em manipulações e cálculos algébricos. \nConceitos de geometria são retomados e aprofundados em figuras planas \n\n \n83 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \nincluindo ângulos, classificação de polígonos com estudo aprofundado de \ntriângulos, quadriláteros e semelhança de figuras. Generalizam-se processos \nde medição de comprimento e área, expressando os \nresultados \nadequadamente com unidades de medidas mais convenientes. Resolvem-se \nproblemas \nde \ngeometria \nmétrica \nenvolvendo \nrelações \nmétricas \ne \ntrigonométricas em triângulos. O estudo de função a partir da variação de \ngrandezas representada algébrica e graficamente evolui para o campo das \ncaracterísticas, regularidades, simetrias, comportamento e gráficos com \naplicações de funções de 1º e 2º graus. Equações e inequações de 1º e 2º graus \nsão tratadas algebricamente e por meio de situações-problema.",
        "Objetivos": "• Reconhecer e utilizar a linguagem algébrica como a linguagem das ciências, \nnecessárias para expressar as relações entre grandezas e modelar situações-\nproblema construindo modelos descritivos de fenômenos e permitindo \nvárias conexões dentro e fora da Matemática. \n• Ler e interpretar diferentes linguagens e representações. \n• Identificar regularidades e estabelecer relações. \n• Utilizar e interpretar modelos para resolução de situações-problema que \nenvolvam medições, em especial o cálculo de distâncias inacessíveis. \n• Identificar em dada situação-problema as informações ou variáveis \nrelevantes e elaborar possíveis estratégias para resolvê-la. \n• Construir uma visão sistemática das diferentes linguagens e campos de \nestudo da Matemática, estabelecendo conexões entre diferentes temas. \n• Compreender o conhecimento tecnológico como resultado de uma \nconstrução humana em um processo histórico e social.",
        "Conteúdo Programático": "1. Conjuntos e intervalos reais: \n1.1. Conjuntos numéricos: propriedades, operações e representações. \n1.2. Conjuntos: notação; operações; resolução de problemas. \n1.3. Intervalos reais: representação; operações (união, diferença e \nintersecção). \n\n \n84 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \n2. Álgebra: \n2.1. Linguagem algébrica: símbolos e notações; caráter generalizador da \nÁlgebra. \n2.2. Estudo de estruturas algébricas: produtos notáveis; fatoração; \nsimplificação. \n2.3. Resoluções de Problemas: equações de 1º grau; equações de 2º grau; \nsistemas de equações. \n3. Geometria Plana: \n3.1. Intuição: forma, tamanho e posição; \n3.2. Segmentos de reta: congruência, medida e ponto médio; \n3.3. Ângulos: conceito, unidades de medida (graus e radianos) e medição; \nclassificação. \n3.4. Posições \nrelativas \nentre \nretas \n(paralelas, \nconcorrentes \ne \nperpendiculares). \n3.5. Polígonos: propriedades; classificação. \n3.6. Quadriláteros: classificação, elementos e propriedades; inclusão \nhierárquica. \n3.7. Triângulos: propriedades; classificação segundo o tamanho dos lados e \nângulos; desigualdade triangular e semelhança de triângulos. \n3.8. Circunferência e círculo: propriedades, partes do círculo, arcos e ângulos \nna circunferência; \n3.9. Semelhança de figuras: razão de semelhança, Teorema linear de Tales, \nsemelhança de triângulos e potência de ponto. \n3.10. \n Perímetro e área de figuras planas; relações entre unidades de \nmedidas de área. \n4. Relações métricas e trigonométricas em triângulos: \n4.1. Relações métricas e trigonométricas no triângulo retângulo. \n5. Funções: \n5.1. Plano cartesiano: identificação, localização e representação de pontos. \n5.2. Padrões, regularidades e classificação. \n5.3. Gráficos e leis de funções: relação entre funções e gráfico; análise de \nsinal; crescimento e decrescimento; domínio e imagem. \n\n \n85 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \n5.4. Função como variação de grandezas. \n5.5. Função composta. \n5.6. Funções de 1º grau: características \ne regularidades; leitura, \ninterpretação e construção de gráficos; estudo do sinal; resolução de \nsituações problema. \n5.7. Funções de 2º grau: características \ne regularidades; leitura, \ninterpretação e construção de gráficos; estudo do sinal; resolução de \nsituações problema. \n5.8. Função inversa. \n5.9. Simetria e funções. \n5.10. \nInequações de 1º e 2º graus."
    },
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "Biologia 1",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTMBI1",
        "Tipo": "Obrigatório / Ciências da Natureza",
        "Núcleo": "NEC",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "76",
        "C.H. Ensino": "",
        "C.H. Presencial": "57",
        "Abordagem Metodológica": "",
        "Lab": "0h",
        "Grupos de Conhecimentos Essenciais": "Ciência e sociedade: aspectos históricos, filosóficos e sociológicos da ciência e \ntecnologia na história da humanidade/Biologia \nOrigem da vida e evolução: aspectos históricos, climáticos, geológicos e \nevolutivos do planeta e sua inter-relação com o surgimento, evolução e \ndiversificação da vida/Biologia \nA unidade da vida: aspectos estruturais, morfofisiológicos, bioquímicos e \nbiofísicos das células/Biologia",
        "Ementa": "O componente curricular desenvolve aspectos da origem da vida, dos seres \nvivos, dos tipos de células, assim como o conhecimento dos tipos de tecidos \ndo corpo humano, da reprodução e da fecundação",
        "Objetivos": "88 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \n• Compreender as diferenças entre biogênese e abiogênese e analisar as \ncaracterísticas gerais dos seres vivos. \n• Identificar a célula como unidade biológica e diferenciar células \nprocariontes de eucariontes. \n• Analisar os tipos de tecidos que formam os seres vivos \n• Conhecer as fases das divisões celulares mitose e meiose. \n• Compreender o processo de fecundação e de desenvolvimento \nembrionário",
        "Conteúdo Programático": "1. Origem da vida \n2. Características gerais dos seres vivos \n3. Tipos de células e tecidos \n4. Divisão celular mitose e meiose \n5. Fecundação e desenvolvimento embrionário"
    },
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "Geografia 1",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTMGE1",
        "Tipo": "Obrigatório / Ciências Humanas",
        "Núcleo": "NEC",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "76",
        "C.H. Ensino": "",
        "C.H. Presencial": "57",
        "Abordagem Metodológica": "",
        "Lab": "0h",
        "Grupos de Conhecimentos Essenciais": "Teorias, métodos e linguagens da Geografia/Geografia \nDinâmicas da natureza/Geografia \nQuestões ambientais/Geografia",
        "Ementa": "Este componente curricular aborda noções preliminares da história da \nGeografia como ciência e, princípios metodológicos; também dá ênfase a \ndinâmicas da natureza da Terra e a relação sociedade-natureza. Aborda \ntambém a educação ambiental.",
        "Objetivos": "• Compreender o objeto de estudo e análise da Geografia; bem como seus \nconceitos-chaves e de modo introdutório conhecimentos em relação a \nmétodos e metodologias geográficas; \n\n \n90 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \n• Entender as diversas variantes da dinâmica da natureza, nas dimensões da \ngeomorfológica, climática, hidrológica e biogeográfica do planeta Terra e \nde modo específico do Brasil; \n• Assimilar as dinâmicas da natureza no âmbito das dinâmicas da sociedade, \nprincipalmente no bojo do modo de produção capitalista.",
        "Conteúdo Programático": "1. Teoria, métodos e categorias geográficas; \n2. A história do pensamento geográfico e conceitos-chave da geografia; \n3. A Cartografia e a Geografia; \n4. Elementos do Mapa geográfico; \n5. Conhecimentos de Geomorfologia, da dinâmica da crosta terrestre à \nexploração de minérios no Brasil e no mundo; \n6. Climatologia geográfica, dinâmicas da natureza e mudanças climáticas, dos \nfatores naturais aos socioeconômicos; \n7. Hidrografia, o entendimento das bacias hidrográficas e a dinâmica \ngeográfica das águas; \n8. Os domínios da natureza, diferenciações e associações das dinâmicas da \nnatureza; \n9. Acordos e conferências ambientais, a dinâmica da natureza, geopolítica \nglobal e dinâmica da sociedade."
    },
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "História 1",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTMHI1",
        "Tipo": "Obrigatório / Ciências Humanas",
        "Núcleo": "NEC",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "76",
        "C.H. Ensino": "",
        "C.H. Presencial": "57",
        "Abordagem Metodológica": "",
        "Lab": "0h",
        "Grupos de Conhecimentos Essenciais": "Teorias e métodos do conhecimento histórico/História \nAntiguidade/História \nHistória medieval/História",
        "Ementa": "O componente curricular aborda os conhecimentos essenciais da Ciência \nHistórica, seus métodos e fundamentos teóricos. \nAnalisa, em termos empíricos, os aspectos fundamentais da vida humana na \nPré-História, bem como as primeiras grandes Civilizações da Antiguidade \nOriental e Africana (Egito). \nAborda as Civilizações da Antiguidade Clássica (Grécia, Roma), estabelecendo \nas bases fundamentais para compreensão das atuais civilizações do ocidente. \n\n \n93 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \nEstuda a Europa Medieval, nascida das ruínas das grandes civilizações da \nAntiguidade Clássica (Grécia e Roma), por sua centralidade, apresentando como \ncontraponto o desenvolvimento de outras civilizações em diferentes \ncontinentes (Civilizações Islâmica, Chinesa, Africanas e da América Pré-\nColombiana).",
        "Objetivos": "• Conhecer os princípios fundamentais da Ciência Histórica. \n• Compreender as bases sociais, econômicas, políticas e culturais das \nprimeiras Civilizações Humanas, bem como o seu desenvolvimento ao longo \nda História.",
        "Conteúdo Programático": "1. História e os seus Métodos \n2. A Pré-História \n3. A Mesopotâmia \n4. A Civilização Egípcia e as Civilizações Africanas \n5. As Civilizações Fenícia, Hebraica e Persa \n6. A Civilização Grega \n7. A Civilização Romana \n8. A Europa Medieval \n9. A Civilização Islâmica \n10. A Civilização Chinesa \n11. Os Povos Pré-Colombianos da América"
    },
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "Sistemas Computacionais 1",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTISC1",
        "Tipo": "Obrigatória/Técnica",
        "Núcleo": "NET",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "76",
        "C.H. Ensino": "",
        "C.H. Presencial": "57",
        "Abordagem Metodológica": "",
        "Lab": "57h",
        "Grupos de Conhecimentos Essenciais": "Fundamentos de Informática/ Informática \nInfraestrutura (hardware, sistemas operacionais, redes de computadores, \nsegurança)/ Informática",
        "Ementa": "O componente curricular aborda elementos fundamentais da computação, \ntrabalhando os conceitos de arquitetura de um computador em termos de seus \ncomponentes \n(processador, \nmemória \nprimária, \nmemória \nsecundária, \ndispositivos de entrada e de saída) e de sistemas operacionais (MS-DOS, \n\n \n96 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \nWindows, noções básicas de Linux).",
        "Objetivos": "• \nIdentificar os componentes dos computadores e seus periféricos, \nanalisando o funcionamento e o relacionamento entre eles; \n• \nAnalisar os serviços e funções de sistemas operacionais utilizando suas \nferramentas e recursos em atividades de configuração, manipulação de \narquivos, segurança e outras; \n• \nOrganizar atividades de Entrada e Saída de dados e sistemas de \ncomunicação; \n• \nSelecionar o Sistema Operacional de acordo com as necessidades do \nusuário; \n• \nDistinguir as arquiteturas e topologia de rede; \n• \nConhecer a infraestrutura de redes fisicamente e logicamente; \n• \nConhecer e compreender os sistemas numéricos de base decimal, \nbinária e hexadecimal e sua relação com a representação de dados e \ninstruções nos computadores. \n• \nAplicar e utilizar as estratégias de leitura na língua inglesa; \n• \nPrestar assistência técnica aos usuários em equipamentos e programas; \nPrestar assistência aos usuários no uso dos programas aplicativos instalados.",
        "Conteúdo Programático": ""
    },
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "Algoritmos",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTIALG",
        "Tipo": "Obrigatória/Técnica",
        "Núcleo": "NET",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "76",
        "C.H. Ensino": "",
        "C.H. Presencial": "57",
        "Abordagem Metodológica": "",
        "Lab": "57h",
        "Grupos de Conhecimentos Essenciais": "Fundamentos de Informática/Informática \nAlgoritmos e Linguagens de Programação/Informática",
        "Ementa": "O Componente Curricular apresenta noções básicas sobre processamento de \ndados, tipos de dados, definição de variáveis, operadores aritméticos, estruturas \nde decisão, estruturas de repetição, utilização de variáveis indexadas, \nclassificação e ordenação de dados e modularização (técnicas de programação \ncom sub-rotinas).",
        "Objetivos": "• \nConhecer os conceitos básicos do desenvolvimento de programas em \n\n \n99 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \nnível lógico; \n• \nResolver problemas computacionais (também em nível lógico) com uma \nvisão sistêmica; \n• \nInterpretar e solucionar problemas básicos por meio de lógica de \nprogramação de computadores; \n• \nUtilizar a ferramenta Microsoft Visio para apresentar os fluxogramas que \nrepresentam as soluções lógicas.",
        "Conteúdo Programático": ""
    },
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "Linguagem de Programação 1",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTILP1",
        "Tipo": "Obrigatória/Técnica",
        "Núcleo": "NET",
        "N° de docentes": "1",
        "Nº de aulas semanais": "3",
        "Total de aulas": "114",
        "C.H. Ensino": "",
        "C.H. Presencial": "85,5",
        "Abordagem Metodológica": "",
        "Lab": "85,5h",
        "Grupos de Conhecimentos Essenciais": "Algoritmos e linguagens de programação/Informática",
        "Ementa": "O Componente Curricular aborda temas como: Histórico da linguagem de \nprogramação; Conceitos iniciais de programação; Procedimentos básicos de \nEntrada/Saída em modo console. Trabalha com atividades que utilizam decisão \nlógica e estruturas de repetição, além de desenvolver programas com estruturas \nde armazenamento de dados em memória através de vetores e matrizes. Além \ndisso, estuda formas classificação e ordenação de dados e aborda a \nprogramação estruturada. \n\n \n102 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO",
        "Objetivos": "• Esclarecer e utilizar os conceitos básicos da linguagem de programação. \n•  Resolver problemas computacionais com uma visão sistêmica, \ndesenvolvendo programas;  \n• Aprender e utilizar as técnicas de programação modular e estruturada; \n• Criar e utilizar sub-rotinas e módulos de programação.  \n• Interpretar e solucionar problemas básicos por meio de programação de \ncomputadores em modo “Console”.",
        "Conteúdo Programático": ""
    },
    {
        "Curso": "Técnico em Informática Integrado ao Ensino Médio",
        "Componente curricular": "Prática de Laboratório 1",
        "Semestre": "",
        "Ano": "1",
        "Código": "CBTIPL1",
        "Tipo": "Obrigatória/Técnica",
        "Núcleo": "NET",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "76",
        "C.H. Ensino": "",
        "C.H. Presencial": "57",
        "Abordagem Metodológica": "",
        "Lab": "57h",
        "Grupos de Conhecimentos Essenciais": "Algoritmos e linguagens de programação/Informática",
        "Ementa": "O componente curricular aborda conceitos de desenvolvimento de páginas \npara internet, através do estudo da estruturação de uma página da internet, \nnavegadores, linguagem de desenvolvimento (html) e suas várias tags de \nmarcação e formatação. Apresenta ainda noções estéticas para a construção de \npáginas atrativas aos usuários.",
        "Objetivos": "• \nUtilizar os conceitos de desenvolvimento de aplicações em linguagem \nprópria para a internet; \n\n \n105 \nProjeto Pedagógico do Curso Técnico em Informática Integrado ao Ensino Médio \n \nCUBATÃO \nTÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO \n• \nIdentificar e elaborar aplicações para internet com planejamento e \nestrutura de organização; \n• \nTratar dados através de transferência com o uso de aplicativos \ndesenvolvidos para esta finalidade através do uso da internet.",
        "Conteúdo Programático": ""
    },
    {
        "Curso": "Tecnologia em Análise e Desenvolvimento de Sistemas",
        "Componente curricular": "Comunicação e Expressão",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTCEEX",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "38",
        "C.H. Ensino": "28,5",
        "C.H. Presencial": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Geral / Temas transversais",
        "Ementa": "O componente curricular apresenta uma visão geral do fenômeno da linguagem, nas suas \nexpressões orais e escritas, propondo uma revisão de conceitos gerais da gramática \nnormativa e da escrita acadêmica. Para isso, discute problemas de gramática e produção \nde texto articulando noções teóricas com exemplos reais de uso, de forma a abordar \npontos importantes para o letramento acadêmico, como concordância, coesão textual e \nestrutura de textos argumentativos e acadêmicos. A disciplina aborda, ainda, a literatura \nindígena no Brasil, apresentando breve histórico dos povos e elementos culturais dos \nindígenas brasileiros, mantendo foco na produção recente de autores indígenas bem \ncomo produção literária em países africanos de língua portuguesa, em seu contexto \nhistórico e social, discutindo o desenvolvimento da língua portuguesa na África, \napontando particularidades e usos que interessam à literatura, assim como algumas \n\n \n \nProjeto Pedagógico do Curso de Tecnologia em Análise e Desenvolvimento de Sistemas - Presencial \n \n92 \n \nCUBATÃO \nTECNOLOGIA EM ANÁLISE E DESENVOLVIMENTO DE SISTEMAS \nrelações com o Brasil, permeando as relações étnico-raciais e história e cultura afro-\nbrasileira",
        "Objetivos": "- \nRefletir sobre a relação da leitura e da escrita com o mundo; \n- \nPensar sobre a própria língua e fazer uso das normas da língua culta, padrão, de \nprestígio social, quando a situação assim o exigir; \n- \nExpressar-se por meio da Língua Portuguesa de maneira harmônica, clara e concisa, \nnas modalidades escrita e oral; \n- \nAprofundar o conhecimento acerca da estruturação de textos, observando as \ntipologias e multiplicidades de gêneros textuais com os quais trabalharão no dia a \ndia; \n- \nDistinguir um texto acadêmico de um texto não acadêmico; \n- \nSaber revisar, refletir e reelaborar os seus próprios textos; \n- \nConhecer aspectos gerais da cultura e da história indígena no Brasil, através da \nanálise de obras de autores indígenas e os recursos estilísticos da linguagem, assim \ncomo sua relação com a cultura e posicionamentos políticos; \n- \nDebater a influência da cultura afro-brasileira na literatura brasileira; \n- \nRefletir acerca do português falado nos países africanos de língua portuguesa.",
        "Conteúdo Programático": "- \nLinguagem e variação; \n- \nLinguagem verbal e não verbal; \n- \nLíngua oral e língua escrita; \n- \nNorma gramatical e variedades do português brasileiro; \n- \nRevisão gramatical: concordância nominal e verbal; \n- \nRevisão gramatical: regência nominal e verbal; \n- \nRevisão gramatical: acentuação e pontuação; \n- \nNoção de texto: textualidade, coesão e coerência; \n- \nTipologia textual; \n- \nGêneros textuais; \n- \nTexto argumentativo; \n- \nGêneros acadêmicos: resumo e resenha; \n\n \n \nProjeto Pedagógico do Curso de Tecnologia em Análise e Desenvolvimento de Sistemas - Presencial \n \n93 \n \nCUBATÃO \nTECNOLOGIA EM ANÁLISE E DESENVOLVIMENTO DE SISTEMAS \n- \nGêneros acadêmicos: apresentação oral e artigo; \n- \nGêneros acadêmicos: relatório e monografia; \n- \nHistória dos povos indígenas no Brasil; \n- \nLiteratura indígena: identidade e resistência; \n- \nA língua portuguesa e a história colonial africana;"
    },
    {
        "Curso": "Tecnologia em Análise e Desenvolvimento de Sistemas",
        "Componente curricular": "Fundamentos de Matemática",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTFMAT",
        "Tipo": "Obrigatória",
        "Núcleo": "",
        "N° de docentes": "1",
        "Nº de aulas semanais": "4",
        "Total de aulas": "76",
        "C.H. Ensino": "57",
        "C.H. Presencial": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Não há grupos de conhecimentos essenciais para este item no currículo de referência.",
        "Ementa": "O componente curricular aborda os conteúdos matemáticos que servem como base para \no entendimento de conceitos computacionais, bem como, auxiliam o desenvolvimento do \nraciocínio lógico-matemático, de forma a facilitar a aprendizagem de conceitos \ncomputacionais.",
        "Objetivos": "- \nConhecer as ferramentas de lógica matemática; \n- \nReconhecer e utilizar a linguagem algébrica necessária para expressar a relação \nentre grandezas e modelar situações-problema, construindo modelos descritivos \nde fenômenos, fazendo conexões dentro e fora da Computação;                               \n- \nRepresentar e interpretar uma tabela de números como uma matriz, identificando \nseus elementos, usos e propriedades; \n\n \n \nProjeto Pedagógico do Curso de Tecnologia em Análise e Desenvolvimento de Sistemas - Presencial \n \n95 \n \nCUBATÃO \nTECNOLOGIA EM ANÁLISE E DESENVOLVIMENTO DE SISTEMAS \n- \nCalcular o determinante de matrizes e utilizá-lo para a discussão de sistemas \nlineares; \n- \nIdentificar equações lineares e interpretá-las geometricamente na busca de uma \nsolução; \n- \nEstudar, classificar e resolver sistemas lineares por meio de diferentes processos; \n- \nIncorporar conceitos básicos da Teoria de Grafos e apresentar problemas que \npodem ser representados por grafos",
        "Conteúdo Programático": "- \nIntrodução à Lógica Matemática. \n- \nConjuntos. \n- \nFunções. \n- \nMatrizes. \n- \nDeterminantes. \n- \nSistemas Lineares. \n- \nGrafos e Árvores."
    },
    {
        "Curso": "Tecnologia em Análise e Desenvolvimento de Sistemas",
        "Componente curricular": "História da Ciência e da Tecnologia",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTHCTC",
        "Tipo": "Obrigatória",
        "Núcleo": "",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "38",
        "C.H. Ensino": "28,5",
        "C.H. Presencial": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Geral / Temas Transversais",
        "Ementa": "A disciplina trata dos conceitos científicos e suas aplicações tecnológicas ao longo da \nhistória, analisadas sob o enfoque da Educação, da Ciência e da Tecnologia e suas relações \ncom o desenvolvimento econômico-social, tratando também da temática da Educação \ndas Relações Étnicos Raciais e História e Cultura Afro-Brasileira e Indígena.",
        "Objetivos": "- Conhecer e considerar os processos históricos vinculados ao desenvolvimento da \nciência e da tecnologia para a apropriação de um saber articulado que facilite a \nação reflexiva, autônoma, crítica e criativa;  \n- Refletir sobre os impactos da ciência e da tecnologia nas várias etapas da história \nda civilização;  \n- Analisar a Ciência e a Tecnologia no âmbito do desenvolvimento econômico-social \natual e considerar a influência da cultura afro-brasileira e indígena",
        "Conteúdo Programático": "Projeto Pedagógico do Curso de Tecnologia em Análise e Desenvolvimento de Sistemas - Presencial \n \n98 \n \nCUBATÃO \nTECNOLOGIA EM ANÁLISE E DESENVOLVIMENTO DE SISTEMAS \n- A história do universo, a história da vida e a história do ser humano, da inteligência \ne da consciência;  \n- Relações entre ciência e tecnologia;  \n- Os papéis das revoluções científicas;  \n- Um breve histórico da Ciência ao longo dos tempos;  \n- Perspectivas para o futuro da Ciência e da Tecnologia;  \n- O senso comum e o saber sistematizado;  \n- A transformação do conceito de ciência ao longo da história; \n- As relações entre ciência, tecnologia e desenvolvimento social;  \n- O debate sobre a neutralidade da ciência;  \n- Influência da história e cultura afro-brasileira e indígena na ciência e tecnologia."
    },
    {
        "Curso": "Tecnologia em Análise e Desenvolvimento de Sistemas",
        "Componente curricular": "Inglês Técnico Inicial",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTITIN",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "38",
        "C.H. Ensino": "28,5",
        "C.H. Presencial": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Não há grupos de conhecimentos essenciais para este item no currículo de referência.",
        "Ementa": "O componente curricular, em consonância ao Quadro Comum Europeu de Referência para \nLínguas (CEFR – A1), aborda os fundamentos da língua inglesa, de forma técnica e \nespecífica, para o desenvolvimento da habilidade de leitura dos estudantes, possibilitando \na aplicação dessa no contexto profissional em que atuarão. Busca, ainda, construir \nrepertório linguístico e morfossintático para a compreensão de diferentes textos em \nlíngua inglesa.",
        "Objetivos": "- Compreender e utilizar repertório linguístico e morfossintático da língua inglesa \npara possibilitar a leitura de diferentes textos; \n- Empregar habilidades de localização de palavras, expressões e termos técnicos em \ndicionários e glossários específicos da área a fim de aprofundar a compreensão de \ntextos; \n\n \n \nProjeto Pedagógico do Curso de Tecnologia em Análise e Desenvolvimento de Sistemas - Presencial \n \n100 \n \nCUBATÃO \nTECNOLOGIA EM ANÁLISE E DESENVOLVIMENTO DE SISTEMAS \n- Analisar textos escritos em língua inglesa, sobretudo aqueles específicos da área \nde Informática; \n- Refletir a respeito da diversidade cultural anglo-americana por meio de textos, \nincitando o senso crítico e promovendo uma postura cidadã.",
        "Conteúdo Programático": "- Técnicas e estratégias de leitura.  \n- Estratégias de aquisição de vocabulário (uso do dicionário; utilização de \nferramentas de buscas; glossários etc.);  \n- Formação de palavras;  \n- Sufixos e prefixos;  \n- Pronomes;  \n- Advérbios;  \n- Tempos e modos verbais;  \n- Vocabulário básico da língua inglesa;  \n- Vocabulário específico para informática."
    },
    {
        "Curso": "Tecnologia em Análise e Desenvolvimento de Sistemas",
        "Componente curricular": "Algoritmos e Programação",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTAPRG",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "N° de docentes": "2",
        "Nº de aulas semanais": "4",
        "Total de aulas": "76",
        "C.H. Ensino": "57",
        "C.H. Presencial": "",
        "Abordagem Metodológica": "Prática",
        "Lab": "Sim",
        "Grupos de Conhecimentos Essenciais": "Específico / Algoritmos e Programação",
        "Ementa": "A disciplina permite o desenvolvimento do raciocínio lógico por meio do formalismo de \nlinguagem de programação, abordando os princípios da representação e manipulação da \ninformação, fornecendo a base lógica e o algoritmo para a implementação de código em \nlinguagem de programação de computadores.",
        "Objetivos": "- \nConhecer as ferramentas para a documentação de algoritmos; \n- \nCompreender o funcionamento das estruturas e instruções utilizadas em \nprogramação de computadores bem como para o armazenamento de informação \npara processamento; \n- \nAprender a desenvolver algoritmos para a solução de problemas por programas de \ncomputadores. \n\n \n \nProjeto Pedagógico do Curso de Tecnologia em Análise e Desenvolvimento de Sistemas - Presencial \n \n103 \n \nCUBATÃO \nTECNOLOGIA EM ANÁLISE E DESENVOLVIMENTO DE SISTEMAS",
        "Conteúdo Programático": "- \nLógica de programação;  \n- \nProgramação estruturada;  \n- \nRepresentações de algoritmos em diagrama de blocos (fluxograma) e português \nestruturado; \n- \nTipos de dados básicos; \n- \nIdentificadores; \n- \nOperadores aritméticos, relacionais e lógicos; \n- \nExpressões lógicas e aritméticas; \n- \nProgramação sequencial; \n- \nEstruturas de controle condicional e de repetição; \n- \nVariáveis compostas homogêneas (unidimensionais e bidimensionais) e não \nhomogêneas; \n- \nIntrodução à programação modular: procedimentos, funções e passagem de \nparâmetros."
    },
    {
        "Curso": "Tecnologia em Análise e Desenvolvimento de Sistemas",
        "Componente curricular": "Arquitetura de Computadores",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTARQC",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "38",
        "C.H. Ensino": "28,5",
        "C.H. Presencial": "",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Específico / Arquitetura de Computadores",
        "Ementa": "A disciplina faz um estudo da arquitetura de sistemas computacionais e seus \ncomponentes, visando a compreensão do funcionamento individual e a interação entre \nos componentes fundamentais.",
        "Objetivos": "- \nEntender o que é e como funciona um computador; \n- \nCompreender os conceitos da arquitetura de um computador clássico, seus \nfundamentos e os princípios de funcionamento; \n- \nCompreender o conceito de memória com suas diferentes funções e medidas de \ndesempenho; \n- \nConhecer os principais mecanismos para a realização de operações de entrada e \nsaída bem como os principais dispositivos envolvidos.",
        "Conteúdo Programático": "Projeto Pedagógico do Curso de Tecnologia em Análise e Desenvolvimento de Sistemas - Presencial \n \n106 \n \nCUBATÃO \nTECNOLOGIA EM ANÁLISE E DESENVOLVIMENTO DE SISTEMAS \n- \nArquitetura de Von Neumann: memória interna, processador; \n- \nBarramentos, pontes norte e sul; \n- \nOrganização de memórias: interna, externa e virtual; \n- \nSistemas de numeração: binário, hexadecimal e outros; \n- \nOperações aritméticas em binário; \n- \nCoprocessador; \n- \nMultitarefa; \n- \nSegmentação e Paginação de memória; \n- \nParalelismo, Arquitetura Pipeline, Super Escalar e EPIC/VLIW; \n- \nRepresentação para tipos de dados em memória; \n- \nLinguagem Assembly."
    },
    {
        "Curso": "Tecnologia em Análise e Desenvolvimento de Sistemas",
        "Componente curricular": "Desenvolvimento Web",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTDWEB",
        "Tipo": "Obrigatório",
        "Núcleo": "",
        "N° de docentes": "2",
        "Nº de aulas semanais": "4",
        "Total de aulas": "76",
        "C.H. Ensino": "57",
        "C.H. Presencial": "",
        "Abordagem Metodológica": "Prática",
        "Lab": "Sim",
        "Grupos de Conhecimentos Essenciais": "Específico / Algoritmos e Programação",
        "Ementa": "A disciplina apresenta os fundamentos para a compreensão dos princípios relacionados \ncom o desenvolvimento de páginas para sites de Internet.",
        "Objetivos": "- \nConhecer elementos básicos estruturais e estéticos para o desenvolvimento de \npáginas estáticas e dinâmicas para internet, por meio de linguagem de marcação \nde hipertexto, folhas de estilo e bibliotecas de funções. \n- \nCompreender o funcionamento das estruturas, instruções e semântica utilizadas \nem programação responsiva para sites de internet bem como a infraestrutura e \nfuncionamento de protocolos para servidores de hospedagens de sites. \n\n \n \nProjeto Pedagógico do Curso de Tecnologia em Análise e Desenvolvimento de Sistemas - Presencial \n \n108 \n \nCUBATÃO \nTECNOLOGIA EM ANÁLISE E DESENVOLVIMENTO DE SISTEMAS \n- \nDesenvolver páginas responsivas bem como hospedar sites em servidores para \ninternet.",
        "Conteúdo Programático": "- \nNavegadores e ferramentas de desenvolvedor; \n- \nServidores de hospedagem de sites; \n- \nRegistro de domínios; \n- \nProtocolo FTP; \n- \nEstrutura básica e semântica HTML 5; \n- \nFormulários, tabelas, listas, imagens e URLs; \n- \nVersionamento com GIT; \n- \nFolha de Estilos em Cascata – CSS 3; \n- \nResponsividade com Flexbox; \n- \nFrameworks responsivos;"
    },
    {
        "Curso": "Superior de Tecnologia em Automação Industrial",
        "Componente curricular": "Cálculo Diferencial e Integral 1",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTCDI1",
        "Tipo": "Obrigatória",
        "Núcleo": "",
        "N° de docentes": "1",
        "Nº de aulas semanais": "5",
        "Total de aulas": "95",
        "C.H. Ensino": "",
        "C.H. Presencial": "71,3 h",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Geral/Cálculo.",
        "Ementa": "Este componente curricular apresenta elementos de matemática básica e o estudo de \ncálculo diferencial. A primeira parte, pré-cálculo, contempla conceitos como \npropriedades de potenciação e radiciação, operações com frações, fatoração de \npolinômios e a representação de conjuntos numéricos. Explora também o conceito de \nfunção e seus elementos, chegando ao estudo das funções polinomiais, trigonométricas, \nexponenciais, logarítmicas e envolvendo módulo, além da resolução de equações e \ninequações envolvendo estes elementos. A segunda parte apresenta o conceito de \nlimites, define derivada como um limite, explora o conceito de derivada como taxa de \nvariação. Além disto, apresenta regras práticas para derivação e aplicações das \nderivadas.",
        "Objetivos": "- \nProporcionar ao estudante um embasamento de fundamentos de matemática a \nserem usados no cálculo diferencial de uma variável.  \n- \nConstruir e aplicar as noções de limite e continuidade.  \n- \nIntroduzir o conceito de derivada pautado na ideia de limite e regras de \nderivação de funções.  \n- \nExplorar aplicações de derivadas.",
        "Conteúdo Programático": "- \nConjuntos numéricos: Operações entre conjuntos.  \n- \nConjunto dos números naturais, inteiros, racionais e reais. Intervalos reais.  \n- \nNotação para representar conjuntos.  \n- \nOperações com frações. \n- \nPolinômios e fatoração: Grau e operações.  \n- \nProdutos notáveis. Fatoração de polinômios utilizando os produtos notáveis. \n- \nEquações e inequações de 1.º e 2.º graus. \n- \nFunções: Definição.  \n\n \n \n120 \n \nCÂMPUS CUBATÃO \nTECNOLOGIA EM AUTOMAÇÃO INDUSTRIAL \n- \nFormas de representação.  \n- \nDomínio e imagem.  \n- \nEstudo do sinal de funções. \n- \nFunções polinomiais, trigonométricas, exponenciais, logarítmicas e envolvendo \nmódulo. \n- \nLimites: Ideia intuitiva; Cálculo dos limites.  \n- \nPropriedades Operatórias. \n- \nLimites laterais.  \n- \nLimites no infinito; Limites Infinitos; Continuidade. \n- \nDerivadas: Definição.  \n- \nInterpretação geométrica.  \n- \nTaxa de variação.  \n- \nTeorema do Valor Médio. \n- \nRegras de derivação: Derivada da função constante, polinomial, exponencial, \nlogarítmica e trigonométrica.  \n- \nRegra do produto.  \n- \nRegra do quociente. \n- \nRegra da cadeia.  \n- \nRegra de L’Hospital.  \n- \nAplicações de derivadas."
    },
    {
        "Curso": "Superior de Tecnologia em Automação Industrial",
        "Componente curricular": "Desenho",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTDESA",
        "Tipo": "Obrigatória",
        "Núcleo": "",
        "N° de docentes": "2",
        "Nº de aulas semanais": "5",
        "Total de aulas": "95",
        "C.H. Ensino": "",
        "C.H. Presencial": "71,3 h",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Sim",
        "Grupos de Conhecimentos Essenciais": "Geral/Desenho Técnico.",
        "Ementa": "A disciplina aborda a avaliação de recursos de informática e suas aplicações ao desenho, \nalém da interpretação de desenhos, representações gráficas e projetos. Também aborda \na elaboração de desenhos utilizando o sistema CAD.",
        "Objetivos": "- \nCompreender alguns princípios estabelecidos nas normas para desenho técnico. \n- \nSaber visualizar peças simples em perspectiva. \n- \nSaber representar peças por meio de três vistas ortogonais. \n- \nConhecer técnicas simples para desenho em perspectiva.  \n- \nSaber desenhar em duas dimensões (2D) utilizando comandos básicos de \nsoftware CAD. \n- \nUtilizar os comandos da área de trabalho, visualização, modificação, \ndimensionamento e criação de objetos.",
        "Conteúdo Programático": "- \nNormas e convenções: formatos, letras e algarismos, legendas, linhas e escalas. \n- \nDesenho geométrico (construções e aplicações). \n- \nProjeção ortogonal. \n- \nVistas ortográficas.  \n- \nNormas para projeções ortogonais no primeiro diedro. \n- \nLeitura e interpretação de desenho técnico. \n- \nPerspectivas. \n- \nPerspectiva isométrica. \n- \nHachuras. Cortes e seções. \n- \nCotas. \n- \nDesenho técnico auxiliado por computador. \n- \nIntrodução ao editor gráfico: características, área gráfica, configuração e \ndefinições, barras de ferramentas, linha de comando. \n- \nCoordenadas absolutas, relativas e polares. \n\n \n \n126 \n \nCÂMPUS CUBATÃO \nTECNOLOGIA EM AUTOMAÇÃO INDUSTRIAL \n- \nComandos de visualização. \n- \nComandos de precisão (object snap). \n- \nComandos de criação de objetos: linha, círculo, polígono, retângulo, arco. \n- \nComandos de modificação de objetos: copiar, aparar, apagar, mover, espelhar, \nrotacionar, explodir, unir etc. \n- \nComandos de edição de textos. \n- \nComandos de dimensionamento. \n- \nPropriedades (tipos de linhas, cores e espessura). \n- \nCamadas de trabalho (layers)."
    },
    {
        "Curso": "Superior de Tecnologia em Automação Industrial",
        "Componente curricular": "Introdução à Automação Industrial",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTIAIN",
        "Tipo": "Obrigatória",
        "Núcleo": "",
        "N° de docentes": "1",
        "Nº de aulas semanais": "2",
        "Total de aulas": "38",
        "C.H. Ensino": "",
        "C.H. Presencial": "28,5 h",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Sim",
        "Grupos de Conhecimentos Essenciais": "Não se aplica.",
        "Ementa": "A disciplina apresenta a Profissão do Tecnólogo, suas atribuições, atividades, a \nlegislação específica e regulamentação profissional. Realiza uma análise do mercado de \ntrabalho permitindo e permite o estudo básico de processos: siderúrgico, petroquímico \ne permite introduzir a aplicação da automação a estes processos.",
        "Objetivos": "Conhecer os principais aspectos relativos à carreira do tecnólogo e obter uma base \nconceitual para contextualizar as disciplinas específicas do curso.",
        "Conteúdo Programático": "- \nIntrodução da Automação Industrial.  \n- \nConselhos Regionais - CRQ e CREA. \n- \nMercado de trabalho para o Tecnólogo em Automação e Controle de Processos.  \n- \nCiclo de um produto.  \n- \nEletricidade e Eletrônica.  \n- \nSensores.  \n- \nAtuadores e válvulas.  \n- \nConceitos básicos sobre controle de processos.  \n- \nConceitos básicos sobre controladores lógicos programáveis.  \n- \nConceitos básicos sobre redes industriais e sistemas supervisórios.  \n- \nConceitos básicos sobre automação da manufatura."
    },
    {
        "Curso": "Superior de Tecnologia em Automação Industrial",
        "Componente curricular": "Programação de Computadores 1",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTPRC1",
        "Tipo": "Obrigatória",
        "Núcleo": "",
        "N° de docentes": "2",
        "Nº de aulas semanais": "3",
        "Total de aulas": "57",
        "C.H. Ensino": "",
        "C.H. Presencial": "42,8 h",
        "Abordagem Metodológica": "Teórica e Prática",
        "Lab": "Sim",
        "Grupos de Conhecimentos Essenciais": "Geral/Programação.",
        "Ementa": "Desenvolver a programação de computadores conhecendo e estudando os principais \ncomandos e operadores para poder desenvolver programas e aplicativos necessários à \nautomação industrial.",
        "Objetivos": "- \nIntroduzir os conceitos básicos de uma linguagem de programação estruturada.  \n- \nHabilitar o aluno a implementar soluções tecnológicas através da utilização da \nlinguagem de programação estruturada.  \n- \nUtilizar a linguagem de programação estudada para o desenvolvimento de \naplicações básicas.",
        "Conteúdo Programático": "- \nIntrodução à programação de computadores. \n- \nCaracterísticas de uma linguagem de programação estruturada.  \n- \nConhecendo o ambiente de programação.  \n- \nTipos de Variáveis.  \n- \nOperadores matemáticos.  \n- \nOperadores relacionais.  \n- \nEstruturas de Decisão.  \n- \nEstruturas de Repetição.  \n- \nEstrutura de Controle com Múltipla Escolha. \n- \nStrings, Arrays e Matrizes. \n- \nFunções de manipulação de Strings. \n- \nInter-relação entre tecnologias computacionais e o direito à informação, à \nprivacidade, ao conhecimento e à inclusão digital. \n- \nNoções LGPD."
    },
    {
        "Curso": "Superior de Tecnologia em Automação Industrial",
        "Componente curricular": "Física Experimental I",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTFIE1",
        "Tipo": "Obrigatória",
        "Núcleo": "",
        "N° de docentes": "2",
        "Nº de aulas semanais": "2",
        "Total de aulas": "38",
        "C.H. Ensino": "",
        "C.H. Presencial": "28,5 h",
        "Abordagem Metodológica": "Prática",
        "Lab": "Sim",
        "Grupos de Conhecimentos Essenciais": "Geral/Física aplicada.",
        "Ementa": "A disciplina desenvolve experimentos de mecânica clássica, base cientifica para \nautomação de processos.",
        "Objetivos": "- \nDesenvolver procedimentos experimentais do momento linear. \n- \nDesenvolver procedimentos experimentais das Leis de Newton e suas aplicações. \n- \nDesenvolver procedimentos experimentais de Estática dos Fluidos. \n- \nDesenvolver procedimentos experimentais da Dinâmica dos Fluidos. \n- \nDesenvolver procedimentos experimentais Oscilações e Movimento ondulatório.",
        "Conteúdo Programático": "- \nConservação do momento linear.  \n- \nLeis de Newton e suas aplicações.  \n- \nConservação do momento angular.  \n- \nTorque e vantagem mecânica.  \n- \nConservação da energia.  \n- \nTrabalho, transformação de energia, potência.  \n- \nCinemática vetorial. \n- \nEstática dos Fluidos. \n- \nDinâmica dos Fluidos. \n- \nOscilações e Movimento ondulatório."
    },
    {
        "Curso": "Superior de Tecnologia em Automação Industrial",
        "Componente curricular": "Física Teórica 1",
        "Semestre": "1",
        "Ano": "",
        "Código": "CBTFIS1",
        "Tipo": "Obrigatória",
        "Núcleo": "",
        "N° de docentes": "1",
        "Nº de aulas semanais": "3",
        "Total de aulas": "57",
        "C.H. Ensino": "",
        "C.H. Presencial": "42,8 h",
        "Abordagem Metodológica": "Teórica",
        "Lab": "Não",
        "Grupos de Conhecimentos Essenciais": "Geral/Física aplicada.",
        "Ementa": "A disciplina deverá trabalhar a dinâmica na mecânica clássica, a cinemática e dinâmica \nvetorial, principalmente, dando ênfase ao movimento angular aplicando nas máquinas \nelétricas e robôs. Além disso, abordará o processo de aprendizagem em estática e \ndinâmica dos fluidos até a Equação de Bernoulli e aplicações em controle e automação \nde processos contínuos. Por fim, será abordado oscilações e movimento angular \naplicado à Automação.",
        "Objetivos": "- \nDesenvolver conceitos básicos de mecânica a partir de suas leis de conservação. \n- \nIdentificar variáveis pertinentes para análise de situações de estática e de \ndinâmica de corpos rígidos e de máquinas simples. \n- \nDesenvolver conhecimentos fundamentais para entender as estruturas e o \nfuncionamento de máquinas.",
        "Conteúdo Programático": "- \nQuantidade de Movimento. \n- \nForça e Leis de Newton – duas e três dimensões. \n- \nAplicações das Leis de Newton. \n- \nCinemática Vetorial. \n- \nCinemática Rotacional. \n- \nDinâmica Rotacional. \n- \nQuantidade de Movimento Angular. \n- \nTrabalho e Energia Cinética. Energia Potencial. \n- \nConservação de Energia. \n- \nEstática e Dinâmica dos Fluidos.  \n- \nOscilações e Movimento Ondulatório."
    }
]