[
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"Arte",
    "Código":"CBTMART",
    "Tipo":"Obrigatório\/Linguagens",
    "Núcleo":"NEC",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Fundamentos das linguagens artísticas\/Arte  Apreciação, leitura e fruição de obras de arte\/Arte  Criação em Arte\/Arte  Mediações, culturas e arte\/Arte  História e historiografias da arte e de suas linguagens\/Arte  Patrimônio cultural\/Arte  Artes híbridas\/Arte",
    "Ementa":"A disciplina visa a compreensão da arte como área de conhecimento.  Experimentação prática, leitura de obras e compreensão crítica das  manifestações artísticas como formas de criação e expressão de conceitos,  identidades e sensibilidades, atrelados aos contextos social\/históricos. Respeito  à diversidade, valorização do patrimônio cultural e do potencial mobilizador da  arte no passado e no presente, com abertura para diferentes culturas,  expressões, períodos e temas.",
    "Objetivos":"• Compreender a arte como área de conhecimento, elaborada em linguagem  e códigos específicos.  • Compreender as manifestações artísticas como formas de criação e  expressão de conceitos, identidades e sensibilidades atreladas a ao seu  contexto social\/histórico.  • Apreciar e valorizar a diversidade cultural e as trocas culturais.  • Conhecer  e  valorizar manifestações  culturais  locais,  nacionais  e  internacionais, do presente e do passado.  • Criar a sua poética pessoal por meio do fazer e da experimentação.  • Estimular o debate e a troca de ideias, a pesquisa e a crítica, a colaboração  em grupo e o uso adequado dos materiais.  5 – CONTEÚDO PROGRAMÁTICO:  1. Projeto prático: Criação em arte  1.1. Identidades e expressões artísticas como fruto do diálogo entre o  individual e o social  1.2. Processo de criação e reflexão sobre conceitos  1.3. Fundamentos das linguagens artísticas  1.4. Fazer artístico.  1.5. Apreciação, leitura e fruição dos trabalhos elaborados.  2. Mediações, Culturas e artes  2.1. Partilha e apreciação de culturas e manifestações variadas, inclusive as  trazidas pelos alunos.  2.2. Reflexões sobre repertório cultural, diversidade, cultura de massa,  cultura contemporânea, mídias.  3. História da Arte no presente  3.1. Renascimento e Barroco como marcas históricas na cultura e arte  ocidentais.  3.2. Arte moderna e Arte contemporânea: rupturas com a arte do passado.  3.3. Apreciação, leitura e fruição das obras de arte.  3.4. Patrimônio cultural, histórico e artístico  4. Projeto de pesquisa e criação: Questões contemporâneas  4.1. Trabalho  a  partir  de  temáticas  e  questões  relevantes  na  contemporaneidade. Entre os temas possíveis de serem abordados  estão: cultura popular dos povos originários, africana e afro-brasileira;  multiculturalidade; arte, novas mídias e tecnologias; arte e política;  preservação e valorização dos bens culturais; arte urbana, arte e meio- ambiente, relações de gênero, inclusão; intersecção da arte com outras  áreas; campos de formação e atuação profissional na área de arte.",
    "Conteúdo Programático":"1. Projeto prático: Criação em arte  1.1. Identidades e expressões artísticas como fruto do diálogo entre o  individual e o social  1.2. Processo de criação e reflexão sobre conceitos  1.3. Fundamentos das linguagens artísticas  1.4. Fazer artístico.  1.5. Apreciação, leitura e fruição dos trabalhos elaborados.  2. Mediações, Culturas e artes  2.1. Partilha e apreciação de culturas e manifestações variadas, inclusive as  trazidas pelos alunos.  2.2. Reflexões sobre repertório cultural, diversidade, cultura de massa,  cultura contemporânea, mídias.  3. História da Arte no presente  3.1. Renascimento e Barroco como marcas históricas na cultura e arte  ocidentais.  3.2. Arte moderna e Arte contemporânea: rupturas com a arte do passado.  3.3. Apreciação, leitura e fruição das obras de arte.  3.4. Patrimônio cultural, histórico e artístico  4. Projeto de pesquisa e criação: Questões contemporâneas  4.1. Trabalho  a  partir  de  temáticas  e  questões  relevantes  na  contemporaneidade. Entre os temas possíveis de serem abordados  estão: cultura popular dos povos originários, africana e afro-brasileira;  multiculturalidade; arte, novas mídias e tecnologias; arte e política;  preservação e valorização dos bens culturais; arte urbana, arte e meio- ambiente, relações de gênero, inclusão; intersecção da arte com outras  áreas; campos de formação e atuação profissional na área de arte.",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":57
  },
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"Educação Física 1",
    "Código":"CBTMEF1",
    "Tipo":"Obrigatório \/ Linguagens",
    "Núcleo":"NEC",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Não se aplica",
    "Grupos de Conhecimentos Essenciais":"Práticas da cultura corporal em contextos de saúde e exercício físico\/Educação  Física.  Práticas da cultura corporal em contextos econômicos, midiáticos e de  consumo\/Educação Física.  Práticas da cultura corporal em contextos lúdicos, juvenis e virtuais\/Educação  Física.  Práticas da cultura corporal e modos de vida\/Educação Física.  Práticas da cultura corporal enquanto fenômeno e patrimônio humano e  social\/Educação Física.",
    "Ementa":"Esta disciplina contribui para a formação de um sujeito crítico, reflexivo e com  autonomia para dialogar com as diferentes práticas corporais. Ao promover  experiências práticas e de reflexão, este componente curricular possibilita aos  estudantes uma leitura de mundo (de distintas óticas) que perpassa pelas  dimensões sociopolítica, econômica, artística, afetiva e motora dos elementos  da cultura corporal.",
    "Objetivos":"- Compreender que a disciplina de Educação Física, no espaço escolar, trabalha  com os diversos elementos da cultura corporal.  - Refletir e experienciar as práticas corporais oriundas de diferentes regiões do  Brasil e do mundo.  - Compreender os sistemas de jogos e realizar de forma prática as táticas em  esportes de invasão e de rede (individuais, coletivos e adaptados).  - Refletir sobre gênero e relações de poder em determinados jogos e esportes.  - Analisar os padrões estéticos de beleza e os elementos da cultura corporal  veiculados na mídia televisiva e nas redes sociais.  - Analisar a relação entre sedentarismo, atividade física, exercício físico e  esporte de alto rendimento, de modo a compreender o conceito ampliado de  saúde.  - Abordar e experienciar as potencialidades afetivas e estéticas do corpo e da  expressão artística e cultural.  - Possibilitar aos estudantes uma leitura de mundo (de distintas óticas) que  perpassa pela experiência prática e conceitual dos jogos, danças, lutas,  ginásticas e esportes. Nesse ínterim, busca-se analisar a dimensão sociopolítica  desses elementos da cultura corporal.  5 – CONTEÚDO PROGRAMÁTICO:    ▪  Jogos, brinquedos e brincadeiras.  - Jogos e brincadeiras de diferentes origens e culturas (africanas, indígenas,  europeias, asiáticas etc.).  - A ludicidade e a infância em diferentes regiões e períodos históricos.  - Os jogos eletrônicos e sua expansão na atualidade.  ▪  Esportes  - Sistemas de jogos e táticas de uma modalidade esportiva coletiva.  - Sistemas de jogos e táticas de uma modalidade esportiva individual.  - O autocuidado e o cuidado com o outro. O fairplay e os valores nas práticas  esportivas.  - Esporte e mídia: compreensão do fenômeno esportivo contemporâneo como  um espetáculo midiático.  - A (in)visibilidade feminina no esporte;  - Indústria cultural, publicidade e esporte.    ▪  Circo  - A história do circo: origens, modalidades e personagens.  - Acrobacias de solo, malabares, palhaçaria e improviso.  - As dificuldades de ser artista na sociedade contemporânea.    ▪  Imagem corporal e padrões de beleza  - Análise crítica dos estereótipos e dos padrões estéticos de beleza corporal.  - O corpo na mídia.  - Distúrbios alimentares e de comportamento.  - Anabolizantes e seus impactos nos homens e nas mulheres.  - Sedentarismo, atividade física, exercício físico, esporte de alto rendimento e  o conceito ampliado de saúde (benefícios e malefícios).",
    "Conteúdo Programático":"▪  Jogos, brinquedos e brincadeiras.  - Jogos e brincadeiras de diferentes origens e culturas (africanas, indígenas,  europeias, asiáticas etc.).  - A ludicidade e a infância em diferentes regiões e períodos históricos.  - Os jogos eletrônicos e sua expansão na atualidade.  ▪  Esportes  - Sistemas de jogos e táticas de uma modalidade esportiva coletiva.  - Sistemas de jogos e táticas de uma modalidade esportiva individual.  - O autocuidado e o cuidado com o outro. O fairplay e os valores nas práticas  esportivas.  - Esporte e mídia: compreensão do fenômeno esportivo contemporâneo como  um espetáculo midiático.  - A (in)visibilidade feminina no esporte;  - Indústria cultural, publicidade e esporte.    ▪  Circo  - A história do circo: origens, modalidades e personagens.  - Acrobacias de solo, malabares, palhaçaria e improviso.  - As dificuldades de ser artista na sociedade contemporânea.    ▪  Imagem corporal e padrões de beleza  - Análise crítica dos estereótipos e dos padrões estéticos de beleza corporal.  - O corpo na mídia.  - Distúrbios alimentares e de comportamento.  - Anabolizantes e seus impactos nos homens e nas mulheres.  - Sedentarismo, atividade física, exercício físico, esporte de alto rendimento e  o conceito ampliado de saúde (benefícios e malefícios).",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":57
  },
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"Língua Portuguesa 1",
    "Código":"CBTMPO1",
    "Tipo":"Obrigatório \/ Linguagens",
    "Núcleo":"NEC",
    "Número de docentes":"1",
    "Número de aulas semanais":"3",
    "Total de aulas":"114",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Língua, identidade e sociedade \/ Língua Portuguesa  Construção de sentido, leitura e produção de textos orais e escritos \/ Língua  Portuguesa  Linguagem, tecnologia e mundo do trabalho \/ Língua Portuguesa  História da Língua Portuguesa, gramática e sociedade \/ Língua Portuguesa  Literatura, história e cultura \/ Língua Portuguesa",
    "Ementa":"O componente curricular consiste em uma introdução ao estudo do português  como língua viva e dinâmica. Apresenta noções introdutórias sobre língua e  linguagem em suas concepções e dimensões cognitiva, social, cultural,  histórica, subjetiva e ideológica. Aborda aspectos linguístico-discursivos do  português brasileiro que permitem construir bases para o desenvolvimento da  prática de leitura e de produção de textos escritos, orais e multimodais, com  foco em textos do campo do narrar. Apresenta estudantes aos conhecimentos  introdutórios sobre literatura e suas manifestações em língua portuguesa,  incluindo, também em perspectiva comparativa, a brasileira, a portuguesa, a  indígena, a africana e a afro-brasileira, entre outras. Desenvolve procedimentos  básicos para as práticas de interpretação de textos literários escritos em língua  portuguesa, canônicos e não-canônicos. Inclui, entre seus temas, os direitos das  crianças e dos adolescentes; a prevenção de todas as formas de violência contra  a criança, o adolescente e a mulher; educação em direitos humanos; educação  digital.",
    "Objetivos":"• Desenvolver noções básicas sobre língua, linguagem e seu uso vivo e  dinâmico, tais como: oralidade, escrita, graus de formalidade, variação  linguística, entre outros;  • Compreender conceitos da fonética e da fonologia da língua portuguesa,  bem como de aspectos estruturais da língua tais como a concordância  nominal, e suas implicações para o uso;  • Conhecer aspectos fundamentais da expressão escrita, tais como a  pontuação e a ortografia;  • Desenvolver procedimentos para a produção de textos do campo do narrar,  articulando também elementos de diferentes linguagens e suportes;  • Compreender elementos básicos constituintes dos três grandes gêneros  literários e a circulação destes na contemporaneidade;  • Conhecer aspectos das literaturas de expressão em língua portuguesa de  diferentes países e povos (brasileira, portuguesa, africanas e indígenas, entre  outras), por meio de ferramentas da crítica literária, considerando seus  contextos de produção e seu diálogo com o presente;  • Ampliar repertório cultural por meio do estudo da literatura dos séculos XIII  ao XVI em língua portuguesa e sua relação com outras artes e seu contexto  histórico de produção.  5 – CONTEÚDO PROGRAMÁTICO:  1. Noções dos conceitos de língua, código, gramática, oralidade e escrita;  2. Noções dos conceitos de língua portuguesa, português brasileiro e o  português falado em outros países;  3. Relações entre o português e outras línguas e linguagens, reconhecendo a  diversidade linguística como patrimônio cultural e objeto de estudo;  4. Introdução à semântica: sinonímia, antonímia, hiponímia, hiperonímia,  polissemia e ambiguidade;  5. Teoria da comunicação e funções da linguagem;  6. Figuras de linguagem;  7. Formalidade e informalidade como um continuum na língua em seus  diferentes contextos;  8. Uso e análise contextualizados dos elementos linguístico-discursivos do  português brasileiro, relacionando-os, quando for o caso, com a variação  linguística e com as noções de grau de formalidade:  8.1. Textualidade, coesão e coerência  8.2. Pontuação  8.3. Concordância nominal, variação linguística e grau de formalidade  8.4. Noções de fonética no contexto do uso vivo e dinâmico da língua:  8.4.1. Sons, letras e classificação dos fonemas;  8.4.2. Sílabas e divisão silábica;  8.4.3. Encontros vocálicos e consonantais, dígrafos;  8.4.4. Ortografia e acentuação.  9. Produção e interpretação de textos do campo do narrar e da criação  artística, tais como: microconto, conto, fábula, esquete teatral, crônica  literária, poema, letra de música, videoclipe, slam, fanfiction, entre outros;  10. Introdução à leitura e produção de textos relacionados à esfera da  tecnologia e do trabalho;  11. Variação linguística e a natureza viva e dinâmica das línguas:  11.1.  Conceitos de norma padrão e variedades linguísticas: variedades  de prestígio, variedades estigmatizadas, relações de poder e definição  da norma;  11.2.  Variação linguística histórica;  11.3.  A língua portuguesa e o português brasileiro como práticas  sociais.  12. Introdução aos estudos literários: o que é literatura  13. Os grandes gêneros literários, suas características estruturais e suas  condições de produção e circulação contemporâneas: poesia, prosa e  drama;  14. Práticas de leitura, estudo e análise de obras literárias diversas;  15. Produção e circulação contemporâneas de literatura nas plataformas  digitais e cibercultura (por exemplo, blogs literários, fanfiction, entre outros);  16. Noções sobre o conceito de cânone literário e sua constituição sócio- histórica como espaço de conflito;  17. Obras e autores\/as representativos\/as de literaturas africanas, indígenas e  afro-brasileiras, bem como de movimentos literários populares e periféricos,  com foco no reconhecimento de valores e na apreciação estética da  produção;  18. Identificação de aspectos formais e linguísticos das obras literárias dos  diferentes gêneros e análise de sua contribuição para a construção do  sentido da obra;  19. Obras e autores representativos do Trovadorismo, do Humanismo e do  Classicismo;  20. O Renascimento e sua importância para as artes;  21. As condições de produção e circulação de textos literários escritos nos  períodos citados, bem como o papel das obras estudadas como expressão  de formas de pensamento e de realidades de diferentes épocas, locais,  gêneros, etnias e grupos sociais;  22. Literatura comparada como ferramenta para prática de leitura literária,  permitindo o estabelecimento de relações entre textos de diferentes  autores\/as, lugares, períodos, estilos, linguagens artísticas e gêneros  textuais;  23. Formas contemporâneas de fruição de obras literárias em diferentes  suportes e linguagens, visando também à reflexão sobre a alteridade e a  inclusão de pessoas com necessidades educacionais específicas (livros  impressos, audiolivros, adaptações em quadrinhos, vídeos e outros  suportes, entre outros).",
    "Conteúdo Programático":"73  1. Noções dos conceitos de língua, código, gramática, oralidade e escrita;  2. Noções dos conceitos de língua portuguesa, português brasileiro e o  português falado em outros países;  3. Relações entre o português e outras línguas e linguagens, reconhecendo a  diversidade linguística como patrimônio cultural e objeto de estudo;  4. Introdução à semântica: sinonímia, antonímia, hiponímia, hiperonímia,  polissemia e ambiguidade;  5. Teoria da comunicação e funções da linguagem;  6. Figuras de linguagem;  7. Formalidade e informalidade como um continuum na língua em seus  diferentes contextos;  8. Uso e análise contextualizados dos elementos linguístico-discursivos do  português brasileiro, relacionando-os, quando for o caso, com a variação  linguística e com as noções de grau de formalidade:  8.1. Textualidade, coesão e coerência  8.2. Pontuação  8.3. Concordância nominal, variação linguística e grau de formalidade  8.4. Noções de fonética no contexto do uso vivo e dinâmico da língua:  8.4.1. Sons, letras e classificação dos fonemas;  8.4.2. Sílabas e divisão silábica;  8.4.3. Encontros vocálicos e consonantais, dígrafos;  8.4.4. Ortografia e acentuação.  9. Produção e interpretação de textos do campo do narrar e da criação  artística, tais como: microconto, conto, fábula, esquete teatral, crônica  literária, poema, letra de música, videoclipe, slam, fanfiction, entre outros;  10. Introdução à leitura e produção de textos relacionados à esfera da  tecnologia e do trabalho;  11. Variação linguística e a natureza viva e dinâmica das línguas:  11.1.  Conceitos de norma padrão e variedades linguísticas: variedades  de prestígio, variedades estigmatizadas, relações de poder e definição  da norma;  11.2.  Variação linguística histórica;  11.3.  A língua portuguesa e o português brasileiro como práticas  sociais.  12. Introdução aos estudos literários: o que é literatura  13. Os grandes gêneros literários, suas características estruturais e suas  condições de produção e circulação contemporâneas: poesia, prosa e  drama;  14. Práticas de leitura, estudo e análise de obras literárias diversas;  15. Produção e circulação contemporâneas de literatura nas plataformas  digitais e cibercultura (por exemplo, blogs literários, fanfiction, entre outros);  16. Noções sobre o conceito de cânone literário e sua constituição sócio- histórica como espaço de conflito;  17. Obras e autores\/as representativos\/as de literaturas africanas, indígenas e  afro-brasileiras, bem como de movimentos literários populares e periféricos,  com foco no reconhecimento de valores e na apreciação estética da  produção;  18. Identificação de aspectos formais e linguísticos das obras literárias dos  diferentes gêneros e análise de sua contribuição para a construção do  sentido da obra;  19. Obras e autores representativos do Trovadorismo, do Humanismo e do  Classicismo;  20. O Renascimento e sua importância para as artes;  21. As condições de produção e circulação de textos literários escritos nos  períodos citados, bem como o papel das obras estudadas como expressão  de formas de pensamento e de realidades de diferentes épocas, locais,  gêneros, etnias e grupos sociais;  22. Literatura comparada como ferramenta para prática de leitura literária,  permitindo o estabelecimento de relações entre textos de diferentes  autores\/as, lugares, períodos, estilos, linguagens artísticas e gêneros  textuais;  23. Formas contemporâneas de fruição de obras literárias em diferentes  suportes e linguagens, visando também à reflexão sobre a alteridade e a  inclusão de pessoas com necessidades educacionais específicas (livros  impressos, audiolivros, adaptações em quadrinhos, vídeos e outros  suportes, entre outros).",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":85
  },
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"Língua Espanhola Iniciante",
    "Código":"CBTMES1",
    "Tipo":"Obrigatório \/ Linguagens",
    "Núcleo":"NEC",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Uso da língua\/Espanhol  Aspectos socioculturais\/Espanhol  Relações com o trabalho\/Espanhol",
    "Ementa":"O componente curricular aborda a Língua Espanhola através de atividades de  leitura, compreensão e interpretação para iniciar a construção de repertório  linguístico, literário e cultural dos aprendizes, considerando diferentes gêneros  textuais, orais e escritos. A competência comunicativa deve ser abordada em  contextos do mundo do trabalho, fundamentalmente, na área de Informática.  O conhecimento acerca da pluralidade linguístico-cultural dos povos  hispânicos é trabalhado de forma crítica.",
    "Objetivos":"77  • Conhecer a fonética e fonologia: sons do espanhol; aspectos contrastivos  entre sons do espanhol e do português;  • Estudar a morfologia: classe de palavras (artigo, numeral, substantivo,  adjetivo, advérbio, pronome, verbo e conjunção);  • Compreender a variação linguística: algumas diferenças regionais;  diferenças de léxico em diferentes países hispano-falantes; diferenças de  expressões informais de acordo com o contexto ou grupos sociais;  • Enfatizar a leitura e produção de textos descritivos;  • Desenvolver a comunicação em contextos profissionais de eventos culturais;  • Conhecer aspectos culturais relacionados à diversidade sociocultural dos  países hispano-falantes; costumes folclóricos e tradições orais.  5 – CONTEÚDO PROGRAMÁTICO:  1. Apresentação e identificação pessoal, descrição da casa, da família, do  trabalho, da cidade e país, de pessoas, lugares e objetos, dos hábitos no  presente, gostos e preferências;  2. Identificação de diferenças linguísticas básicas: morfossintáticas, lexicais e  fonológicas, que distinguem variedades do espanhol;  3. Pronúncia e regras de acentuação;  4. Estudo dos pronomes pessoais, dos pronomes oblíquos e das diferenças de  tratamento de distintas variedades do espanhol, formas e usos dos artigos;  dos demonstrativos; das preposições (para, a, en, hacia, hasta, de, desde);  dos possessivos; dos interrogativos; das estruturas comparativas e dos  superlativos;  5. Conjugação regular e irregular do Presente de Indicativo;  6. Verbos que expressam preferências, (Verbo Gustar);  7. Prática de compreensão e expressão oral e escrita a partir de diferentes  gêneros textuais que abordem o mundo do trabalho e contextos  multiculturais.",
    "Conteúdo Programático":"1. Apresentação e identificação pessoal, descrição da casa, da família, do  trabalho, da cidade e país, de pessoas, lugares e objetos, dos hábitos no  presente, gostos e preferências;  2. Identificação de diferenças linguísticas básicas: morfossintáticas, lexicais e  fonológicas, que distinguem variedades do espanhol;  3. Pronúncia e regras de acentuação;  4. Estudo dos pronomes pessoais, dos pronomes oblíquos e das diferenças de  tratamento de distintas variedades do espanhol, formas e usos dos artigos;  dos demonstrativos; das preposições (para, a, en, hacia, hasta, de, desde);  dos possessivos; dos interrogativos; das estruturas comparativas e dos  superlativos;  5. Conjugação regular e irregular do Presente de Indicativo;  6. Verbos que expressam preferências, (Verbo Gustar);  7. Prática de compreensão e expressão oral e escrita a partir de diferentes  gêneros textuais que abordem o mundo do trabalho e contextos  multiculturais.",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":57
  },
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"Língua Inglesa 1",
    "Código":"CBTMIN1",
    "Tipo":"Obrigatório \/ Linguagens",
    "Núcleo":"NEC",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Aspectos léxico-gramaticais\/Inglês  Práticas discursivas e textuais\/Inglês  Relações entre identidade, cultura e sociedade\/Inglês  Língua inglesa para a formação integral e cidadã no mundo do trabalho\/Inglês  Multiletramentos\/Inglês",
    "Ementa":"O componente curricular aborda os fundamentos da língua inglesa, de forma  contextualizada e integrada, para o desenvolvimento das competências  comunicativas em língua inglesa por meio de exercícios de leitura,  compreensão, interpretação e exploração de gramática em textos de caráter  geral. Busca, também, construir repertório linguístico e morfossintático para a  compreensão de diferentes tipos textuais, orais e escritos, e de situações de  interações por meio da língua inglesa. Busca, ainda, promover relação entre as  competências e habilidades do currículo ao mundo do trabalho.",
    "Objetivos":"• Explorar textos a partir da coesão, da forma e da coerência do pensamento;  • Estudar formas gramaticais que auxiliem o trabalho de leitura e  compreensão de textos;  • Desenvolver estratégias de leitura (títulos, ilustrações, diagramas, scanning  e skimming, inferência e repetições)  • Reconhecer marcadores do discurso;  • Deduzir o significado e uso de vocabulário não-familiar;  • Desenvolver estratégias de incorporação de vocabulário;  • Desenvolver atitudes de autoestima, autoconfiança e motivação;  • Desenvolver atitudes de pesquisa;  • Promover reflexão acerca da saúde e do meio ambiente (Temas  Contemporâneos Transversais).  5 – CONTEÚDO PROGRAMÁTICO:  1. Conhecimento gramatical:  1.1. Pronome Pessoal: sujeito \/ objeto;  1.2. Pronomes possessivos;  1.3. Pronomes relativos;  1.4. Adjetivos;  1.5. Advérbios;  1.6. Preposições;  1.7. Verbo To Be;  1.8. Pronomes interrogativos;  1.9. Presente Simples;  1.10.  Imperativo;  1.11.  Verbo modal: Can;  1.12.  Presente contínuo;  1.13.  Comparativos;  1.14.  Superlativos;  1.15.  Fonética e fonologia - aspectos gerais.  2. Vocabulário:  2.1. Palavras transparentes;  2.2. Grupos de palavras;  2.3. Formação de palavras;  2.4. Sinônimos;  2.5. Frases substantivas;  2.6. Marcadores de discurso;  2.7. Palavras compostas.",
    "Conteúdo Programático":"1. Conhecimento gramatical:  1.1. Pronome Pessoal: sujeito \/ objeto;  1.2. Pronomes possessivos;  1.3. Pronomes relativos;  1.4. Adjetivos;  1.5. Advérbios;  1.6. Preposições;  1.7. Verbo To Be;  1.8. Pronomes interrogativos;  1.9. Presente Simples;  1.10.  Imperativo;  1.11.  Verbo modal: Can;  1.12.  Presente contínuo;  1.13.  Comparativos;  1.14.  Superlativos;  1.15.  Fonética e fonologia - aspectos gerais.  2. Vocabulário:  2.1. Palavras transparentes;  2.2. Grupos de palavras;  2.3. Formação de palavras;  2.4. Sinônimos;  2.5. Frases substantivas;  2.6. Marcadores de discurso;  2.7. Palavras compostas.",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":57
  },
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"Matemática 1",
    "Código":"CBTMMA1",
    "Tipo":"Obrigatório \/ Matemática",
    "Núcleo":"NEC",
    "Número de docentes":"1",
    "Número de aulas semanais":"3",
    "Total de aulas":"114",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Números\/Matemática  Geometria\/Matemática  Álgebra\/Matemática  Grandezas e medidas\/Matemática",
    "Ementa":"Neste componente curricular, os estudantes têm a oportunidade de conhecer  a teoria dos conjuntos utilizando corretamente as notações, nomenclaturas e  propriedades, resolver operações entre conjuntos e problemas por meio  desses conceitos. Aprofunda-se o conhecimento sobre os conjuntos numéricos  utilizando as notações de intervalos para representar e operar com  subconjuntos dos números reais. Retomam-se os conceitos básicos de álgebra  de modo a obter maior destreza em manipulações e cálculos algébricos.  Conceitos de geometria são retomados e aprofundados em figuras planas  incluindo ângulos, classificação de polígonos com estudo aprofundado de  triângulos, quadriláteros e semelhança de figuras. Generalizam-se processos  de medição de comprimento e área, expressando os  resultados  adequadamente com unidades de medidas mais convenientes. Resolvem-se  problemas  de  geometria  métrica  envolvendo  relações  métricas  e  trigonométricas em triângulos. O estudo de função a partir da variação de  grandezas representada algébrica e graficamente evolui para o campo das  características, regularidades, simetrias, comportamento e gráficos com  aplicações de funções de 1º e 2º graus. Equações e inequações de 1º e 2º graus  são tratadas algebricamente e por meio de situações-problema.",
    "Objetivos":"• Reconhecer e utilizar a linguagem algébrica como a linguagem das ciências,  necessárias para expressar as relações entre grandezas e modelar situações- problema construindo modelos descritivos de fenômenos e permitindo  várias conexões dentro e fora da Matemática.  • Ler e interpretar diferentes linguagens e representações.  • Identificar regularidades e estabelecer relações.  • Utilizar e interpretar modelos para resolução de situações-problema que  envolvam medições, em especial o cálculo de distâncias inacessíveis.  • Identificar em dada situação-problema as informações ou variáveis  relevantes e elaborar possíveis estratégias para resolvê-la.  • Construir uma visão sistemática das diferentes linguagens e campos de  estudo da Matemática, estabelecendo conexões entre diferentes temas.  • Compreender o conhecimento tecnológico como resultado de uma  construção humana em um processo histórico e social.  5 – CONTEÚDO PROGRAMÁTICO:  1. Conjuntos e intervalos reais:  1.1. Conjuntos numéricos: propriedades, operações e representações.  1.2. Conjuntos: notação; operações; resolução de problemas.  1.3. Intervalos reais: representação; operações (união, diferença e  intersecção).  2. Álgebra:  2.1. Linguagem algébrica: símbolos e notações; caráter generalizador da  Álgebra.  2.2. Estudo de estruturas algébricas: produtos notáveis; fatoração;  simplificação.  2.3. Resoluções de Problemas: equações de 1º grau; equações de 2º grau;  sistemas de equações.  3. Geometria Plana:  3.1. Intuição: forma, tamanho e posição;  3.2. Segmentos de reta: congruência, medida e ponto médio;  3.3. Ângulos: conceito, unidades de medida (graus e radianos) e medição;  classificação.  3.4. Posições  relativas  entre  retas  (paralelas,  concorrentes  e  perpendiculares).  3.5. Polígonos: propriedades; classificação.  3.6. Quadriláteros: classificação, elementos e propriedades; inclusão  hierárquica.  3.7. Triângulos: propriedades; classificação segundo o tamanho dos lados e  ângulos; desigualdade triangular e semelhança de triângulos.  3.8. Circunferência e círculo: propriedades, partes do círculo, arcos e ângulos  na circunferência;  3.9. Semelhança de figuras: razão de semelhança, Teorema linear de Tales,  semelhança de triângulos e potência de ponto.  3.10.   Perímetro e área de figuras planas; relações entre unidades de  medidas de área.  4. Relações métricas e trigonométricas em triângulos:  4.1. Relações métricas e trigonométricas no triângulo retângulo.  5. Funções:  5.1. Plano cartesiano: identificação, localização e representação de pontos.  5.2. Padrões, regularidades e classificação.  5.3. Gráficos e leis de funções: relação entre funções e gráfico; análise de  sinal; crescimento e decrescimento; domínio e imagem.  5.4. Função como variação de grandezas.  5.5. Função composta.  5.6. Funções de 1º grau: características  e regularidades; leitura,  interpretação e construção de gráficos; estudo do sinal; resolução de  situações problema.  5.7. Funções de 2º grau: características  e regularidades; leitura,  interpretação e construção de gráficos; estudo do sinal; resolução de  situações problema.  5.8. Função inversa.  5.9. Simetria e funções.  5.10.  Inequações de 1º e 2º graus.",
    "Conteúdo Programático":"1. Conjuntos e intervalos reais:  1.1. Conjuntos numéricos: propriedades, operações e representações.  1.2. Conjuntos: notação; operações; resolução de problemas.  1.3. Intervalos reais: representação; operações (união, diferença e  intersecção).  2. Álgebra:  2.1. Linguagem algébrica: símbolos e notações; caráter generalizador da  Álgebra.  2.2. Estudo de estruturas algébricas: produtos notáveis; fatoração;  simplificação.  2.3. Resoluções de Problemas: equações de 1º grau; equações de 2º grau;  sistemas de equações.  3. Geometria Plana:  3.1. Intuição: forma, tamanho e posição;  3.2. Segmentos de reta: congruência, medida e ponto médio;  3.3. Ângulos: conceito, unidades de medida (graus e radianos) e medição;  classificação.  3.4. Posições  relativas  entre  retas  (paralelas,  concorrentes  e  perpendiculares).  3.5. Polígonos: propriedades; classificação.  3.6. Quadriláteros: classificação, elementos e propriedades; inclusão  hierárquica.  3.7. Triângulos: propriedades; classificação segundo o tamanho dos lados e  ângulos; desigualdade triangular e semelhança de triângulos.  3.8. Circunferência e círculo: propriedades, partes do círculo, arcos e ângulos  na circunferência;  3.9. Semelhança de figuras: razão de semelhança, Teorema linear de Tales,  semelhança de triângulos e potência de ponto.  3.10.   Perímetro e área de figuras planas; relações entre unidades de  medidas de área.  4. Relações métricas e trigonométricas em triângulos:  4.1. Relações métricas e trigonométricas no triângulo retângulo.  5. Funções:  5.1. Plano cartesiano: identificação, localização e representação de pontos.  5.2. Padrões, regularidades e classificação.  5.3. Gráficos e leis de funções: relação entre funções e gráfico; análise de  sinal; crescimento e decrescimento; domínio e imagem.  5.4. Função como variação de grandezas.  5.5. Função composta.  5.6. Funções de 1º grau: características  e regularidades; leitura,  interpretação e construção de gráficos; estudo do sinal; resolução de  situações problema.  5.7. Funções de 2º grau: características  e regularidades; leitura,  interpretação e construção de gráficos; estudo do sinal; resolução de  situações problema.  5.8. Função inversa.  5.9. Simetria e funções.  5.10.  Inequações de 1º e 2º graus.",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":85
  },
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"Biologia 1",
    "Código":"CBTMBI1",
    "Tipo":"Obrigatório \/ Ciências da Natureza",
    "Núcleo":"NEC",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Ciência e sociedade: aspectos históricos, filosóficos e sociológicos da ciência e  tecnologia na história da humanidade\/Biologia  Origem da vida e evolução: aspectos históricos, climáticos, geológicos e  evolutivos do planeta e sua inter-relação com o surgimento, evolução e  diversificação da vida\/Biologia  A unidade da vida: aspectos estruturais, morfofisiológicos, bioquímicos e  biofísicos das células\/Biologia",
    "Ementa":"O componente curricular desenvolve aspectos da origem da vida, dos seres  vivos, dos tipos de células, assim como o conhecimento dos tipos de tecidos  do corpo humano, da reprodução e da fecundação",
    "Objetivos":"88  • Compreender as diferenças entre biogênese e abiogênese e analisar as  características gerais dos seres vivos.  • Identificar a célula como unidade biológica e diferenciar células  procariontes de eucariontes.  • Analisar os tipos de tecidos que formam os seres vivos  • Conhecer as fases das divisões celulares mitose e meiose.  • Compreender o processo de fecundação e de desenvolvimento  embrionário  5 – CONTEÚDO PROGRAMÁTICO:  1. Origem da vida  2. Características gerais dos seres vivos  3. Tipos de células e tecidos  4. Divisão celular mitose e meiose  5. Fecundação e desenvolvimento embrionário",
    "Conteúdo Programático":"1. Origem da vida  2. Características gerais dos seres vivos  3. Tipos de células e tecidos  4. Divisão celular mitose e meiose  5. Fecundação e desenvolvimento embrionário",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":57
  },
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"Geografia 1",
    "Código":"CBTMGE1",
    "Tipo":"Obrigatório \/ Ciências Humanas",
    "Núcleo":"NEC",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Teorias, métodos e linguagens da Geografia\/Geografia  Dinâmicas da natureza\/Geografia  Questões ambientais\/Geografia",
    "Ementa":"Este componente curricular aborda noções preliminares da história da  Geografia como ciência e, princípios metodológicos; também dá ênfase a  dinâmicas da natureza da Terra e a relação sociedade-natureza. Aborda  também a educação ambiental.",
    "Objetivos":"• Compreender o objeto de estudo e análise da Geografia; bem como seus  conceitos-chaves e de modo introdutório conhecimentos em relação a  métodos e metodologias geográficas;  • Entender as diversas variantes da dinâmica da natureza, nas dimensões da  geomorfológica, climática, hidrológica e biogeográfica do planeta Terra e  de modo específico do Brasil;  • Assimilar as dinâmicas da natureza no âmbito das dinâmicas da sociedade,  principalmente no bojo do modo de produção capitalista.  5 – CONTEÚDO PROGRAMÁTICO:  1. Teoria, métodos e categorias geográficas;  2. A história do pensamento geográfico e conceitos-chave da geografia;  3. A Cartografia e a Geografia;  4. Elementos do Mapa geográfico;  5. Conhecimentos de Geomorfologia, da dinâmica da crosta terrestre à  exploração de minérios no Brasil e no mundo;  6. Climatologia geográfica, dinâmicas da natureza e mudanças climáticas, dos  fatores naturais aos socioeconômicos;  7. Hidrografia, o entendimento das bacias hidrográficas e a dinâmica  geográfica das águas;  8. Os domínios da natureza, diferenciações e associações das dinâmicas da  natureza;  9. Acordos e conferências ambientais, a dinâmica da natureza, geopolítica  global e dinâmica da sociedade.",
    "Conteúdo Programático":"1. Teoria, métodos e categorias geográficas;  2. A história do pensamento geográfico e conceitos-chave da geografia;  3. A Cartografia e a Geografia;  4. Elementos do Mapa geográfico;  5. Conhecimentos de Geomorfologia, da dinâmica da crosta terrestre à  exploração de minérios no Brasil e no mundo;  6. Climatologia geográfica, dinâmicas da natureza e mudanças climáticas, dos  fatores naturais aos socioeconômicos;  7. Hidrografia, o entendimento das bacias hidrográficas e a dinâmica  geográfica das águas;  8. Os domínios da natureza, diferenciações e associações das dinâmicas da  natureza;  9. Acordos e conferências ambientais, a dinâmica da natureza, geopolítica  global e dinâmica da sociedade.",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":57
  },
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"História 1",
    "Código":"CBTMHI1",
    "Tipo":"Obrigatório \/ Ciências Humanas",
    "Núcleo":"NEC",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Teorias e métodos do conhecimento histórico\/História  Antiguidade\/História  História medieval\/História",
    "Ementa":"O componente curricular aborda os conhecimentos essenciais da Ciência  Histórica, seus métodos e fundamentos teóricos.  Analisa, em termos empíricos, os aspectos fundamentais da vida humana na  Pré-História, bem como as primeiras grandes Civilizações da Antiguidade  Oriental e Africana (Egito).  Aborda as Civilizações da Antiguidade Clássica (Grécia, Roma), estabelecendo  as bases fundamentais para compreensão das atuais civilizações do ocidente.  Estuda a Europa Medieval, nascida das ruínas das grandes civilizações da  Antiguidade Clássica (Grécia e Roma), por sua centralidade, apresentando como  contraponto o desenvolvimento de outras civilizações em diferentes  continentes (Civilizações Islâmica, Chinesa, Africanas e da América Pré- Colombiana).",
    "Objetivos":"• Conhecer os princípios fundamentais da Ciência Histórica.  • Compreender as bases sociais, econômicas, políticas e culturais das  primeiras Civilizações Humanas, bem como o seu desenvolvimento ao longo  da História.  5 – CONTEÚDO PROGRAMÁTICO:  1. História e os seus Métodos  2. A Pré-História  3. A Mesopotâmia  4. A Civilização Egípcia e as Civilizações Africanas  5. As Civilizações Fenícia, Hebraica e Persa  6. A Civilização Grega  7. A Civilização Romana  8. A Europa Medieval  9. A Civilização Islâmica  10. A Civilização Chinesa  11. Os Povos Pré-Colombianos da América",
    "Conteúdo Programático":"1. História e os seus Métodos  2. A Pré-História  3. A Mesopotâmia  4. A Civilização Egípcia e as Civilizações Africanas  5. As Civilizações Fenícia, Hebraica e Persa  6. A Civilização Grega  7. A Civilização Romana  8. A Europa Medieval  9. A Civilização Islâmica  10. A Civilização Chinesa  11. Os Povos Pré-Colombianos da América",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":57
  },
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"Sistemas Computacionais 1",
    "Código":"CBTISC1",
    "Tipo":"Obrigatória\/Técnica",
    "Núcleo":"NET",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Fundamentos de Informática\/ Informática  Infraestrutura (hardware, sistemas operacionais, redes de computadores,  segurança)\/ Informática",
    "Ementa":"O componente curricular aborda elementos fundamentais da computação,  trabalhando os conceitos de arquitetura de um computador em termos de seus  componentes  (processador,  memória  primária,  memória  secundária,  dispositivos de entrada e de saída) e de sistemas operacionais (MS-DOS,  Windows, noções básicas de Linux).",
    "Objetivos":"•  Identificar os componentes dos computadores e seus periféricos,  analisando o funcionamento e o relacionamento entre eles;  •  Analisar os serviços e funções de sistemas operacionais utilizando suas  ferramentas e recursos em atividades de configuração, manipulação de  arquivos, segurança e outras;  •  Organizar atividades de Entrada e Saída de dados e sistemas de  comunicação;  •  Selecionar o Sistema Operacional de acordo com as necessidades do  usuário;  •  Distinguir as arquiteturas e topologia de rede;  •  Conhecer a infraestrutura de redes fisicamente e logicamente;  •  Conhecer e compreender os sistemas numéricos de base decimal,  binária e hexadecimal e sua relação com a representação de dados e  instruções nos computadores.  •  Aplicar e utilizar as estratégias de leitura na língua inglesa;  •  Prestar assistência técnica aos usuários em equipamentos e programas;  Prestar assistência aos usuários no uso dos programas aplicativos instalados.    5 – ÁREAS DE INTEGRAÇÃO:  Não se aplica.  6 – CONTEÚDO PROGRAMÁTICO:  •  Arquitetura básica de um computador: memórias, processadores e  dispositivos de E\/S;  •  Sistemas numéricos decimal, binário e hexadecimal e a representação de  dados e instruções em um computador.  •  Definição de sistema operacional, software utilitário e software  aplicativo;  •  Interface de linha de comando e interface gráfica;  •  Arquiteturas de sistemas operacionais;  •  Ms-DOS;  •  Evolução da Família Windows (desktop e servidores);  •  Operação do Sistema Operacional Windows;  •  Tipos de partições NTFS e FAT;  Recursos de rede e segurança.",
    "Conteúdo Programático":"•  Arquitetura básica de um computador: memórias, processadores e  dispositivos de E\/S;  •  Sistemas numéricos decimal, binário e hexadecimal e a representação de  dados e instruções em um computador.  •  Definição de sistema operacional, software utilitário e software  aplicativo;  •  Interface de linha de comando e interface gráfica;  •  Arquiteturas de sistemas operacionais;  •  Ms-DOS;  •  Evolução da Família Windows (desktop e servidores);  •  Operação do Sistema Operacional Windows;  •  Tipos de partições NTFS e FAT;  Recursos de rede e segurança.",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":57
  },
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"Algoritmos",
    "Código":"CBTIALG",
    "Tipo":"Obrigatória\/Técnica",
    "Núcleo":"NET",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Fundamentos de Informática\/Informática  Algoritmos e Linguagens de Programação\/Informática",
    "Ementa":"O Componente Curricular apresenta noções básicas sobre processamento de  dados, tipos de dados, definição de variáveis, operadores aritméticos, estruturas  de decisão, estruturas de repetição, utilização de variáveis indexadas,  classificação e ordenação de dados e modularização (técnicas de programação  com sub-rotinas).",
    "Objetivos":"•  Conhecer os conceitos básicos do desenvolvimento de programas em  nível lógico;  •  Resolver problemas computacionais (também em nível lógico) com uma  visão sistêmica;  •  Interpretar e solucionar problemas básicos por meio de lógica de  programação de computadores;  •  Utilizar a ferramenta Microsoft Visio para apresentar os fluxogramas que  representam as soluções lógicas.    5 – ÁREAS DE INTEGRAÇÃO:  Não se aplica.  6 – CONTEÚDO PROGRAMÁTICO:  •  Histórico, apresentação, principais aplicações da linguagem;  •  Linguagem de programação: características gerais;  •  Estruturas dos programas e definição de lógica de programação;  •  Tipos de dados;  •  Variáveis inteiras e variáveis reais;  •  Variáveis literais e operações com literais;  •  Operadores aritméticos e expressões aritméticas e sua hierarquia de  cálculo;  •  Estruturas lógicas (operadores lógicos e relacionais);  •  Decisão lógica;  •  Decisão encadeada;  •  Estrutura de decisão múltipla;  •  Estruturas de repetição;  •  Programação modular;  •  Módulos e sub-rotinas de programas;  •  Variáveis indexadas;  •  Variáveis indexadas com um único índice (vetores);  •  Tipos de vetores;  •  Definição e utilização de estruturas de repetição com vetores;  •  Matrizes;  •  Definição e utilização de matriz com até três dimensões (três índices);  •  Tipos de matrizes.",
    "Conteúdo Programático":"•  Histórico, apresentação, principais aplicações da linguagem;  •  Linguagem de programação: características gerais;  •  Estruturas dos programas e definição de lógica de programação;  •  Tipos de dados;  •  Variáveis inteiras e variáveis reais;  •  Variáveis literais e operações com literais;  •  Operadores aritméticos e expressões aritméticas e sua hierarquia de  cálculo;  •  Estruturas lógicas (operadores lógicos e relacionais);  •  Decisão lógica;  •  Decisão encadeada;  •  Estrutura de decisão múltipla;  •  Estruturas de repetição;  •  Programação modular;  •  Módulos e sub-rotinas de programas;  •  Variáveis indexadas;  •  Variáveis indexadas com um único índice (vetores);  •  Tipos de vetores;  •  Definição e utilização de estruturas de repetição com vetores;  •  Matrizes;  •  Definição e utilização de matriz com até três dimensões (três índices);  •  Tipos de matrizes.",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":57
  },
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"Linguagem de Programação 1",
    "Código":"CBTILP1",
    "Tipo":"Obrigatória\/Técnica",
    "Núcleo":"NET",
    "Número de docentes":"1",
    "Número de aulas semanais":"3",
    "Total de aulas":"114",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Algoritmos e linguagens de programação\/Informática",
    "Ementa":"O Componente Curricular aborda temas como: Histórico da linguagem de  programação; Conceitos iniciais de programação; Procedimentos básicos de  Entrada\/Saída em modo console. Trabalha com atividades que utilizam decisão  lógica e estruturas de repetição, além de desenvolver programas com estruturas  de armazenamento de dados em memória através de vetores e matrizes. Além  disso, estuda formas classificação e ordenação de dados e aborda a  programação estruturada.  TÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO",
    "Objetivos":"• Esclarecer e utilizar os conceitos básicos da linguagem de programação.  • Resolver problemas computacionais com uma visão sistêmica,  desenvolvendo programas;  • Aprender e utilizar as técnicas de programação modular e estruturada;  • Criar e utilizar sub-rotinas e módulos de programação.  • Interpretar e solucionar problemas básicos por meio de programação de  computadores em modo “Console”.    5 – ÁREAS DE INTEGRAÇÃO:  Não se aplica.  6 – CONTEÚDO PROGRAMÁTICO:  •  Linguagem de programação: características gerais, estruturas dos  programas e tipos de dados  •  Ambiente de programação  •  Estrutura Sequencial: declaração de variáveis e tipos de dados  •  Entrada e saída de dados  •  Estrutura sequencial: atribuição de valores às variáveis  •  Expressões aritméticas: operadores e precedências  •  Expressões relacionais: operadores e precedências  •  Expressões lógicas: operadores e precedências  •  Estrutura condicional (Decisão)  •  Seleção Múltipla  •  Estruturas de repetição  •  Vetores: índices - unidimensionais  •  Matrizes: tabelas - bidimensionais  •  Classificação e ordenação de dados  •  Modularidade: Procedimentos  •  Modularidade: Passagem de Parâmetros por valor  •  Modularidade: Passagem de Parâmetros por referência  •  Modularidade: Recursividade  TÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO",
    "Conteúdo Programático":"•  Linguagem de programação: características gerais, estruturas dos  programas e tipos de dados  •  Ambiente de programação  •  Estrutura Sequencial: declaração de variáveis e tipos de dados  •  Entrada e saída de dados  •  Estrutura sequencial: atribuição de valores às variáveis  •  Expressões aritméticas: operadores e precedências  •  Expressões relacionais: operadores e precedências  •  Expressões lógicas: operadores e precedências  •  Estrutura condicional (Decisão)  •  Seleção Múltipla  •  Estruturas de repetição  •  Vetores: índices - unidimensionais  •  Matrizes: tabelas - bidimensionais  •  Classificação e ordenação de dados  •  Modularidade: Procedimentos  •  Modularidade: Passagem de Parâmetros por valor  •  Modularidade: Passagem de Parâmetros por referência  •  Modularidade: Recursividade  TÉCNICO EM INFORMÁTICA INTEGRADO AO ENSINO MÉDIO",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":85
  },
  {
    "Curso":"Técnico em Informática Integrado ao Ensino Médio",
    "Componente curricular":"Prática de Laboratório 1",
    "Código":"CBTIPL1",
    "Tipo":"Obrigatória\/Técnica",
    "Núcleo":"NET",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Não informado",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Algoritmos e linguagens de programação\/Informática",
    "Ementa":"O componente curricular aborda conceitos de desenvolvimento de páginas  para internet, através do estudo da estruturação de uma página da internet,  navegadores, linguagem de desenvolvimento (html) e suas várias tags de  marcação e formatação. Apresenta ainda noções estéticas para a construção de  páginas atrativas aos usuários.",
    "Objetivos":"•  Utilizar os conceitos de desenvolvimento de aplicações em linguagem  própria para a internet;  •  Identificar e elaborar aplicações para internet com planejamento e  estrutura de organização;  •  Tratar dados através de transferência com o uso de aplicativos  desenvolvidos para esta finalidade através do uso da internet.  5 – ÁREAS DE INTEGRAÇÃO:  Não se aplica.  6 – CONTEÚDO PROGRAMÁTICO:  •  Conceito e Estrutura do HTML\/XHTML;  •  Formatação básica;  •  Conceito e Estruturas de Listas;  •  Conceito e Estruturas de Frames;  •  Conceito e Estruturas de Tabelas;  •  Conceito e Estruturas de Formulários;  •  Conceitos e funções em Java Script;  •  Criação e programação de Formulários Interativos em Scripts.",
    "Conteúdo Programático":"•  Conceito e Estrutura do HTML\/XHTML;  •  Formatação básica;  •  Conceito e Estruturas de Listas;  •  Conceito e Estruturas de Frames;  •  Conceito e Estruturas de Tabelas;  •  Conceito e Estruturas de Formulários;  •  Conceitos e funções em Java Script;  •  Criação e programação de Formulários Interativos em Scripts.",
    "original_source_pdf":"2022_PPC_EM_Tec_Informatica.pdf",
    "Período Educacional":"1º Ano",
    "Carga Horária Total":57
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Turismo e Hospitalidade.",
    "Código":"THOT1.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular trabalha os elementos básicos para compreender a  hospitalidade e sua relação com o fenômeno turístico, em seus domínios doméstico,  público e comercial, de modo a possibilitar ao aprendiz uma visão sistêmica da integração  de tais esferas da hospitalidade e o turismo.",
    "Objetivos":"Reconhecer a importância da hospitalidade para o turismo.  Diferenciar as teorias explicativas da hospitalidade numa perspectiva histórica.  Enunciar os principais conceitos relativos ao estudo do significado da hospitalidade.  Distinguir os fatores intervenientes da hospitalidade no turismo, bem como os principais  determinantes de sua evolução.  Interpretar a evolução e a complexidade da hospitalidade no Brasil e no mundo.",
    "Conteúdo Programático":"Conceitos e definições de hospitalidade.  A visão histórica.  A influência cultural nas práticas de hospitalidade.  Hospitalidade – para um entendimento teórico:  ● A hospitalidade no domínio social.  ● A hospitalidade no domínio privado.  ● A hospitalidade no domínio comercial.  ● A hospitalidade como fator preponderante para turismo.  ● A atmosfera das cidades e a hospitalidade e a qualidade devida.  ● A hospitalidade doméstica e comercial.  ● A hospitalidade e os serviços.  Tendências e perspectivas da hospitalidade para o século XXI.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":57
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Teoria Geral do Turismo",
    "Código":"TGTT1.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"5",
    "Total de aulas":"95",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular desenvolve aspectos relacionados ao turismo enquanto  fenômeno e objeto de estudo relevante na contemporaneidade, permitindo identificar seu  caráter sistêmico e interdisciplinar, servindo assim como base para a compreensão dos  temas específicos abordados ao longo das demais disciplinas do curso.",
    "Objetivos":"Identificar e dimensionar o fenômeno turístico e sua teoria.  Estudar os principais fatos históricos relacionados à atividade turística, seus  aspectos conceituais epistemológicos.  Abordar os componentes estruturais, organizacionais, operacionais e ambientais do  Turismo, com especial atenção aos aspectos que compõem a sua cadeia produtiva.  Apresentar o mercado e seus componentes, oferta turística e demanda turística, bem como  estudar e analisar suas características.  Identificar os elementos e entender a dinâmica dos processos que dimensionam o turismo,  proporcionando uma visão holística deste fenômeno.  Entender a complexidade da atividade turística em todos os seus aspectos, seja por meio  de seus impactos causados, pela estrutura demandada ou pelas instituições, públicas,  privadas ou de terceiro setor, envolvidas.  Estudar as formas como a atividade turística pode estar estruturada.  Analisar as tendências futuras da atividade turística em todos os seus aspectos.  Discutir definições e conceitos básicos que auxiliam na compreensão do turismo, nos seus  aspectos ontológicos, epistemológicos e práticos à luz de autores que discutem as  transformações do fenômeno turístico no tempo e no espaço.  Apresentar as principais correntes de pensamento dos autores referendados da área de  turismo de forma a estimular a capacidade do aluno para a análise e caracterização das  diferentes práticas e suas consequências.  Proporcionar ao aluno o conhecimento da terminologia técnica do turismo.  Identificar os elementos fundamentais do sistema e entender a dinâmica dos processos  que dimensionam o turismo, proporcionando uma visão holística deste fenômeno.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022",
    "Conteúdo Programático":"1 Fundamentos históricos do Turismo (origem evolução).  2 O que é turismo: conceitos básicos etiologia:  Definições Técnicas do Turismo  Indústria de Turismo? Atividade Turística? Setor de Turismo?  Classificação - Visitante X Excursionista X Turista  Tipologia, Formas e Modalidades  3 Turismo internacional, nacional e regional.  4 A interdisciplinaridade e o relacionamento direto com outras ciências.  5 Sistur. Componentes da produção do turismo: mercados turísticos, estudo da demanda  (Demanda Real; Efetiva; Reprimida) e da oferta (oferta primordial (e\/ou primária), oferta  complementar (e\/ou secundária e\/ou agregada)).  6 O turismo como fenômeno social e atividade econômica: turismo como atividade  impactante (Físico, Econômico, Sociocultural)  7 O papel do setor público no Turismo.  8 O profissional de Turismo: Regulamentação Profissional e áreas de atuação.  9 Turismo, dentro do setor terciário, identificando-o como atividade de prestação de  serviços.  10 Turismo: cenários, tendências, e os efeitos da globalização. O futuro do turismo no  terceiro milênio.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":71
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Fundamentos do lazer, entretenimento e recreação",
    "Código":"FLET1.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular Fundamentos do Lazer, Entretenimento e Recreação trata  do conceito de sociologia do lazer, dos métodos e técnicas de recreação utilizados no  turismo, do perfil e funções do animador, das atividades de recreação aplicáveis em  diferentes equipamentos, meios de hospedagem e meios de transporte turísticos, em  diferentes faixas etárias, bem como do funcionamento, organização e planejamento de uma  empresa de recreação e da identificação e implementação de projetos.",
    "Objetivos":"Desenvolver o espírito criativo na elaboração de projetos de recreação turística.  Posicionar o lazer e a recreação como um estudo interdisciplinar, possibilitando uma visão  crítica por meio de subsídios fornecidos pela ciência do Comportamento.  Analisar o desempenho tecnológico, industrial e urbano da sociedade moderna,  relacionando-o com a dinâmica do lazer e da recreação.  Demonstrar a gama de atividades e equipamentos que envolvem o fenômeno, bem como  as oportunidades profissionais no mercado de trabalho.  Levar o aluno a uma reflexão crítica acerca do aproveitamento dos espaços e do tempo livre  para o desenvolvimento de atividades lúdicas como ferramenta educacional.",
    "Conteúdo Programático":"1 Embasamento teórico sobre sociologia do lazer.  2 Atividades em locais fechados, em hotéis, fazendas e pousadas e em  navios e aeronaves.  3 Recreação em ônibus de turismo.  4 Gincanas recreativas.  5 Atividades com danças regionais e Sul-americanas.  6 Brincadeiras com bolas.  7 Jogos Cooperativos recreativos.  8 Atividades recreativas para crianças \/ jovens \/ adultos \/ idosos \/ LGBTQIAP+\/  deficientes \/ outros.  9 Noções de Primeiros Socorros.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Técnicas de Comunicação Oral e Escrita",
    "Código":"TCOT1.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular Técnicas de Comunicação Oral e Escrita refere-se à  conceituação de elementos da comunicação, ao reconhecimento e produção de textos orais  e escritos que visem a habilitar o estudante a se expressar por escrito e oralmente de forma  clara e coerente de acordo com a exigência de sua área profissional.",
    "Objetivos":"Conceituar os elementos da comunicação.  Reconhecer os níveis de linguagem e os diferentes tipos de textos em prosa.  Produzir textos dissertativos, resumos, resenhas e artigos científicos.  Redigir com correção, obedecendo as normas da norma culta.  Expressar-se oralmente com desenvoltura.  Habilitar o aluno a compreender, organizar e produzir textos, tanto escritos quanto  orais, de modo claro, coerente, objetivo e completo, de natureza acadêmica e de  acordo com a exigência específica de sua área profissional.",
    "Conteúdo Programático":"1 Conceitos de teoria da comunicação.  2 Tipologia textual (textos em prosa, dissertativos).  3 A comunicação oral: aspectos gerais, postura de voz e postura corporal na apresentação  em público.  4 Técnicas de argumentação e de apresentação.  5 Revisão de gramática normativa: ortografia, regência e concordância.  6 Variações da língua portuguesa: modalidades diferentes.  7 A comunicação técnica e científica.  8 Noções sobre artigo científico.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Informática Básica para Turismo",
    "Código":"INFT1.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular pretende apresentar ao discentes noções básicas de  informática, de modo que o aluno compreenda a relevância do domínio de ferramentas  como sistemas operacionais, editores de texto, editor de planilhas, editor de apresentações  gráficas e formulários.",
    "Objetivos":"Aprender a utilizar as ferramentas básicas do sistema operacional Windows.  Aprender a utilizar recursos do editor de texto.  Aprender a utilizar recursos do Excel.  Aprender a utilizar recursos do Powerpoint.  Arquitetura geral de computadores.  Técnicas de utilização de meios informatizados.  Funções e ferramentas básicas do sistema operacional.  Operação de programas de computador (processadores gráficos e de texto, planilhas,  Aplicativos de Apresentação).  Editoração eletrônica de textos, relatórios, formulários, esquemas, gráficos e planilhas.",
    "Conteúdo Programático":"1 Conceitos básicos de hardware e software.  2 Introdução ao conceito de sistema operacional; estrutura básica e ferramentas do  sistema operacional Windows.  3 Introdução ao editor de texto: Apresentação de novidades, conhecendo o editor de  texto, atalhos, salvando e abrindo, arquivos, imprimindo um arquivo. Criação de folhetos  e folders.  4 Criação e formatação de textos.  5 Inserção de tabelas, imagens, objetos, cabeçalho, rodapé e legendas. Mala direta,  mescla de dados, verificação automática de erros e mapeamento de um campo de mala  direta.  6 Criação de layout de página: aplicação de temas de fonte e cor pré-definidos e  personalizados.  7 Alteração de margens, trabalho com colunas e seções; inserção e remoção de marca  d’água  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  8 \/Ajuste de recuos, tabulação e espaçamento entre parágrafos.  9 Introdução ao Excel – Apresentação do Excel \/Formatação de planilhas; referência  de célula (linha e coluna).  10 Exploração das guias de opções de menu; iniciação do Excel, procedimentos de  trabalho, desfazer erros, remoção ou cópia com atalhos, salvar e abrir arquivos,  imprimir arquivos.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Psicologia aplicada ao turismo",
    "Código":"PSIT1.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular “Psicologia Aplicada ao Turismo” trata da Psicologia como  ferramenta auxiliadora no desenvolvimento pessoal e profissional, apresentando as  características da personalidade que influenciam na comunicação interpessoal e no  processo de socialização no trabalho. Aborda a importância do aprimoramento das relações  humanas no contexto organizacional, criando subsídios para lidar com a motivação, com a  liderança, de modo a favorecer a tomada de decisões e a resolução de conflitos no exercício  profissional.",
    "Objetivos":"Proporcionar ao aluno o conhecimento sobre os conceitos principais de Psicologia e  capacitá-los a utilizar tais conhecimentos em sua prática profissional.  Familiarizar o aluno com os processos básicos do comportamento humano, possibilitando- o realizar uma reflexão sobre si próprio enquanto indivíduo e aprendiz, bem como aplicar  esse conhecimento em sua prática profissional na área do Turismo.  Capacitar o educando a reconhecer a importância das variáveis psicológicas para a  compreensão do comportamento do indivíduo nas organizações e no mercado turístico.  Compreender os aspectos psicológicos relacionados à prática profissional.  Capacitar os alunos à compreensão de uma dinâmica comportamental enquanto  patrocinadores do Turismo.  Dar base para os alunos em sua prática profissional lidar com conflitos interpessoais.  Melhorar a comunicação nas relações interpessoais e intrapessoal.",
    "Conteúdo Programático":"Unidade I: Introdução à Psicologia  1 Conceitos em Psicologia  2 História da Psicologia e seus objetivos  3 Princípios das Relações Humanas  4 Alguns conceitos da Psicologia aplicados ao curso de Turismo.  Unidade II: Principais Abordagens da Psicologia:  5 Abordagem Psicodinâmica: a Psicanálise e sua importância no curso de Turismo  6 Abordagem Behaviorista  7 Abordagem Cognitiva: a teoria da Gestalt ou teoria da forma  8 Abordagem Humanista  Unidade III: Comportamento individual  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  9 Diferenças individuais – personalidade e turismo  10 Distúrbios psicológicos  11 Inteligência Emocional  12 Comportamento do consumidor (turista) e o atendimento ao cliente",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Metodologia do Trabalho Científico.",
    "Código":"MTCT1.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"A disciplina se ocupa de conteúdos referentes ao desenvolvimento do pensamento e  da pesquisa científica; da identificação e caracterização dos diferentes tipos de pesquisa e  seus métodos de investigação; da análise das correntes metodológicas e seus  pressupostos teóricos; das normas de elaboração e apresentação de trabalhos científicos  segundo a ABNT e APA.",
    "Objetivos":"Permitir ao aluno domínio sobre conceitos básicos para o desenvolvimento de pesquisa com  a utilização das normas metodológicas da ABNT para a elaboração de trabalhos  acadêmicos.  Contribuir para que o aluno conheça os principais métodos e metodologias empregadas na  investigação científica e no desenvolvimento tecnológico.  Estimular a realização de pesquisas e experimentos científicos na área de Turismo.  Viabilizar a expressão formal dos resultados da pesquisa dentro de normas vigentes para o  desenvolvimento do trabalho monográfico.",
    "Conteúdo Programático":"Unidade I  1 Apresentação gráfica dos trabalhos científicos: Capa e folha de rosto; outros elementos  pré-textuais; Introdução; Desenvolvimento; Conclusão (Considerações finais).  2 Elementos pós-textuais; Fontes; Bibliografia.  Unidade II –  3 Tipos (caracterização) de pesquisas: Pesquisa documental e bibliográfica  4 Uso de biblioteca e documentação; Repertórios bibliográficos: obras de referência e  material específico; Formas de procura bibliográfica na Internet; Procedimentos de coleta;  Fontes de informação.  Unidade III –  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  5 Elaboração e Apresentação de Projeto de Pesquisa e Trabalho Monográfico: Definição  do tema; Problemática e pergunta de partida; Objetivos: gerais e específicos; Justificativa;  Revisão bibliográfica; Fontes; Metodologia; Recursos;  6 Normalização de referências bibliográficas (documentos eletrônicos e bibliográficos);  Bibliografia; principais periódicos científicos relacionados à área de Turismo.  7 Utilização do Power Point para apresentação de trabalhos acadêmicos; Estratégias para  fazer uma boa apresentação oral.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Ética e Responsabilidade Social",
    "Código":"ERST1.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular visa a proporcionar situações que, ao expor o aluno a regras  e diretrizes fundamentais para o desempenho profissional pautado na ética e na cidadania,  lhe permitam, também, adquirir conhecimentos, desenvolver habilidades para o  relacionamento harmonioso com o meio em que está inserido e transformar e fortalecer o  seu senso crítico, tornando-se um indivíduo atuante na sociedade.",
    "Objetivos":"Levar o aluno à compreensão da Ética, aplicando-a a sua vida contribuindo de forma  significativa para uma sociedade melhor.  Compreender a relação entre a ética contemporânea e a cidadania.  Desenvolver reflexões acerca do exercício da ética dentro do seu universo.  Oferecer ao aluno uma base no que tange à Responsabilidade Social que o permitirá  dimensionar a sua importância e a sua aplicação no seu universo.",
    "Conteúdo Programático":"1 Fundamentos da Ética Empresarial Conceitos básicos:  2 Ética, Moral, Caráter, Dever Moral, Relativismo ético.  3 Direitos Humanos.  4 Empresa e Ética: o caráter das organizações.  5 As Três fases da Ética Empresarial: A era Industrial; A era pós-industrial; A era da  informação.  6 Ética Ambiental:  7 Ecologia.  8 A escassez dos Recursos Naturais.  9 A Ação predatória do Homem e a Educação ambiental.  10 O dilema dos Valores:  11 Os desastres ambientais.  12 A complexidade das decisões.  13 As empresas e os valores  14 Normas Internacionais de Responsabilidade Social:  15 Política de Responsabilidade Social em uma empresa:  ISO 14.000, NBR 16000 SA 8000 e OHSA.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  16 O Terceiro Setor e a importância do Balanço Social:   17 O Terceiro Setor Balanço Social e a sua importância.   18 Criação de Projetos Éticos Sociais.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Gestão administrativa e financeira do turismo",
    "Código":"GATT2.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"5",
    "Total de aulas":"95",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Este componente curricular visa a possibilitar ao aluno o entendimento dos princípios  gerais da administração, do desenvolvimento das organizações e da função financeira,  assim como as diferentes funções e tipos de administração, de modo a permitir  correlacionar os conceitos de administração, orçamento e investimento de capital à  atividade turística.",
    "Objetivos":"Tornar o aluno capaz de analisar princípios, técnicas ou ideias relacionadas à  administração e às organizações, de forma que ele possa aplicá-los com eficiência e  eficácia, conforme as particularidades da atividade turística, de forma ética e com  responsabilidade econômica, social e ambiental.  Proporcionar entendimento de conceitos e fundamentos básicos para o desempenho  das funções financeiras.",
    "Conteúdo Programático":"1 Fundamentos da Administração: As empresas e o conceito de Administração; As  organizações e seus níveis; os recursos das empresas.  2 O processo administrativo: Planejamento; Organização; Direção; Controle.  3 Áreas funcionais da Administração: Operações; Marketing; Recursos Humanos  4 Finanças como área de estudo: A função da administração financeira; O ambiente  operacional da empresa; Instituições financeiras e mercados: uma visão geral; Taxas de  juros e retornos requeridos  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  5 Demonstrações financeiras básicas: Balanço patrimonial; Demonstração de resultados  do exercício; Uso de índices financeiros; Análise de liquidez; Análise de endividamento;  Análise de rentabilidade; Análise de atividade  6 Diagramas de fluxo de caixa: Valor futuro; Valor presente; Valor futuro de uma  anuidade; Valor presente de uma anuidade; Perpetuidades; Períodos de capitalização e  comparação de diferentes tipos de taxas de juros  7 Gestão financeira de curto prazo: Políticas alternativas de investimento quanto aos  ativos circulantes; Administração de disponíveis; Administração de contas a receber e  estoques; Fontes de financiamento de curto prazo  8 Análise de investimentos: O processo de decisão na análise de investimentos; Cálculo  do investimento inicial;Cálculo das entradas de caixa operacionais; Técnicas de análise;  Período de payback; Valor presente líquido; Taxa interna de retorno.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"2º Semestre",
    "Carga Horária Total":71
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Inglês Instrumental I.",
    "Código":"INGT2.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Possibilitar ao aluno a comunicação na sua área de atuação, capacitando-o a se  expressar na forma escrita e especialmente falada para que possa se comunicar com  turistas e pessoas relacionadas à sua área. Ampliar seu universo, habilitando-o ao acesso  a informações via Internet e publicações em inglês.",
    "Objetivos":"Introdução de estruturas básicas do idioma bem como sua aplicação em pequenos diálogos,  como falar sobre pratos e bebidas, fazer pedidos em restaurantes, pegar pedidos por  telefones, fazer reservas em restaurantes ou hotéis.  Possibilitar ao aluno a comunicação na sua área de atuação, capacitando-o a se expressar  na forma escrita e especialmente falada para que possa se comunicar com turistas e  pessoas relacionadas à sua área.  Ampliar seu universo habilitando-o ao acesso a informações via Internet e publicações em  inglês.",
    "Conteúdo Programático":"Simple present, imperative, question words, present continuous.  Simple future, adverbs of frequency, possessive adjectives and pronouns, sequence  markers, definite and indefinite pronouns",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"2º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Sociologia aplicada no Turismo",
    "Código":"SOCT2.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular visa a fundamentar a prática reflexiva do aluno no âmbito  geral das ciências sociais, abordando os paradigmas teóricos necessários à compreensão  da realidade sociopolítica brasileira e mundial de modo a permitir ao aluno a compreensão  dos fenômenos relacionados à prática do turismo e do lazer pelo ângulo das ciências  sociais.",
    "Objetivos":"Fornecer ao aluno elementos sociais de entendimento sobre as principais motivações  do homem em seu lazer e em experiências vividas nas suas viagens, sobre seu encontro  com os autóctones, de maneira a fazer refletir a existência de valores em mutação para uma  nova sociedade mais humanizada e receptiva ao lazer e turismo.  Discutir as transformações sociais do mundo moderno das viagens.  Propiciar o entendimento dos efeitos que o lazer e o turismo têm sobre os indivíduos,  a família, outros grupos e a sociedade em geral, tendo como fato a ampliação do tempo  livre.  Analisar as repercussões que as experiências de viagens e do lazer exercem sobre  as populações dos polos receptores e emissores, bem como de promover a aparição de  novos estilos, formas, imagens e motivações de deslocamento humano organizado.  Apontar ao aluno os elementos conceituais e os parâmetros necessários à  constituição de uma visão crítica acerca dos mecanismos de funcionamento da sociedade  e de suas mudanças, propondo ações reflexivas para que nela atue enquanto cidadão e  profissional.  Apresentar e discutir os problemas e abordagens das ciências sociais sobre o  Turismo.  Problematizar o conceito de cultura e dimensionar suas funções e processos no  desenvolvimento da atividade turística.  Discutir os elementos para uma análise cultural da sociedade para entendimento da  relação entre comunidade local e turista.  Debater sobre globalização e cultura e os impactos no turismo.  Problematizar a experiência antropológica do turismo",
    "Conteúdo Programático":"1. Sociologia contemporânea  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  2. Desenvolvimento sustentável e Turismo; Globalização; Terceirização; terceiro  setor; Liberalismo e neoliberalismo.  3. Cidadania Turismo e suas implicações socioculturais.  4. As ciências sociais aplicadas ao turismo – estudos e pesquisas; Lazer e turismo  na cidade; Turismo e espaço urbano.  5. O Turismo e seus impactos sócios ambientais e culturais  6. Impacto sócio cultural do Turismo; Turismo e populações anfitriãs; Turismo e  meio ambiente; Turismo e conflitos étnicos; Tipologia de turismos e turistas e  seus impactos; Turismo como ritual de inversão.  7. O Turismo e o mundo pós-moderno.  8. Turismo e imagem – a invenção de localidades turísticas; Turismo como  experimentação de performances ou espetáculos; Turismo e globalização;  Turismo e produção de não lugares; Turismo virtual.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"2º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Legislação e Turismo",
    "Código":"LEGT2.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"A disciplina deverá oferecer ao aluno ferramentas para a correta interpretação,  compreensão e aplicabilidade de todas as legislações vigentes que regulam o setor turístico  no Brasil, a responsabilidade civil do profissional do turismo; a correta compreensão dos  direitos e dos deveres como cidadão e como profissional.",
    "Objetivos":"Ler, interpretar e pautar o seu desempenho profissional, em qualquer instância em  que se encontre inserido, de acordo com a legislação brasileira, no que tange à atividade  turística.  Posicionar-se criticamente perante a sociedade e o meio profissional, reconhecendo  todas as bases legais formadoras da sociedade.",
    "Conteúdo Programático":"1.  Elaboração e Aprovação das Leis no Brasil.  2.  A Constituição Federal - emendas, garantias e deveres.  3.  Legislação Específica Aplicada ao profissional do Turismo: Lei Geral do  Turismo n.º 11.771\/08.  4.  Legislações correlatas ao Turismo:  a)  Código de Defesa do Consumidor – CDC (relações de consumo; contratos verbais  e escritos e as consequências civis e penais).  b)  Legislação civil (responsabilidade civil do profissional de turismo no direito brasileiro  (responsabilidade objetiva\/subjetiva; negligência; imprudência, imperícia; culpa e dolo);  tipos de indenização judicial: danos morais, danos materiais, lucros cessantes, pensão  mensal vitalícia  c)  Código Penal – CP e as implicações judiciais.  d)  Consolidação da Legislação Trabalhista – CLT  (noções).  e)  Legislação rodoviária, ferroviária e aeroviária pertinentes.  f)  Estatuto do Idoso – Lei n.º 10.741, de 1.º de outubro de 2003.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  g)  Cadastro e classificação dos setores turísticos (agências de turismo; meios de  hospedagem; transportadoras turísticas; organizadoras de eventos; parques temáticos;  acampamentos turísticos)  h)  Estrutura Organizacional do Turismo:  ●  Da política, plano e sistema de turismo.  ●  Da prestação dos serviços Turísticos.  ●  Das infrações e penalidades e seus reflexos perante a legislação mencionada e  correlata aos profissionais do turismo.  i)  Panorama das ações judiciais, em geral, em relação ao turismo.  5.  Transporte e Hospedagem.  a.  Transporte Rodoviário.  b.  Transporte Aéreo.  c.  Perda, extravio ou avaria de bagagem.  d.  Atraso no embarque e overbooking.  e.  Vias de solução.  f.  Hospedagem.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"2º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Novas Tecnologias de Informação para o Turismo",
    "Código":"TITT2.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular pretende enfatizar os principais aspectos que demonstram a  importância das Novas Tecnologias da Informação e sua aplicabilidade no Planejamento e  Gestão do Turismo, de modo que o aluno consiga identificar a relevância dos softwares e  sistemas operacionais trabalhados ao longo das aulas.",
    "Objetivos":"Aprender os conhecimentos básicos de sistemas de informação.   Reconhecer os diferentes tipos de sistemas de informação nas organizações do turismo.   Compreender a necessidade de gerir as TICs nas organizações do turismo.   Diferenciar dados, informação e conhecimento e sua importância na gestão das  organizações do turismo, principalmente, agências de viagens.",
    "Conteúdo Programático":"1. Fundamentos dos Sistemas de Informação nas Organizações.  2. Tecnologias da Informação e Comunicação (TIC) aplicadas às empresas.  3. Sistemas E-Business \/ Sistemas E-Commerce.  4. Sistemas de Apoio às Decisões \/ Sistemas de Informação no Turismo.  5. Tecnologias da Informação e Comunicação aplicadas ao Turismo.  6. Gestão de Recursos de Dados nas Agências de Viagens.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"2º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"História do Brasil e da América",
    "Código":"HIST2.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"5",
    "Total de aulas":"95",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Pensar criticamente a História do Brasil e da América, e suas interfaces culturais.  Elucidar os processos históricos que contribuíram com a formação da cultura brasileira e  sul-americana. Buscar caminhos e alternativas de manifestações culturais que possam  contribuir para uma sociedade mais justa e humana.",
    "Objetivos":"Proporcionar ao aluno condições para refletir sobre a história do Brasil e da América  de modo a construir sua identidade enquanto cidadão brasileiro e latino-americano.  Verificar as diferentes manifestações culturais que caracterizam a história do Brasil  e América do Sul.  Abordar de forma crítica a realidade sociocultural que lhe cerca, de forma a permitir  uma intervenção consistente no seu entorno.  Oferecer elementos para compreender as diversas manifestações da cultura  brasileira e sul-americana ao longo da História.",
    "Conteúdo Programático":"1. A Conquista da América – o choque das civilizações europeia e pré-colombiana.  2. Estruturas Econômicas da América Espanhola  3. A Formação do Brasil Colonial – Estruturas Econômicas e o Escravismo Colonial.  4. Caribe: A Rebelião de Escravos no Haiti.  5. Os Processos de Independência da América Espanhola  6. O Processo de Independência e consolidação do Estado Nacional no Brasil.  7. Caribe: O Processo de Independência de Cuba e a Identidade Latino-Americana.  8. Desenvolvimento e Dependência: as trajetórias das Repúblicas Hispano-Americanas  9. O Brasil e o Mundo Contemporâneo: tópicos de História Brasileira nos Séculos XIX  e XX  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"2º Semestre",
    "Carga Horária Total":71
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Turismo e Patrimônio Cultural.",
    "Código":"TPCT2.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"A disciplina Turismo e Patrimônio Cultural pretende contribuir para a compreensão dos  discentes sobre a importância do Patrimônio para o Turismo e para a sociedade, bem como  apresentar políticas públicas e gestão de bens culturais implementadas no país por meio  dos órgãos responsáveis, como IPHAN e UNESCO. Além disso, pretende-se compartilhar  experiências contemporâneas de gestão patrimonial (nacional e internacional) e a relação  da gestão patrimonial (nacional e internacional) com o turismo.",
    "Objetivos":"1. Capacitar os alunos para a reflexão e gestão do patrimônio cultural no contexto do  Turismo.  2. Refletir sobre a contribuição social do profissional de Turismo na defesa e valorização  do patrimônio histórico e cultural brasileiro.  3. Identificar o papel das instituições públicas e organizações do terceiro setor na  gestão do patrimônio.  4. Discutir a relação das políticas de patrimônio cultural imaterial e suas conexões com  o turismo, tendo por referência convenções internacionais, experiências brasileiras  de salvaguarda e a análise de bens culturais imateriais empregados no âmbito  turístico.",
    "Conteúdo Programático":"1. Conceitos e definições de Patrimônio.  2. Tipificação de patrimônio cultural.  3. Instituições nacionais e internacionais atuantes na área de patrimônio cultural.  4. Documentos nacionais e internacionais em matéria de patrimônio cultural.  5. Políticas de salvaguarda do patrimônio imaterial.  6. Políticas de salvaguarda do patrimônio cultural imaterial no Brasil.  7. Bens culturais imateriais como vetores do turismo.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  8. Bens culturais imateriais brasileiros.  9. Patrimônio cultural e negócios turísticos.  10. Patrimônios culturais imateriais brasileiros e formas de apropriação turística:  manifestações religiosas; festas populares; culinária regional e saberes populares.  11. Análise de produtos turísticos do segmento de turismo cultural.  12. Turismo e valorização do patrimônio cultural: problemática e perspectivas.  13. A educação patrimonial como instrumento de preservação e comunicação de bens  históricos e culturais.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"2º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Economia do Turismo",
    "Código":"ECOT2.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular pretende apresentar os principais aspectos relacionados a  teoria macro e microeconômica, e suas interfaces com o turismo, de modo ao aprendiz  compreender não somente o turismo como fenômeno, mas também como elemento gerador  de emprego e renda nas regiões e países.",
    "Objetivos":"Apresentar a temática do empreendedorismo como fator concorrente para a compreensão de um  modo de pensamento empresarial com enfoque na perspectiva de criação de pequenas e microempresas.",
    "Conteúdo Programático":"1 Microeconomia e turismo: mercado turístico: oferta e demanda; Elasticidade: preço da  demanda, preço da oferta e renda; Estruturas de Mercado: conceitualização, classificação  e caracterização.  2 Macroeconomia e turismo: Agregados macroeconômicos: noções de contabilidade  social e indicadores macroeconômicos; Setor externo: taxa de câmbio e balanço de  pagamentos.  3 Pensamento econômico: Escola Clássica: Liberalismo, Mercado, Concorrência e  População em Adam Smith e Malthus; Karl Marx: Acumulação Capitalista; John Keynes:  crítica ao laissez-faire, Estado e Mercado na economia; Joseph Schumpeter:  desenvolvimento econômico, inovação e ciclos; CEPAL: Raul Prebisch, Celso Furtado e o  desenvolvimento econômico latino-americano.  4 Desenvolvimento econômico e turismo.  ●  Dinâmica recente da economia mundial: internacionalização, neoliberalismo,  desenvolvimento tecnológico e turismo.  ●  Recentes desafios da economia mundial: crises, desemprego, concentração.  Desenvolvimento Econômico e Turismo no Brasil: indicadores do turismo",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"3º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Agenciamento de Viagens.",
    "Código":"AGTT3.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"5",
    "Total de aulas":"95",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular Agenciamento de Viagens aborda questões conceituais  sobre as Agências de Viagens e Operadoras de Turismo, gestão e operacionalização das  empresas que atuam nesse setor e as especificidades de segmentos que apresentam  diferenciais competitivos e se apresentam como negócio promissor. Esta disciplina também  trabalhará os fundamentos de Sistemas de Informação nas organizações, bem como os  tipos de Sistemas usados na Internet; também se aplicarão as Tecnologias da Informação  e Comunicação na indústria do Turismo, particularmente nas Agências de Viagens.",
    "Objetivos":"Analisar a atuação e o funcionamento das agências de Turismo, considerando o panorama  nacional e internacional.  Compreender as estruturas organizacionais de uma agência.  Refletir sobre a importância das agências de viagens no sistema de Turismo.  Analisar as tendências e perspectivas do agenciamento de turismo no Brasil e no mundo.  Aprender os conhecimentos básicos de sistemas de informação.  Reconhecer os diferentes tipos de sistemas de informação nas organizações do turismo.  Compreender a necessidade de gerir as TICs nas organizações do turismo.  Diferenciar dados, informação e conhecimento e sua importância na gestão das  organizações do turismo, principalmente, agências de viagens.",
    "Conteúdo Programático":"1. A trajetória do agenciamento no mundo e no Brasil.  2. Classificação e tipologia das agências.  3. Bases legais para funcionamento e estrutura organizacional.  4. Importância das agências no desenvolvimento do turismo.  5. Tecnologias  e  canais  de  distribuição  e  processos  de  intermediação,  desintermediação e reintermediação.  6. Questões sobre estrutura a organizacional de uma agência; principais serviços e  produtos.  7. Gerenciamento administrativo-financeiro.  8. Ações de marketing e comercialização e sistemas de reserva, e-commerce, e-ticket.  9. Procedimentos de planejamento e venda de pacotes turísticos;  10. Serviços de receptivo e emissivos ligados a transporte, hospedagem, alimentação  e apoio.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  11. Termos técnicos; procedimentos de viagens.  12. Perspectivas e realidades das agências; mercados emergentes como de  ecoturismo, de intercâmbio, de incentivo e corporativo.  13. Fundamentos dos Sistemas de Informação nas organizações.  14. Tecnologias da Informação e Comunicação (TIC) aplicadas às Empresas.  15. Sistemas E-Business\/ Sistemas E-Commerce.  16. Sistemas de Apoio às Decisões\/ Sistemas de Informação no Turismo.  17. Tecnologias da Informação e comunicação aplicadas ao turismo.  18. Gestão de Recursos de Dados nas Agências de Viagens.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"3º Semestre",
    "Carga Horária Total":71
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Geografia Aplicada ao Turismo",
    "Código":"GEOT3.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"5",
    "Total de aulas":"95",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O estudo da Geografia do Turismo, de modo geral, dá o suporte necessário ao aluno  para a compreensão das esferas que envolvem o turismo e a organização do espaço  regional, analisando as repercussões impostas por essa atividade. Fundamentos da  Geografia, como Cartografia e Planejamento do Território, possibilitarão ao aluno a  operacionalização de análises críticas e propostas criativas, para casos reais de lugares e  destinos turísticos. A Geografia dos Espaços Turísticos Brasileiros desenvolve o estudo dos  diversos aspectos do nosso território, como: formação territorial (aspectos físicos, naturais  e  ambientais),  paisagem  natural  e  paisagem  turística,  aspectos  culturais  e  socioeconômicos. Tais aspectos são de suma importância para capacitar um futuro  profissional do Turismo.",
    "Objetivos":"Desenvolver com os alunos um raciocínio crítico entre a atividade turística e a organização  regional do Estado de São Paulo e da Baixada Santista.  Capacitar o aluno para a reflexão sobre o papel desempenhado pelo Turismo na  organização dos territórios frente a outras atividades econômicas.  Tornar o aluno apto a identificar especificidades do espaço turístico, no que tange ao meio  físico-natural e ao ambiente sócio-cultural-econômico.  Desenvolver atividades que estabeleçam uma relação entre a teoria e a prática da análise  do turismo em sua dimensão regional.  Permitir que o aluno estabeleça uma relação entre os aspectos físico-naturais, territoriais,  sócio-econômico-culturais e ambientais do espaço geográfico brasileiro com os diversos  tipos de turismo que podemos desenvolver em nosso país e na América do Sul.  Fornecer ao aluno subsídios que permitam que o futuro profissional do turismo tenha um  domínio amplo dos aspectos físico-naturais-ambientais do território brasileiro e da América  do Sul, desempenhando tal papel de forma crítica em relação aos impactos  socioambientais e econômicos da atividade turística.  Capacitar o aluno para a reflexão sobre o papel desempenhado pelo turismo na  organização dos territórios frente a outras atividades econômicas, capacitando-o para  identificar especificidades do espaço turístico, no que tange ao meio físico-natural e ao  ambiente sócio- cultural-econômico.  Desenvolver atividades que estabeleçam uma relação entre a teoria e a prática da análise  do Turismo.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022",
    "Conteúdo Programático":"1. Geografia e Cartografia para o turismo: Geografia e turismo: uma discussão recente.  2. Introdução à Geografia do Turismo: turismo e cidade, turismo em áreas naturais,  turismo em espaços rurais, territórios emissores de turistas, espaços de  deslocamento, núcleos receptores de turistas.  3. Introdução à Geografia do turismo: notas introdutórias, turismo e meio ambiente,  lazer turístico.  4. Turismo e Meio Natural do Estado de São Paulo: Domínio Tropical Atlântico: Mata  Atlântica.  5. Turismo e Meio Natural do Estado de São Paulo: Domínio Tropical Atlântico:  Mangues e Restingas.  6. Turismo e Meio Natural do Estado de São Paulo: delineamento da região, região  homogênea, região polarizada, região programa e política, região turística, atrativos  turísticos.  7. Turismo e Meio Natural do Estado de São Paulo: atrativos turísticos, tempo e  distância, motivação, renda, elementos econômicos: mercado turístico, oferta e  demanda turística, oferta turística, demanda turística.  8. Plano Diretor de Turismo da Baixada Santista - PDTUR\/BS: Apresentação, Objetivos,  potencialidade metropolitana, propostas de ação.  9. Apresentação do curta-metragem: Pólo de Ecoturismo Vale do Ribeira Lagamar,  Análise do curta-metragem.  10. Uma análise socioespacial do Turismo no Estado de São Paulo: legislação urbana,  plano diretor e sua relação com os problemas da cidade, plano diretor estratégico do  município de São Paulo.  11. Turismo, Planejamento e Meio ambiente: coleta, tratamento e abastecimento de  água: SABESP; balneabilidade: CETESB.  12. Seminários: Análise Turística dos Municípios da Baixada Santista: Bertioga, Peruíbe  Mongaguá.  13. Seminários: Análise Turística dos Municípios da Baixada Santista: Itanhaém, Praia  Grande e Guarujá.  14. Seminários: Análise Turística dos Municípios da Baixada Santista: Cubatão, Santos  e São Vicente  15. Brasil no mundo  16. Espaço territorial brasileiro  17. As fronteiras nacionais e seus indicadores geográficos  18. Estudo cartográfico do espaço brasileiro, segundo o IBGE e suas transformações  19. Características Naturais do Espaço Brasileiro  20. Estruturado relevo brasileiro\/cavernas, canyons, montanhas, plateause ilhas  21. Quadro climatobotânico brasileiro  22. Hidrografia do Brasil  23. Problemas ambientais  24. Estrutura da população Brasileira  25. Movimentos migratórios  26. Crescimento e mobilidade populacional  27. Demografia e sociedade  28. Urbanização e sociedade brasileira  29. Redes de cidades e metropolização  30. Industrialização e Terceirização Brasil no mundo.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"3º Semestre",
    "Carga Horária Total":71
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Inglês Instrumental II.",
    "Código":"INGT3.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Continuação à introdução de estruturas básicas do idioma bem como sua aplicação  em pequenos diálogos, como falar sobre pratos e bebidas, fazer pedidos em restaurantes,  pegar pedidos por telefone, fazer reservas em restaurantes ou hotéis.",
    "Objetivos":"Possibilitar ao aluno a comunicação na sua área de atuação, capacitando-o a se expressar  na forma escrita e especialmente falada para que possa se comunicar com turistas e  pessoas relacionadas a sua área.  Ampliar seu universo habilitando-o ao acesso a informações via Internet e publicações em  inglês.",
    "Conteúdo Programático":"1. Atitudes e procedimentos, tendo em vista: fazer pedidos em restaurantes; lidar com  turistas; fazer reserva em restaurantes.  2. Conteúdo gramatical: diferente ways of expressing the future (will; going to, presente  continuous; simple present), comparatives, demonstrative pronouns, anomalous verbs.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"3º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Transportes",
    "Código":"TRAT3.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Este componente curricular visa a possibilitar ao aluno o entendimento do conceito de  transporte e sua relação com o turismo em seus múltiplos aspectos, capacitando-o tanto  para compreender as características essenciais dos sistemas de transportes utilizados nas  atividades turísticas como para a escolher e definir um sistema de transporte turístico  adequado ao produto turístico que se propõe.",
    "Objetivos":"Conceituar transporte como meio de locomoção, ressaltando a sua importância na área de  Turismo.  Informar sobre as características de cada setor e sobre o funcionamento da prestação de  serviços de transporte do ponto de vista da empresa transportadora e do transportado.  Expor as empresas de transporte como eixo da viagem de turismo em suas diferentes  modalidades.  Identificar serviços e equipamentos nas empresas de transportes.  Estudar os Meios de Transporte como meio para se obter uma operação de roteiro  tecnicamente perfeito.  Capacitar os alunos no conhecimento dos principais termos do transporte.  Potencializar mecanismos, ferramentas e habilidades para aumentar a flexibilidade nas  relações contratuais com empresas de transporte.  Melhorar o potencial de análise na escolha de um modal de transporte.  Desenvolver o conhecimento sobre os sistemas de transporte e suas potencialidades.  Formar no aluno o conhecimento necessário para a escolha e definição de um sistema de  transporte turístico e na formação de um produto turístico.  Identificar as perturbações do comportamento como características que interferem  negativamente no relacionamento do indivíduo com o meio e com ele mesmo.  Utilizar conhecimentos e técnicas de relações humanas na identificação e interpretação do  perfil do turista.",
    "Conteúdo Programático":"1. Aspectos relacionados aos sistemas de Transporte X Turismo – conceito.  2. Tipos de transporte.  3. Aspectos sobre transporte público e transporte privado.  4. Transporte coletivo e individual.  5. Qualidade em transporte.  6. Dimensionamento de frotas de transporte coletivo.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  7. Ponto de equilíbrio em sistemas de transporte.  8. Modais de transporte.  9. Transporte aéreo: aspectos e legislação relacionada ao transporte aéreo no Brasil.  10. Transporte marítimo: aspectos e legislação relacionada ao transporte marítimo no  Brasil.  11. Transporte terrestre - transporte rodoviário e transporte ferroviário: aspectos e  legislação relacionada ao transporte terrestre no Brasil.  12. Logística Reversa – transportes e meio ambiente.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"3º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"História Regional Aplicada ao Turismo",
    "Código":"HRTT3.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Este componente curricular tem como principal objetivo a introdução ao estudo  histórico-cultural do estado de São Paulo e da região da Baixada Santista, com o intuito de  fornecer ao aluno alguns subsídios que permitam a execução de roteiros urbanos, com  ênfase nos aspectos que caracterizem a referida história local.",
    "Objetivos":"Situar a história estadual dentro do contexto nacional, a fim de que o aluno tenha uma noção  mais aprofundada da história da sua região.  Destacar o desenvolvimento histórico-político-social-econômico-cultural das cidades da  Baixada Santista.  Selecionar elementos de tal desenvolvimento que possam ser transformados em produtos  de interesse e relevância turística.  Compreender as inter-relações entre turismo urbano e história por meio do olhar atento ao  patrimônio arquitetônico de cada uma das cidades em questão.  Treinar o olhar do futuro profissional de turismo para as transformações que as cidades  sofrem no decorrer do tempo, com o intuito de captar as sutilezas do cotidiano e elementos  para interpretá-las segundo as necessidades da atividade de guia de turismo.",
    "Conteúdo Programático":"1 Contexto histórico da ocupação da região da Costa da Mata Atlântica.  2 Pobreza e Isolamento – São Paulo dos Séculos XVI a XIX.  3 O Café, a ferrovia e a inserção do São Paulo no mercado mundial.  4 O desenvolvimento de São Paulo nos primórdios da República Brasileira.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"3º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Matemática comercial e financeira.",
    "Código":"MATT3.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não informado",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular pretende abordar os preceitos básicos da matemática  financeira, de modo a permitir ao profissional de turismo perceber sua importância nas  organizações de turismo, como agencias, hotéis, empresas de transportes, organizadores  de eventos.",
    "Objetivos":"Compreender e aplicar juros simples e compostos, taxas médias, equivalentes, efetiva e  nominal. Formação de capital e sistemas de amortização.  Identificar os conceitos básicos da matemática no regime de capitalização simples.  Compreender taxas de juros praticados no mercado em regime de capitalização composta.",
    "Conteúdo Programático":"1. O Capital e o Juro  2. Regimes de Capitalização  3. Fluxos de Caixa de uma operação  4. Fórmula dos juros e do montante  5. Taxas Equivalentes  6. Valor nominal e valor atual (ou presente)  7. Desconto comercial ou bancário  8. Juros Compostos  9. Períodos não inteiros  10. Taxas equivalentes  11. Valor atual e nominal  12. Compra à vista e a prazo  13. Capitalização composta com taxas de juros variáveis  14. Equivalência de capitais a juros compostos  15. Valor atual de um conjunto de capitais  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  16. Conjunto de capitais equivalentes  17. Taxa Interna de retorno",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"3º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Superior de Bacharelado em Turismo",
    "Componente curricular":"Estatística Aplicada ao Turismo",
    "Código":"ESTT3.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Este componente curricular visa a possibilitar ao aluno a elaboração de Cálculos de  Valores Relativos e Absolutos (Porcentagem e Índices), definição de métodos de  levantamento e análise de dados, cálculo e interpretação das Medidas de Tendência Central  (Média, Moda e Mediana), interpretação de Dados Estatísticos na forma de Tabelas e  Gráficos e o estudo de intervalos de confiança e incerteza da medição",
    "Objetivos":"Compreender o uso de Tabelas e Gráficos.  Realizar cálculos de Porcentagem e Índices.  Analisar dados e distribuições.  Discutir diferentes formas de coleta e apresentação de dados.  Expor ao aluno algumas técnicas estatísticas para o uso na interpretação e análise de  dados.  Desenvolver a confiança dos alunos ao lidar com dados e números.  Salientar o uso da estatística nas aplicações práticas do contexto do curso.",
    "Conteúdo Programático":"1. Métodos estatísticos.  2. Características: elementos de amostragem, estrutura de pesquisa.  3. Revisão dos conceitos necessários para estudar estatística: razão proporção,  porcentagem, critério de arredondamento somatório.  4. Apresentação de dados: tabelas de distribuição de frequências; gráficos de barras,  coluna, setor, histograma, polígono de frequências, ogiva.  5. Medidas de tendência central: média, moda, mediana.  6. Medida de dispersão: variância, desvio padrão, coeficiente de variação, critério de  homogeneidade.  7. Probabilidade.  8. Distribuição normal.  9. Interpretação do desvio padrão – curva normal.  10. Intervalo de confiança.  11. Incerteza da medição.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"3º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Planejamento e Organização de Eventos",
    "Código":"POET4.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular visa à apresentação dos aspectos conceituais e históricos  dos eventos, assim como sua tipologia, planejamento, organização e execução a fim de  estabelecer os elementos básicos à consecução de tarefas ligadas à área profissional  específica.",
    "Objetivos":"Conhecer os aspectos conceituais e históricos e a tipologia dos eventos.  Identificar e entender todas as fases e ações relacionadas à organização de um evento.  Perceber a necessidade de captação de eventos bem como a interação entre a organização  de um evento e a estrutura do receptivo.  Reconhecimento e aplicação do conjunto de regras, normas e estilo no trato cerimonioso  entre as pessoas.  Desenvoltura na aplicação dos fundamentos da etiqueta universal.  Demonstrar o protocolo e os símbolos nacionais.  Utilização dos trajes e convites adequados em qualquer ocasião e ambiente.",
    "Conteúdo Programático":"1. Histórico e conceituação dos eventos: histórico dos eventos; definição e conceitos.  2. Classificação dos eventos: por categoria; por área de interesse; por localização; por  características estruturais (porte, data de realização, perfil dos participantes); por  tipologia.  3. Eventos: importância na atualidade: o evento como atividade socioeconômica; o  evento como indutor do desenvolvimento do turismo municipal; mercado turístico e  eventos.  4. As fases de um evento: concepção; pré-evento; evento; pós-evento.  5. Perfil profissional: Habilidades e Aptidões.  6. Vocabulário técnico.  7. Conceitos e definições: Cerimonial, Protocolo e Etiqueta.  8. Etiqueta doméstica social.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  9. Etiqueta empresarial: ambiente de trabalho. Visual e postura: dicas para homens e  mulheres. Para entrevista de emprego e condições de trabalho.  10. Protocolo e Cerimonial: regras à mesa; encrencas à mesa (social).  11. Tipos de serviço formais e seu protocolo: à francesa, à inglesa, direto e indireto, à  diplomata (russa).  12. Cerimonial e protocolo: a ótica de relações públicas.  13. Ministério das Relacionais Internacionais: Protocolo do Itamaraty. Funções do  Cerimonial: ordem de Precedência. Símbolos Nacionais.  14. Boas Maneiras.: formas de tratamento; convites; trajes",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"4º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Gestão de Pessoas",
    "Código":"GEPT4",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O presente componente curricular visa a compreender os múltiplos aspectos dos  recursos humanos, a relação deste com a estrutura organizacional, com o intuito de  proporcionar capacidade de gerir recursos humanos em suas múltiplas ocorrências.",
    "Objetivos":"Dotar o aluno de conhecimentos acerca dos aspectos técnicos da gestão de pessoas  nas organizações, como lidar com o fator humano no ambiente profissional e utilizar os  instrumentos da gestão para essa finalidade.",
    "Conteúdo Programático":"1. Recursos Humanos e Turismo.  2. Fatores de Influência no Capital Humano – comunicação, habilidades, educação.  3. Conhecimento, aprendizado, motivação, reciprocidade, trabalho em equipe.  4. Gestão de pessoas por meio dos processos – recrutamento, seleção, testes,  entrevistas, desenho de cargo, avaliação de desempenho, recompensar pessoas,  remuneração,  benefícios  e  serviços  incentivos,  desenvolver  pessoas,  treinamento, desenvolvimento, carreira.  5. Temperamentos, Liderança, Cultura e Clima organizacional.  6. O indivíduo nas organizações: Comunicação Interpessoal, Grupo e  Comportamento grupal, Administração de Conflitos, Motivação no trabalho,  Liderança",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"4º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Inglês Instrumental III.",
    "Código":"INGT4.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular visa a possibilitar ao aluno a comunicação na sua área de  atuação, capacitando-o a se expressar na forma escrita e especialmente falada para que  possa se comunicar com turistas e pessoas relacionadas à sua área. Ampliar seu universo,  habilitando-o ao acesso a informações via Internet e publicações em inglês.",
    "Objetivos":"Descrever atrativos turísticos naturais e\/ou artificiais   Falar sobre serviços turísticos   Ler e escrever material promocional",
    "Conteúdo Programático":"1. Passive voice  2. Future: going to, will, presente continuos  3. Revisão dos verbos modais em situações específicas  4. Vocabulário técnico da área de agenciamento e turismo  5. Uso de frasal verbs",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"4º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Contabilidade aplicada",
    "Código":"CONT4.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Estudo dos conceitos e definições concernentes à contabilidade gerencial.  Caracterização do uso das técnicas de controles gerenciais, contribuindo para o  desenvolvimento dos enfoques estratégicos, para o planejamento dos sobre fluxos de  recursos e da rentabilidade das empresas.",
    "Objetivos":"Compreender a relevância dos sistemas de contabilidade nas organizações de  turismo.  Identificar as principais nomenclaturas ligadas à contabilidade.  Demonstrar a construção e aplicabilidade do Ativo, Passivo, Patrimônio Líquido e  Balanço Patrimonial.  Analisar a Demonstração do Resultado – DRE de uma empresa de turismo.",
    "Conteúdo Programático":"1. Caracterização, objetivo e usuários da contabilidade.  2. Limitações da contabilidade.  3. Estática patrimonial –Significado dos Grupos Patrimoniais: Ativo; Passivo;  Patrimônio Líquido.  4. Critérios de Avaliação.  5. O Balanço Patrimonial (BP) e a Estrutura de Apresentação.  6. Alterações Introduzidas pela Lei N.º 11.638\/2007 e MP N.º 449\/2008.  7. As variações do Patrimônio Líquido: Conceitos de Receitas e Despesas.  8. A Demonstração do Resultado (DRE).  9. Destinação do Lucro: Reservas e Dividendos; Prejuízos Acumulados.  10. A Demonstração das Mutações do Patrimônio Líquido (DMPL).  11. Alterações Introduzidas pela Lei N.º 11.638\/2007 e MP N.º 449\/2008.  12. Análise das Alterações Introduzidas pela Lei N.º 11.638\/2007 e MP N.º 449\/2008.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"4º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Gastronomia regional.",
    "Código":"GART4.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"A disciplina Gastronomia Regional trabalhará temas como patrimônio alimentar  brasileiro, em que se contemplará a cozinha das cinco regiões brasileiras e serão  demonstradas as influências gastronômicas das diferentes etnias formadoras da população  brasileira que atuam como manifestações da identidade cultural nacional. Além disso,  pretende-se trabalhar, igualmente, a relação da gastronomia no contexto do fenômeno  turístico.",
    "Objetivos":"Permitir ao aluno conhecer os ingredientes básicos utilizados em três regiões brasileiras  nas cozinhas das regiões: centro-oeste, sudeste e sul - e suas principais técnicas de pré- preparo e cocção.  Fornecer conhecimentos indispensáveis para o contato e desenvolvimento da cozinha  regional brasileira; importantes para a inserção profissional do aluno em um mercado de  trabalho competitivo.",
    "Conteúdo Programático":"1. História da gastronomia regional brasileira e suas influências.  2. Apresentação dos aspectos geográficos, sociais, históricos, culturais e  gastronômicos importantes relativos às regiões.  3. Identificação dos alimentos típicos regionais.  4. Demonstração e visualização das principais receitas típicas de identidade destas  regiões.  5. Rotas e roteiros gastronômicos.  6. O estudo de mercados, feiras, eventos e festivais como manifestações da cultura  alimentar brasileira e sua salvaguarda patrimonial.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"4º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Marketing e Turismo",
    "Código":"MKTT4.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Este componente curricular visa a possibilitar ao aluno o entendimento dos conceitos  de Marketing e Marketing turístico em seus múltiplos aspectos, teórico e prático, de modo a  prepará-lo para formular peças publicitárias para a promoção de atividades turísticas.",
    "Objetivos":"Compreender os conceitos centrais de Marketing.  Saber identificar as formas de compra do consumidor de turismo.  Conhecer as formas de segmentar o mercado e sua importância para o correto  posicionamento no mercado de turismo.  Estudar os quatro Ps do marketing tradicional e mais os quatro elementos adicionais  da administração integrada de serviços.  Reconhecer a importância da pesquisa em marketing para o sucesso de um  empreendimento de turismo e lazer.  Debater as vantagens e desvantagens de cada elemento do composto promocional.  Identificar as diversas formas de formação de preços.  Reconhecer o importante papel da Informática no marketing.",
    "Conteúdo Programático":"1. Conceitos centrais de Marketing.  2. Compostos de Marketing.  3. Público-Alvo e Tipos de Segmentação.  4. Pesquisa de Marketing.  5. Estudo sobre Marcas.  6. Análise das Oportunidades (Análise setorial).  7. Marketing de Relacionamento.  8. Promoção turística: Propaganda, promoção de vendas e relações públicas;  Vendas pessoais; Marketing direto e on-line; Casos de promoção turística.  9. Marketing verde.  10. Responsabilidade sociocultural do marketing.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"4º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Gestão de custos.",
    "Código":"GECT4.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Este componente curricular visa a estimular o discente a compreender o conjunto de  aspectos que integram o sistema de custos de uma organização, sobretudo ligada à  atividade turística. Ao longo da disciplina, o discente desenvolve atividades relacionadas a  preço, orçamentos, sistema de custos, fluxo de caixa e demais funções inerentes às  organizações.",
    "Objetivos":"Compreender a elaboração e funcionamento do sistema de custos.  Conhecer as técnicas de formação de preço e de orçamento.",
    "Conteúdo Programático":"1. Conceitos e classificação de custos.  2. Métodos de custeio.  3. Análise custo\/volume\/lucro.  4. Formação de preços de venda.  5. Análise Custo\/volume\/lucro.  6. Fluxo de caixa: Conteúdo, objetivo, formato; Demonstração do fluxo de caixa;  Métodos de elaboração do fluxo de caixa.  7. Administração do Capital de Giro: Caixa; Crédito; Estoques.  8. Orçamento.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"4º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Gestão da qualidade e serviços",
    "Código":"GQST4.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O presente componente curricular permite compreender as diversas interpretações  da qualidade e seus múltiplos aspectos, possibilitando intervenções organizações, análises  e avaliações na gestão de serviços e qualidade.",
    "Objetivos":"Apresentar a evolução do sistema de gestão organizacional e dos sistemas de gestão  da qualidade.  Conhecer as ideias e contribuições dos precursores de sistemas de gestão da  qualidade.  Conhecer as ações brasileiras para melhoria da competitividade da sua empresa em  um cenário de globalização e concorrência internacional.   Apresentar os elementos de um sistema de garantia da qualidade internacional nos  moldes das normas ISO 9000:2008.   Apresentar as ações e objetivos da Fundação Nacional da Qualidade.   Conhecer os fundamentos e critérios do modelo de excelência em gestão nos  moldes do Prêmio Nacional da Qualidade – PNQ.  Apresentar como as empresas podem gerar satisfação, valor e retenção do cliente.",
    "Conteúdo Programático":"1. HISTÓRICO E FILOSOFIA: a evolução e o desenvolvimento da qualidade; histórico  da Gestão da qualidade; consequências da adoção dos conceitos e premissas da  Gestão da Qualidade; conceitos de Empresa e de Gestão; considerações básicas de  Princípios de Administração.  2. GURUS DA GESTÃO DA QUALIDADE E SUAS LINHAS DE PENSAMENTO:  principais linhas de pensamento da qualidade; definições de qualidade (Edward  Deming, Joseph Juran, Philip Crosby, Armand Feigenbaum, Kaoru Ishikawa).  3. A GESTÃO DA QUALIDADE: a gestão da qualidade como estratégia competitiva; a  importância do estabelecimento da missão, visão de futuro; a qualidade se faz no  negócio; a evolução da qualidade nas organizações; dimensões da qualidade;  conceito de desempenho; a Trilogia de Juran; a Pirâmide TQM; os paradigmas de  ontem e de hoje; a gestão do conhecimento como estratégia de disseminação das  informações; definição de clientes, fornecedores, cadeia cliente, fornecedor.  4. TÉCNICAS DE MELHORIA DE DESEMPENHO: conceituação de processos; os  níveis dos processos, do negócio, da organização e das atividades; a importância de  conhecer as atividades por meio do mapeamento dos processos; estruturas  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  organizacionais  flexíveis;  estruturas  organizacionais  verticalizadas  X  horizontalizadas; a importância do monitoramento dos processos para obter maior  desempenho;  monitoramento  do  desempenho  por  meio  de  indicadores  impulsionadores de desempenho; a aplicação da metodologia Balanced Scorecard  (BSC); as perspectivas do BSC; a necessidade de integração das perspectivas; a  importância da percepção de que as organizações devem estar orientadas para a  estratégia; monitoramento constante das demandas do mercado; criação de um  mapa de relacionamento de indicadores impulsionadores de desempenho.  5. Normas ISSO: a busca pela certificação através das normas ISO; os objetivos da  normalização; O órgão oficial brasileiro - ABNT; A cronologia das normas ISO;  Requisitos básicos da ISO",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"4º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Técnicas de Relações Públicas.",
    "Código":"TRPT4.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular pretende apresentar conceitos de Relações Públicas,  estudar a Comunicação no âmbito do turismo, dentro das organizações turísticas e de  hospitalidade a fim de possibilitar ao educando a atuação das Relações Públicas no  Turismo e na Hotelaria.",
    "Objetivos":"Compreender as especificidades da comunicação turística e de hospitalidade no  desenvolvimento de atividades de relações públicas.  Possibilitar aos alunos uma visão sistemática de planejamento, planejamento estratégico e  planejamento de Relações Públicas, proporcionando-lhes conhecimentos teóricos e  práticos que lhes possibilitem traçar e executar planos, programas específicos da área de  Relações Públicas e da Comunicação Organizacional.",
    "Conteúdo Programático":"1. Conceitos e técnicas em relações públicas.  2. Funções básicas de Relações Públicas.  3. Processos de Relações Públicas.  4. Aplicação de Técnicas de Relações Públicas.  5. Relações com diferentes públicos: público interno, externo e misto.  6. A atuação das Relações públicas no Turismo e Hotelaria.  7. Comunicação dirigida.  8. Relações públicas Governamentais: Secretarias de Turismo.  9. O agente de Relações Públicas e suas funções junto aos meios hospedagens e  agentes de turismo.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"4º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Empreendedorismo II.",
    "Código":"EMPT4.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"A disciplina Empreendedorismo II visa a analisar oportunidades de negócios, entender  por que nem sempre boas ideias geram negócios de sucesso, o papel do business plan,  como e quando elaborá-lo, buscando identificar e selecionar as melhores opções existentes  para o financiamento inicial de um negócio ou de novas unidades organizacionais.",
    "Objetivos":"Considerar as discussões sobre a natureza da figura do empreendedor, tanto na  perspectiva de criação de uma nova empresa como pela retomada de empresas familiares  em processos sucessórios.  Incentivar o aluno a sintetizar seus conhecimentos sobre um sistema de atividades  empresariais na prática da formulação de um plano de negócios.",
    "Conteúdo Programático":"1. Empreendedorismo: opção de carreira; identificação de oportunidades, espírito de  liderança e visão alternativas de interpretação do fenômeno do empreendedorismo.  2. Perspectivas de ação empreendedora.  3. Tipos  de  prática  do  empreendedorismo:  criação  de  empresas,  intraempreendedorismo, sucessão de empresas familiares.  4. Ideias, inovação e prática de implantação de negócios.  5. Plano de negócios.  6. Limitações, crises, ciclos.  7. Gestão e desenvolvimento de negócios.  8. Cotidiano administrativo.  9. Gestão estratégica  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"5º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Gestão de alimentos e bebidas.",
    "Código":"GABT5.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"4",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Nesta disciplina, serão apresentados aos discentes conceitos e aspectos gerais da  área de A&B, como, por exemplo, concepção, planejamento, gerenciamento e  operacionalização de produções culinárias. Além de demonstrar de que forma o profissional  da área de Turismo poderá atuar nas diferentes etapas dos serviços de A&B, levando em  conta questões culturais, econômicas e sociais.",
    "Objetivos":"Compreender o histórico e a tipologia da alimentação; perceber a importância e a  relação de A&B, gastronomia, hotelaria e turismo receptivo; perceber o dimensionamento  de equipamentos, materiais e normas higiênicas em A&B.",
    "Conteúdo Programático":"1. Breve contexto histórico da alimentação.  2. Conceituação e tipologia da Gastronomia.  3. Importância da Gastronomia como um atrativo turístico. A época contemporânea  (séculos XIX-XX):transformações do consumo alimentar; a invasão dos produtos  de além-mar; nascimento e expansão dos restaurantes; a indústria alimentar e as  novas técnicas de conservação; a emergência das cozinhas regionais  4. Aspectos  culturais  da  culinária  brasileira.  5. Gastronomia e estilo de vida. Época contemporânea: a “McDonaldização”  dos costumes. A gastronomia na atualidade: a gastronomia no mundo de  hoje – o fenômeno da globalização; restaurante: equipe de funcionários –  funções do serviço de A e B Princípios básicos de organização física.    6. Atendimento ao cliente, Mise em Place (colocação da mesa) e Menu.  7. Gastronomia na Hotelaria. Princípios básicos de organização física.  8. Bar, Cozinha, Copa, Banquete e Steward.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"5º Semestre",
    "Carga Horária Total":57
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Meios de Hospedagem",
    "Código":"MHST5",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"5",
    "Total de aulas":"95",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular aborda os principais elementos relacionados aos meios de  hospedagem e sua respectiva importância para o desenvolvimento do turismo, abordando  os diferentes tipos de meios de hospedagem existentes, sua respectiva classificação,  setores e departamentos, bem como a apresentação de técnicas ligadas ao gerenciamento  e operacionalização de um hotel.",
    "Objetivos":"Compreender os conceitos, o histórico e a tipologia da hotelaria.  Conhecer as características físicas e de serviços e da estrutura organizacional dos meios  de hospedagem.  Analisar a operacionalidade dos setores da área de hospedagem.  Refletir sobre o sistema de classificação hoteleira e a legislação vigente.  Vivenciar e observar as características físicas e de serviços e a estrutura organizacional dos  meios de hospedagem, bem como a operacionalidade dos setores da área de hospedagem,  por meio de visita técnica.",
    "Conteúdo Programático":"1. Aspectos históricos e evolução da Hotelaria.  2. Cadeias hoteleiras internacionais.  3. Tipos de hospedagem e seus padrões diferenciados.  4. Novos Conceitos de hospedagem (hotelaria verde e hotéis inteligentes).  5. Termos Técnicos.  6. Setores da Hotelaria.  7. Tipos e capacidade de unidades habitacionais.  8. Ficha Nacional de Hóspedes (FNRH) e Boletim de Ocupação Hoteleira (BOH).  9. Formas de Administração Hoteleira.  10. Departamentos  Hoteleiros:  Reservas,  Departamento  de  Hospedagem,  Departamento de A&B, Departamento de RH, Departamento Administrativo e  Departamento de Marketing.  11. Visitas técnicas a hotéis, restaurantes e navios de cruzeiro e submissão de relatórios  contendo: planejamento, objetivos, observação, conclusões e sugestões a que se  chegou no decorrer dessas visitas.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"5º Semestre",
    "Carga Horária Total":71
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Políticas Públicas em Turismo",
    "Código":"POPT5",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O presente componente curricular visa a compreender os princípios das políticas  públicas de modo geral e as voltadas ao fenômeno turístico no Brasil, possibilitando ao  educando refletir, analisar e propositar políticas de fomento e desenvolvimento do turismo.",
    "Objetivos":"Compreender o fazer político, o processo de formulação de políticas e os atributos de uma  política pública.  Reconhecer as políticas e planos de turismo implementados no Brasil.  Analisar políticas públicas locais de turismo.  Discutir as contribuições e prejuízos das Políticas Públicas de Turismo ao desenvolvimento  da atividade turística.  Analisar a articulação das Políticas Públicas de Turismo nas diferentes instâncias de  governo, no Brasil.  Refletir sobre os processos de implementação das Políticas Públicas de Turismo em vigor,  no Brasil.",
    "Conteúdo Programático":"1. O significado da política.  2. Estado e política.  3. Conceitos, características e objetivos da política pública.  4. Atores políticos e recursos de poder.  5. O processo decisório.  6. Agenda pública e agenda governamental.  7. Formulação de políticas.  8. Modelos de tomada de decisão: racionalista e incrementalista.  9. Definições de política de turismo.  10. As responsabilidades do setor público.  11. Condicionantes políticos para um turismo sustentável.  12. Órgãos Nacionais de Turismo.  13. Política e planejamento do turismo.  14. Política de turismo e participação cidadã.  15. Evolução das políticas de turismo no Brasil.  16. Política e Planos Nacionais de Turismo: diretrizes, metas e programas  17. Programa de Desenvolvimento do Turismo – Prodetur.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  18. Programa Nacional de Municipalização do Turismo – PNMT.  19. Política Nacional de Turismo –",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"5º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Espanhol Instrumental I",
    "Código":"ESPT5.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"A disciplina de língua espanhola para o curso de Bacharelado em Turismo do Campus  Cubatão visa a complementar a formação acadêmica de seu corpo discente, haja vista a  crescente demanda do mercado de trabalho por esse idioma, especialmente no campo de  Turismo e Hotelaria no Brasil.",
    "Objetivos":"Proporcionar ao aluno da área de Turismo o conhecimento de estruturas básicas da língua  espanhola para a comunicação em seu campo de atuação profissional.  Capacitar o aluno a compreender e produzir enunciados orais e escritos em língua  espanhola por meio de um enfoque intercultural, desenvolvendo, assim, a competência  comunicativa e a visão crítica diante da variedade linguística e cultural dos países  hispânicos.",
    "Conteúdo Programático":"1. Funções comunicativas: comunicar-se em aeroportos e hotéis: pedir e dar  informações de itinerários; utilizar formas de cortesia; reconhecer e preencher  documentos; fazer pedidos e reclamações na recepção de um hotel; discutir sobre  os diferentes tipos de hospedagem, preços e serviços. Comunicar-se em bares e  restaurantes: fazer pedidos; conversação telefônica; escrever e-mail. Recomendar  atividades a um determinado público.  2. Conteúdo gramatical: o alfabeto e sua pronúncia; uso de Túe Usted; verbos no  Presente do Indicativo; numerais, dias da semana e meses; usos de Tenere Haber;  verbo Gustar; OD, OI; imperativo; verbos no futuro. Vocabulário específico de  turismo: hotelaria, aeroporto, agências de viagens, meio ambiente e alimentos.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"5º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Técnicas Publicitárias",
    "Código":"PUBT5.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Nesta disciplina, o discente compreenderá como ocorre o processo de criação de uma  campanha publicitária, tipos de campanhas existentes, recursos e técnicas utilizados",
    "Objetivos":"Auxiliar a formação de uma base sobre Criação Publicitária.",
    "Conteúdo Programático":"1. Briefing de campanha publicitária.  2. Técnicas de peças publicitárias impressas.  3. Técnicas de peças publicitárias online.  4. Técnicas de outros tipos de peças publicitárias.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"5º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Planejamento e projetos em turismo",
    "Código":"PPTT5.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"5",
    "Total de aulas":"95",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O presente componente curricular permite ao discente ter ciência das etapas de  produção e aplicação de projetos turístico como meio de desenvolver a capacidade de  analisar, avaliar e propor intervenções em localidades e projetos turismos nas múltiplas  esferas públicas e privadas.",
    "Objetivos":"Conhecer os processos de elaboração, implementação e avaliação de programas e  projetos turísticos.  Analisar programas e projetos turísticos, avaliando sua aplicabilidade e seus impactos  econômicos, socioculturais e ambientais.  Elaborar e apresentar projetos turísticos  Elaborar pareceres técnicos de projetos turísticos",
    "Conteúdo Programático":"1. Prática de desenvolvimento de projetos turísticos: elaboração, implementação,  controle e avaliação de projeto turístico; projetos de investimento público e privado;  origem e classificação dos projetos.  2. Investimentos e financiamentos em turismo: fontes de financiamento para projetos  turísticos; financiamentos reembolsáveis e não reembolsáveis; linhas de  financiamento; projetos de ativos tangíveis e intangíveis.  3. Estudo dos projetos de turismo: projetos de turismo dos governos municipal, estadual  e federal; projetos de iniciativa privada; elaboração de projetos de instituições e  órgãos de turismo; componentes do roteiro de elaboração de projetos.  4. Avaliação de programas e projetos turísticos: componentes básicos para  apresentação de projetos; estudos de mercado; cronogramas físico e financeiro;  infraestrutura e viabilidade econômica; elaboração de um parecer técnico de projeto  turístico.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"5º Semestre",
    "Carga Horária Total":71
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Pesquisa em Turismo",
    "Código":"PEQT5.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Apresentação das principais técnicas de pesquisa de mercado aplicadas ao turismo.  Construção de arcabouço teórico e conhecimento de casos práticos que possibilitem ao  aluno planejar e desenvolver levantamentos e análises de mercado, como forma de apoio  à tomada de decisão nas empresas e nos destinos turísticos.",
    "Objetivos":"Capacitar o aluno a: identificar a necessidade de realização de pesquisas; realizar  pesquisas em fontes secundárias; planejar e conduzir pesquisas quantitativas no turismo;  tabular dados quantitativos; analisar dados quantitativos.",
    "Conteúdo Programático":"1. Introdução à pesquisa de mercado no turismo: o que é pesquisa de mercado;  objetivos da pesquisa de mercado no turismo; principais tipos de pesquisa de  mercado no turismo; pesquisa qualitativa; pesquisa por observação.  2. Pesquisa secundária: técnicas de pesquisa secundária; fontes de informação em  turismo.  3. Pesquisa quantitativa: casos de pesquisa quantitativa em turismo; planejamento da  pesquisa quantitativa; elaboração de instrumentos de pesquisa quantitativa no  turismo; técnicas de amostragem; coleta de dados; checagem e digitação de dados.  4. Pesquisa qualitativa: casos de pesquisa qualitativa em turismo; planejamento da  pesquisa qualitativa; observações em campo; amostra qualitativa.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"5º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Elaboração de projetos de pesquisa",
    "Código":"EPPT6.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Apresentação dos itens do TCC – Trabalho de Conclusão de Curso. Normas da ABNT.  Utiliza-se da apresentação formal e da normalização técnica de trabalhos científicos,  segundo a ABNT, contribuindo na elaboração de documentos acadêmicos.",
    "Objetivos":"Estimular a realização de pesquisas e experimentos científicos na área de  Turismo.  Desenvolver o Trabalho de Conclusão de curso.  Redação do Trabalho de Conclusão de curso.",
    "Conteúdo Programático":"1. Capa: Nome do Instituto, Nome do Aluno, Tema do Trabalho, Cidade e Data.  2. Folha de rosto: Nome do Instituto, Nome do Aluno, Tema do Trabalho, Nome do  Curso, Instituto (IFSP), Nome da disciplina e do supervisor do trabalho, Área de  Concentração, Cidade e data.  3. Folha de avaliação.  4. Agradecimentos (opcional)  5. Dedicatória (opcional)  6. Epígrafe (opcional)  7. Resumo  8. Abstract  9. Sumário  10. Relação de tabelas, gráficos e figuras.  11. Introdução: 1. Delimitação da área, problema. 2. Tema, objetivos. 3 Justificativa,  pressupostos teóricos. 4. Procedimentos metodológicos. 5. Estrutura do trabalho.  12. Desenvolvimento do trabalho\/ Corpo do trabalho: Dividido em capítulos, seguindo  orientação do docente.  13. Capítulo I do TCC.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"6º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Espanhol Instrumental II",
    "Código":"ESPT6.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"A disciplina de língua espanhola para o curso Superior de Bacharelado em Turismo  do Campus Cubatão visa a complementar a formação acadêmica de seu corpo discente,  haja vista a crescente demanda do mercado de trabalho por esse idioma, especialmente no  campo de Turismo e Hotelaria no Brasil.",
    "Objetivos":"Proporcionar ao aluno da área de Turismo o conhecimento de estruturas da língua  espanhola para a comunicação em seu campo de atuação profissional.  Ampliar o conhecimento linguístico e cultural dos alunos em situações profissionais, por  meio de atividades comunicativas e práticas em sala de aula, aprimorando, assim, a  compreensão e a expressão oral e escrita em língua espanhola.",
    "Conteúdo Programático":"1. Funções comunicativas: comunicar-se em uma agência de viagens: o trabalho dos  agentes de viagens, negociação com os clientes; elaborar ofertas; entender as  tarefas de um guia de turismo; responder com argumentos a uma reclamação; ler  textos sobre o turismo e elaborar programas seguindo modelos.  2. Conteúdo gramatical: verbos no Pretérito Imperfecto, Perfecto, Indefinido. Frases  condicionais; verbo no Pretérito Imperfecto Subjuntivo; uso de preposições;  conectores; pronomes e frase de Relativo. Léxico de meio ambiente, passeios,  ampliando o conhecimento de funções em uma agência de viagens.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"6º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Captação de recursos para turismo e eventos",
    "Código":"CART6.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"5",
    "Total de aulas":"95",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular Captação de Recursos apresenta as alternativas disponíveis  para captação de recursos da iniciativa privada ou públicos – municipais, estaduais ou  federais –, discute o tema das transferências voluntárias definidas na Lei de  Responsabilidade Fiscal, bem como a entrega de recursos correntes ou de capital, a título  de cooperação, auxílio ou assistência financeira. Além disso, apresenta casos de  financiamento internacional de projetos públicos por meio de organizações públicas ou  privadas e debate como esses procedimentos somados podem ser uma alavanca ao  desenvolvimento turístico e social local.",
    "Objetivos":"Identificar oportunidades de negócios, pertinentes a fatos e\/ou situações novas do  mercado.  Levantar datas e situações possíveis para alavancar negócios.  Identificar etapas para a elaboração de projeto para captação de recursos.  Identificar e estabelecer contato com potenciais patrocinadores apoiadores e  parceiros visando a captar recursos.  Participar da elaboração de projetos para captação de recursos, utilizando  metodologia adequada a fim de atingir o objetivo.  Elencar repercussão de eventos similares realizados, construindo portfólio, visando  a criar oportunidades para outros eventos.  Trabalhar com a sociedade em busca de soluções para situações de grande potencial  turístico, mas sem recursos para implantação de projetos.  Situar os conceitos de cidadania e responsabilidade social.",
    "Conteúdo Programático":"1. Conceitos; retrospectiva histórica da Captação de Recursos; Situação Atual do  FundRaising (Captação de Recursos) no Brasil.  2. A importância da Captação de Recursos.  3. Legislação pertinente às organizações sem fins lucrativos (ONGs).  4. Incentivos Fiscais – Lei Audiovisual – Lei Federal n.º 8.685.  5. A importância da Captação de Recursos Internos e Externos; Motivação para doar;  Gerenciamento das informações.  6. Criação de banco de dados  7. Constituição da ABCR.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  8. Os diferentes papéis na Captação de Recursos: Cargos; Pessoal da Assessoria de  desenvolvimento.  9. Elementos chave de Captação: Comunicação; Entrevistas e ajustes; Convívio,  cultivo e fidelização; Benefícios; Relatório Anual e Informativos.  10. Ética, valores e cultura; especificidades do conceito de responsabilidade social.  11. Planejamento, Plano de Ação e Monitoramento.  12. Financiamento para franquias.  13. O processo privado de concessão de crédito; Financiamentos de Projetos.  14. Assessoria e desenvolvimento, atividades, tamanho, tipos de captação e orçamento.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"6º Semestre",
    "Carga Horária Total":71
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Cerimonial, protocolo e etiqueta",
    "Código":"CPET6.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"A disciplina de Cerimonial e Protocolo deverá funcionar como um código universal,  estabelecendo uma linguagem de fácil compreensão, um conjunto de atitudes que podem  facilitar a convivência no ambiente de trabalho. Práticas diretamente relativas ao campo  profissional das Relações Públicas, Cerimonial e Protocolo que regem as relações e a  civilidade em todas as instâncias do Poder Público serão apresentadas aos alunos por meio  de atividades dinâmicas e participativas.",
    "Objetivos":"Reconhecimento e aplicação do conjunto de regras, normas e estilo no trato cerimonioso  entre as pessoas.  Demonstrar o protocolo e os símbolos nacionais.  Utilização dos trajes e convites adequados em qualquer ocasião e ambiente.",
    "Conteúdo Programático":"1. Conceitos e definições: Cerimonial, Protocolo e Etiqueta.  2. Símbolos nacionais.  3. Cerimonial e protocolo: a ótica de relações públicas.  4. Funções do cerimonial  5. Normas protocolares públicas  6. Ordem de precedência  7. Técnicas de cerimonial e protocolo  8. Tipologias de etiqueta  9. Protocolo e Cerimonial: regras à mesa  10. Formas de Tratamento \/ Convites \/Trajes  11. Boas Maneiras  12. Comunicação, oratória e discursos  13. Roteiros e scripts  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"6º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"História da Arte",
    "Código":"ARTT6.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"A disciplina faz recortes sobre o universo da arte e aborda algumas das manifestações  artísticas estrangeiras e brasileiras que se relacionam com a cultura atual, o patrimônio e o  turismo: Antiguidade clássica, Idade Média, Renascimento, Barroco; séc. XVIII e XIX na  Europa: Academicismo, rupturas do Impressionismo e aberturas da modernidade.  Manifestações de arte não ocidentais. Séc. XX e movimentos da arte moderna. A Semana  de 22. Pop Art. Arte contemporânea.",
    "Objetivos":"Compreender as especificidades das obras, relacionadas aos respectivos contextos  sociais e históricos; bem como reconhecer a arte como forma de conhecimento sensível.  Fruir e valorizar a diversidade das produções artísticas do passado e do presente.  Relacionar diferentes produções e perceber retomadas, inovações e rupturas dos modos  de produção e padrões estéticos.  Desenvolver a capacidade de pesquisa e análise crítica acerca do universo artístico.  Compreender a importância da percepção e interpretação das manifestações e  movimentos artísticos para o turismo histórico-cultural.  Valorizar os museus e instituições culturais e o patrimônio cultural e artístico da  humanidade em sua diversidade.",
    "Conteúdo Programático":"1. Grécia e Roma: o estabelecimento do clássico.  2. Idade Média: arquitetura das catedrais.  3. Renascimento: retomada do belo clássico.  4. Barroco na Europa e no Brasil  5. Academicismo, Neoclassicismo e Romantismo.  6. Séc. XIX: abertura à arte moderna: Impressionismo, Realismo.  7. Arte fora dos cânones ocidentais: arte afro e indígena.  8. Séc. XX e alguns dos principais movimentos artísticos europeus.  9. A Semana de 22 como marco do modernismo no Brasil e valorização dos temas  nacionais.  10. Pop Arte e arte contemporânea: rupturas, ampliações das propostas artísticas,  temas atrelados às problemáticas da cultura contemporânea.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"6º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Turismo sustentável e meio ambiente",
    "Código":"TMAT6.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"5",
    "Total de aulas":"95",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Nesta disciplina, serão trabalhados conceitos de Meio Ambiente, bem como princípios  e objetivos da Educação Ambiental. Pretende-se apresentar a relação entre o Turismo e  Meio Ambiente, Turismo Sustentável, os impactos ambientais da atividade turística, além  de legislações específicas para proteção e conservação do meio ambiente.",
    "Objetivos":"da Educação Ambiental. Pretende-se apresentar a relação entre o Turismo e  Meio Ambiente, Turismo Sustentável, os impactos ambientais da atividade turística, além  de legislações específicas para proteção e conservação do meio ambiente.",
    "Conteúdo Programático":"1. Introdução à Ecologia \/ Educação  Ambiental. População, Comunidade,  Ecossistemas,  Biosfera.  Ciclos  Biogeoquímicos e equilíbrio ambiental.  2. Importância dos fatores bióticos e abióticos nos ecossistemas.  3. Produtores, consumidores, decompositores, fluxo de matéria e energia  nos ecossistemas.  4. Ecossistemas em equilíbrio.  5. Impactos ambientais antropogênicos e não-antropogênicos.  6. Chuva ácida, Efeito estufa, camada de ozônio, aquecimento global.  7. Ecossistemas Brasileiros.  8. Biodiversidade em ecossistemas brasileiros.  9. Interferência humana na recuperação de ecossistemas.  10. Turismo sustentável:  11. Tipologia do turismo.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  12. Conceitos de sustentabilidade.  13. Possibilidades e limites.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"6º Semestre",
    "Carga Horária Total":71
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Formatação de Roteiros Turísticos",
    "Código":"FRTT6.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"4",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O componente curricular pretende desenvolver competências e habilidades  relacionadas ao planejamento e operacionalização de roteiros turísticos, propiciando ao  discente a oportunidade de compreender todos os elementos que integram desde a  concepção de um roteiro turístico, até a sua efetiva comercialização, identificando destinos,  custos, logística, precificação, terminologias, reservas, bem como os stakeholders  necessários para a sua realização.",
    "Objetivos":"Compreender a estrutura de roteiros turísticos e pacotes turísticos.  Compreender o processo de elaboração de um pacote turístico.  Capacitar na elaboração do preço de venda de um pacote turístico.  Simular a elaboração de contratos de adesão de pacotes turísticos.  Compreender técnicas básicas de guiamento.",
    "Conteúdo Programático":"1. Roteiros turísticos: conceitos, tipos, cuidados na elaboração.  2. Promoção da acessibilidade em roteiros turísticos.  3. Pacotes Turísticos: destino novo, planejamento e elaboração, preço de venda,  execução e operação, técnicas de guiamento.  4. Roteiro técnico e roteiro de venda.  5. Contratos de Adesão.  6. Operacionalização de Roteiros.  7. Planejamento e Cotização de roteiros.  8. Serviços comercializados. Relacionamento com os fornecedores.  9. Terminologia, alfabeto fonético, codificação e decodificação.  10. Noções de reserva de meios de hospedagem, transportes e outros serviços.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  Seguro de viagem.  11. Voucher.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"6º Semestre",
    "Carga Horária Total":57
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Orientação de Trabalhos Acadêmicos.",
    "Código":"OTAT7.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Elaboração do TCC – Trabalho de Conclusão de Curso. Normas da ABNT. Utiliza-se  da apresentação formal e da normalização técnica de trabalhos científicos segundo a ABNT,  contribuindo na elaboração de documentos acadêmicos.",
    "Objetivos":"Estimular a realização de pesquisas e experimentos científicos na área de  Turismo.  Redação do Trabalho de Conclusão de Curso",
    "Conteúdo Programático":"Não informado",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"7º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo.",
    "Componente curricular":"Espanhol Instrumental III.",
    "Código":"ESPT7.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"Estrutura do idioma, fluência e conhecimentos mais específicos e sofisticados do  vocabulário técnico da área de agenciamento e turismo por meio das habilidades (ler,  escrever, ouvir e falar) referentes à compreensão do espanhol como língua estrangeira:  agências de viagens; funções dos empregados; recomendações; perfil profissional;  reservas; categorias hoteleiras e serviços; transportes; bilhetes de viagem; itinerário  turístico; aluguel de carros; oferta cultural; elaboração de programas e ofertas para agências  de viagem; construção pragmático-discursiva do produto turístico.",
    "Objetivos":"Compreender e expressar atos de fala relacionados ao universo discursivo do  Turismo, a partir da compreensão pragmático-discursiva do produto turístico e da  compreensão do uso persuasivo da língua na relação com comunidades de realidade  sociocultural diferente da sua, numa perspectiva crítica.  Viabilizar informações sobre meios de transportes.  Viabilizar informações sobre destinos turísticos e itinerários.",
    "Conteúdo Programático":"1. Gramática: recursos para descrever e comparar, frases em passiva, orações  subordinadas; comparativos e superlativos.  2. Comunicação: estruturas para expressar insatisfação, impaciência e irritação;  expressões de cortesia; estratégias de persuasão (metáfora, metonímia, eufemismo  e hipérbole), dados pessoais.  3. Vocabulário: transportes; bilhetes de viagem; horários, comidas, cultura, geografia,  monumentos, informações turísticas, itinerário turístico, excursiones.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"7º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Libras",
    "Código":"LIBT7.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"A disciplina apresenta os conceitos básicos em Língua Brasileira de Sinais (LIBRAS)  e habilita para a comunicação, ampliando as oportunidades profissionais e sociais,  agregando valor ao currículo e favorecendo a acessibilidade social. Discute questões  socioambientais no contexto das LIBRAS. A carga horária de deve ser destinada às  discussões e elaboração de projetos sobre a utilização da LIBRAS nas diferentes situações  relacionadas ao turismo.",
    "Objetivos":"Apresentar LIBRAS como instrumento de interação surdo\/ouvinte, buscando a  ampliação das relações profissionais e sociais.  Dominar o uso dos sinais simples e compreender a importância da expressão facial  e corporal em LIBRAS.  Compreender o desenvolvimento histórico e cultural da comunidade surda brasileira  e da educação de surdos no país.  Compreender o processo de aquisição de linguagem.",
    "Conteúdo Programático":"1. Sinais e expressões para: atendimento ao turista, recepção em hotéis, alfabeto  manual, números cardinais, cumprimento, atribuição de sinal da pessoa, calendário (dia da  semana, meses); cores, família clima, animais domésticos, casa, profissões (principais),  horas, características pessoais (físicas), alimentos, frutas, meios de transporte, pronomes,  verbos contextualizados.  2. História da educação dos surdos e da LIBRAS.  3. A LIBRAS no contexto do planejamento e operacionalização do turismo.",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"7º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Turismo e relações internacionais",
    "Código":"TRIT7.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"4",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O presente componente curricular apresenta os principais aspectos que integram o  turismo dentro do aspecto mais abrangente das Relações Internacionais, desenvolvendo  competências e habilidades que permitam ao discente identificar as questões básicas  ligadas ao direito internacional, tais como acordos de integração, acordos comerciais, regras  ligadas à aviação e demais meios de transporte, e ainda, direitos e deveres dos turistas em  território estrangeiro, como vistos e passaportes.",
    "Objetivos":"Conhecer os conceitos básicos e introdutórios das relações internacionais.  Compreender a aplicação das normas e princípios e leis que solucionam os conflitos de  normas no espaço.  Fornecer diretrizes sobre utilização das fontes de direito internacional e de direito interno  em relação ao turismo.  Fornecer elementos de análise e compreensão sobre o direito econômico e monetário  aplicado ao turismo.  Compreender os Acordos de Integração e as Zonas de Livre-comércio.  Aprofundar a Declaração Universal, Pactos e acordos internacionais.  Análise e compreensão do Estatuto do estrangeiro.  Abarcar os atos jurídicos praticados por turistas brasileiros no exterior e atos jurídicos  praticados por turistas estrangeiros no Brasil.  Compreender papel da diplomacia no turismo.  Conhecer as regras de entrada, permanência e retirada do turista no Brasil e do turista  brasileiro no exterior.",
    "Conteúdo Programático":"1. Noções introdutórias sobre direito e relações internacionais.  2. Norma de Direito Internacional Privado e seu funcionamento.  3. Aplicação da lei estrangeira.  4. Nacionalidade, apatrídias e a proteção de estrangeiros (asilo e o estatuto dos  refugiados)  5. O asilo e a proteção dos refugiados, Direitos e Deveres dos Estados.  6. Aplicação da lei no tempo e no espaço.  Curso Superior de Bacharelado em Turismo - Campus Cubatão  IFSP-2022  7. Atos Jurídicos praticados por turistas brasileiros no exterior.  8. Atos Jurídicos praticados por turistas estrangeiros no Brasil.  9. Declaração Universal, pactos e acordos internacionais.  10. Proteção diplomática.  11. Direito Internacional Econômico.  12. Contratos Internacionais do Comércio.  13. Direito Internacional Monetário.  14. Acordos de Integração e as zonas de livre-comércio.  15. O Direito Internacional Penal do Indivíduo  16. A Conciliação Internacional: o papel da diplomacia no turismo  17. Entrada, permanência e retirada do estrangeiro no Brasil  18. Entrada, permanência e retirada do turista brasileiro no exterior",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"7º Semestre",
    "Carga Horária Total":57
  },
  {
    "Curso":"Bacharelado em Turismo",
    "Componente curricular":"Metodologias de ensino e aprendizagem em turismo",
    "Código":"MEAT7.",
    "Tipo":"Não informado",
    "Núcleo":"Não informado",
    "Número de docentes":"Não informado",
    "Número de aulas semanais":"5",
    "Total de aulas":"95",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não informado",
    "Ementa":"O presente componente curricular desenvolve competências e habilidades ligadas à  docência em turismo, abordando aspectos como a aprendizagem de adultos, estratégias de  ensino e aprendizagem, avaliação da aprendizagem, entre outros elementos. Permite ao  discente identificar ainda este campo de atuação profissional, tanto em nível técnico, quanto  superior.",
    "Objetivos":"Possibilitar ao aluno a compreensão das teorias de ensino\/aprendizagem que  embasarão a prática docente.",
    "Conteúdo Programático":"1. Teorias de ensino\/aprendizagem.  2. Andragogia.  3. Fundamentos, concepções e práticas do ensino em Turismo.  4. Métodos e técnicas de avaliação de ensino\/aprendizagem em Turismo",
    "original_source_pdf":"PPC-turismo2022IFSP.pdf",
    "Período Educacional":"7º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Tecnologia em Análise e Desenvolvimento de Sistemas",
    "Componente curricular":"Comunicação e Expressão",
    "Código":"CBTCEEX",
    "Tipo":"Obrigatório",
    "Núcleo":"Não informado",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Geral \/ Temas transversais",
    "Ementa":"O componente curricular apresenta uma visão geral do fenômeno da linguagem, nas suas  expressões orais e escritas, propondo uma revisão de conceitos gerais da gramática  normativa e da escrita acadêmica. Para isso, discute problemas de gramática e produção  de texto articulando noções teóricas com exemplos reais de uso, de forma a abordar  pontos importantes para o letramento acadêmico, como concordância, coesão textual e  estrutura de textos argumentativos e acadêmicos. A disciplina aborda, ainda, a literatura  indígena no Brasil, apresentando breve histórico dos povos e elementos culturais dos  indígenas brasileiros, mantendo foco na produção recente de autores indígenas bem  como produção literária em países africanos de língua portuguesa, em seu contexto  histórico e social, discutindo o desenvolvimento da língua portuguesa na África,  apontando particularidades e usos que interessam à literatura, assim como algumas  relações com o Brasil, permeando as relações étnico-raciais e história e cultura afro- brasileira",
    "Objetivos":"-  Refletir sobre a relação da leitura e da escrita com o mundo;  -  Pensar sobre a própria língua e fazer uso das normas da língua culta, padrão, de  prestígio social, quando a situação assim o exigir;  -  Expressar-se por meio da Língua Portuguesa de maneira harmônica, clara e concisa,  nas modalidades escrita e oral;  -  Aprofundar o conhecimento acerca da estruturação de textos, observando as  tipologias e multiplicidades de gêneros textuais com os quais trabalharão no dia a  dia;  -  Distinguir um texto acadêmico de um texto não acadêmico;  -  Saber revisar, refletir e reelaborar os seus próprios textos;  -  Conhecer aspectos gerais da cultura e da história indígena no Brasil, através da  análise de obras de autores indígenas e os recursos estilísticos da linguagem, assim  como sua relação com a cultura e posicionamentos políticos;  -  Debater a influência da cultura afro-brasileira na literatura brasileira;  -  Refletir acerca do português falado nos países africanos de língua portuguesa.",
    "Conteúdo Programático":"-  Linguagem e variação;  -  Linguagem verbal e não verbal;  -  Língua oral e língua escrita;  -  Norma gramatical e variedades do português brasileiro;  -  Revisão gramatical: concordância nominal e verbal;  -  Revisão gramatical: regência nominal e verbal;  -  Revisão gramatical: acentuação e pontuação;  -  Noção de texto: textualidade, coesão e coerência;  -  Tipologia textual;  -  Gêneros textuais;  -  Texto argumentativo;  -  Gêneros acadêmicos: resumo e resenha;  -  Gêneros acadêmicos: apresentação oral e artigo;  -  Gêneros acadêmicos: relatório e monografia;  -  História dos povos indígenas no Brasil;  -  Literatura indígena: identidade e resistência;  -  A língua portuguesa e a história colonial africana;",
    "original_source_pdf":"PPC_ADS_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Tecnologia em Análise e Desenvolvimento de Sistemas",
    "Componente curricular":"Fundamentos de Matemática",
    "Código":"CBTFMAT",
    "Tipo":"Obrigatória",
    "Núcleo":"Não informado",
    "Número de docentes":"1",
    "Número de aulas semanais":"4",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não há grupos de conhecimentos essenciais para este item no currículo de referência.",
    "Ementa":"O componente curricular aborda os conteúdos matemáticos que servem como base para  o entendimento de conceitos computacionais, bem como, auxiliam o desenvolvimento do  raciocínio lógico-matemático, de forma a facilitar a aprendizagem de conceitos  computacionais.",
    "Objetivos":"-  Conhecer as ferramentas de lógica matemática;  -  Reconhecer e utilizar a linguagem algébrica necessária para expressar a relação  entre grandezas e modelar situações-problema, construindo modelos descritivos  de fenômenos, fazendo conexões dentro e fora da Computação;  -  Representar e interpretar uma tabela de números como uma matriz, identificando  seus elementos, usos e propriedades;  -  Calcular o determinante de matrizes e utilizá-lo para a discussão de sistemas  lineares;  -  Identificar equações lineares e interpretá-las geometricamente na busca de uma  solução;  -  Estudar, classificar e resolver sistemas lineares por meio de diferentes processos;  -  Incorporar conceitos básicos da Teoria de Grafos e apresentar problemas que  podem ser representados por grafos",
    "Conteúdo Programático":"-  Introdução à Lógica Matemática.  -  Conjuntos.  -  Funções.  -  Matrizes.  -  Determinantes.  -  Sistemas Lineares.  -  Grafos e Árvores.",
    "original_source_pdf":"PPC_ADS_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":57
  },
  {
    "Curso":"Tecnologia em Análise e Desenvolvimento de Sistemas",
    "Componente curricular":"História da Ciência e da Tecnologia",
    "Código":"CBTHCTC",
    "Tipo":"Obrigatória",
    "Núcleo":"Não informado",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Geral \/ Temas Transversais",
    "Ementa":"A disciplina trata dos conceitos científicos e suas aplicações tecnológicas ao longo da  história, analisadas sob o enfoque da Educação, da Ciência e da Tecnologia e suas relações  com o desenvolvimento econômico-social, tratando também da temática da Educação  das Relações Étnicos Raciais e História e Cultura Afro-Brasileira e Indígena.",
    "Objetivos":"- Conhecer e considerar os processos históricos vinculados ao desenvolvimento da  ciência e da tecnologia para a apropriação de um saber articulado que facilite a  ação reflexiva, autônoma, crítica e criativa;  - Refletir sobre os impactos da ciência e da tecnologia nas várias etapas da história  da civilização;  - Analisar a Ciência e a Tecnologia no âmbito do desenvolvimento econômico-social  atual e considerar a influência da cultura afro-brasileira e indígena",
    "Conteúdo Programático":"- A história do universo, a história da vida e a história do ser humano, da inteligência  e da consciência;  - Relações entre ciência e tecnologia;  - Os papéis das revoluções científicas;  - Um breve histórico da Ciência ao longo dos tempos;  - Perspectivas para o futuro da Ciência e da Tecnologia;  - O senso comum e o saber sistematizado;  - A transformação do conceito de ciência ao longo da história;  - As relações entre ciência, tecnologia e desenvolvimento social;  - O debate sobre a neutralidade da ciência;  - Influência da história e cultura afro-brasileira e indígena na ciência e tecnologia.",
    "original_source_pdf":"PPC_ADS_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Tecnologia em Análise e Desenvolvimento de Sistemas",
    "Componente curricular":"Inglês Técnico Inicial",
    "Código":"CBTITIN",
    "Tipo":"Obrigatório",
    "Núcleo":"Não informado",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Não há grupos de conhecimentos essenciais para este item no currículo de referência.",
    "Ementa":"O componente curricular, em consonância ao Quadro Comum Europeu de Referência para  Línguas (CEFR – A1), aborda os fundamentos da língua inglesa, de forma técnica e  específica, para o desenvolvimento da habilidade de leitura dos estudantes, possibilitando  a aplicação dessa no contexto profissional em que atuarão. Busca, ainda, construir  repertório linguístico e morfossintático para a compreensão de diferentes textos em  língua inglesa.",
    "Objetivos":"- Compreender e utilizar repertório linguístico e morfossintático da língua inglesa  para possibilitar a leitura de diferentes textos;  - Empregar habilidades de localização de palavras, expressões e termos técnicos em  dicionários e glossários específicos da área a fim de aprofundar a compreensão de  textos;  - Analisar textos escritos em língua inglesa, sobretudo aqueles específicos da área  de Informática;  - Refletir a respeito da diversidade cultural anglo-americana por meio de textos,  incitando o senso crítico e promovendo uma postura cidadã.",
    "Conteúdo Programático":"- Técnicas e estratégias de leitura.  - Estratégias de aquisição de vocabulário (uso do dicionário; utilização de  ferramentas de buscas; glossários etc.);  - Formação de palavras;  - Sufixos e prefixos;  - Pronomes;  - Advérbios;  - Tempos e modos verbais;  - Vocabulário básico da língua inglesa;  - Vocabulário específico para informática.",
    "original_source_pdf":"PPC_ADS_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Tecnologia em Análise e Desenvolvimento de Sistemas",
    "Componente curricular":"Algoritmos e Programação",
    "Código":"CBTAPRG",
    "Tipo":"Obrigatório",
    "Núcleo":"Não informado",
    "Número de docentes":"2",
    "Número de aulas semanais":"4",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Específico \/ Algoritmos e Programação",
    "Ementa":"A disciplina permite o desenvolvimento do raciocínio lógico por meio do formalismo de  linguagem de programação, abordando os princípios da representação e manipulação da  informação, fornecendo a base lógica e o algoritmo para a implementação de código em  linguagem de programação de computadores.",
    "Objetivos":"-  Conhecer as ferramentas para a documentação de algoritmos;  -  Compreender o funcionamento das estruturas e instruções utilizadas em  programação de computadores bem como para o armazenamento de informação  para processamento;  -  Aprender a desenvolver algoritmos para a solução de problemas por programas de  computadores.  TECNOLOGIA EM ANÁLISE E DESENVOLVIMENTO DE SISTEMAS",
    "Conteúdo Programático":"-  Lógica de programação;  -  Programação estruturada;  -  Representações de algoritmos em diagrama de blocos (fluxograma) e português  estruturado;  -  Tipos de dados básicos;  -  Identificadores;  -  Operadores aritméticos, relacionais e lógicos;  -  Expressões lógicas e aritméticas;  -  Programação sequencial;  -  Estruturas de controle condicional e de repetição;  -  Variáveis compostas homogêneas (unidimensionais e bidimensionais) e não  homogêneas;  -  Introdução à programação modular: procedimentos, funções e passagem de  parâmetros.",
    "original_source_pdf":"PPC_ADS_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":57
  },
  {
    "Curso":"Tecnologia em Análise e Desenvolvimento de Sistemas",
    "Componente curricular":"Arquitetura de Computadores",
    "Código":"CBTARQC",
    "Tipo":"Obrigatório",
    "Núcleo":"Não informado",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Específico \/ Arquitetura de Computadores",
    "Ementa":"A disciplina faz um estudo da arquitetura de sistemas computacionais e seus  componentes, visando a compreensão do funcionamento individual e a interação entre  os componentes fundamentais.",
    "Objetivos":"-  Entender o que é e como funciona um computador;  -  Compreender os conceitos da arquitetura de um computador clássico, seus  fundamentos e os princípios de funcionamento;  -  Compreender o conceito de memória com suas diferentes funções e medidas de  desempenho;  -  Conhecer os principais mecanismos para a realização de operações de entrada e  saída bem como os principais dispositivos envolvidos.",
    "Conteúdo Programático":"-  Arquitetura de Von Neumann: memória interna, processador;  -  Barramentos, pontes norte e sul;  -  Organização de memórias: interna, externa e virtual;  -  Sistemas de numeração: binário, hexadecimal e outros;  -  Operações aritméticas em binário;  -  Coprocessador;  -  Multitarefa;  -  Segmentação e Paginação de memória;  -  Paralelismo, Arquitetura Pipeline, Super Escalar e EPIC\/VLIW;  -  Representação para tipos de dados em memória;  -  Linguagem Assembly.",
    "original_source_pdf":"PPC_ADS_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Tecnologia em Análise e Desenvolvimento de Sistemas",
    "Componente curricular":"Desenvolvimento Web",
    "Código":"CBTDWEB",
    "Tipo":"Obrigatório",
    "Núcleo":"Não informado",
    "Número de docentes":"2",
    "Número de aulas semanais":"4",
    "Total de aulas":"76",
    "Abordagem Metodológica":"Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Específico \/ Algoritmos e Programação",
    "Ementa":"A disciplina apresenta os fundamentos para a compreensão dos princípios relacionados  com o desenvolvimento de páginas para sites de Internet.",
    "Objetivos":"-  Conhecer elementos básicos estruturais e estéticos para o desenvolvimento de  páginas estáticas e dinâmicas para internet, por meio de linguagem de marcação  de hipertexto, folhas de estilo e bibliotecas de funções.  -  Compreender o funcionamento das estruturas, instruções e semântica utilizadas  em programação responsiva para sites de internet bem como a infraestrutura e  funcionamento de protocolos para servidores de hospedagens de sites.  -  Desenvolver páginas responsivas bem como hospedar sites em servidores para  internet.",
    "Conteúdo Programático":"-  Navegadores e ferramentas de desenvolvedor;  -  Servidores de hospedagem de sites;  -  Registro de domínios;  -  Protocolo FTP;  -  Estrutura básica e semântica HTML 5;  -  Formulários, tabelas, listas, imagens e URLs;  -  Versionamento com GIT;  -  Folha de Estilos em Cascata – CSS 3;  -  Responsividade com Flexbox;  -  Frameworks responsivos;",
    "original_source_pdf":"PPC_ADS_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":57
  },
  {
    "Curso":"Superior de Tecnologia em Automação Industrial",
    "Componente curricular":"Cálculo Diferencial e Integral 1",
    "Código":"CBTCDI1",
    "Tipo":"Obrigatória",
    "Núcleo":"Não informado",
    "Número de docentes":"1",
    "Número de aulas semanais":"5",
    "Total de aulas":"95",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Geral\/Cálculo.",
    "Ementa":"Este componente curricular apresenta elementos de matemática básica e o estudo de  cálculo diferencial. A primeira parte, pré-cálculo, contempla conceitos como  propriedades de potenciação e radiciação, operações com frações, fatoração de  polinômios e a representação de conjuntos numéricos. Explora também o conceito de  função e seus elementos, chegando ao estudo das funções polinomiais, trigonométricas,  exponenciais, logarítmicas e envolvendo módulo, além da resolução de equações e  inequações envolvendo estes elementos. A segunda parte apresenta o conceito de  limites, define derivada como um limite, explora o conceito de derivada como taxa de  variação. Além disto, apresenta regras práticas para derivação e aplicações das  derivadas.",
    "Objetivos":"-  Proporcionar ao estudante um embasamento de fundamentos de matemática a  serem usados no cálculo diferencial de uma variável.  -  Construir e aplicar as noções de limite e continuidade.  -  Introduzir o conceito de derivada pautado na ideia de limite e regras de  derivação de funções.  -  Explorar aplicações de derivadas.",
    "Conteúdo Programático":"-  Conjuntos numéricos: Operações entre conjuntos.  -  Conjunto dos números naturais, inteiros, racionais e reais. Intervalos reais.  -  Notação para representar conjuntos.  -  Operações com frações.  -  Polinômios e fatoração: Grau e operações.  -  Produtos notáveis. Fatoração de polinômios utilizando os produtos notáveis.  -  Equações e inequações de 1.º e 2.º graus.  -  Funções: Definição.  -  Formas de representação.  -  Domínio e imagem.  -  Estudo do sinal de funções.  -  Funções polinomiais, trigonométricas, exponenciais, logarítmicas e envolvendo  módulo.  -  Limites: Ideia intuitiva; Cálculo dos limites.  -  Propriedades Operatórias.  -  Limites laterais.  -  Limites no infinito; Limites Infinitos; Continuidade.  -  Derivadas: Definição.  -  Interpretação geométrica.  -  Taxa de variação.  -  Teorema do Valor Médio.  -  Regras de derivação: Derivada da função constante, polinomial, exponencial,  logarítmica e trigonométrica.  -  Regra do produto.  -  Regra do quociente.  -  Regra da cadeia.  -  Regra de L’Hospital.  -  Aplicações de derivadas.",
    "original_source_pdf":"PPC_AUI_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":71
  },
  {
    "Curso":"Superior de Tecnologia em Automação Industrial",
    "Componente curricular":"Desenho",
    "Código":"CBTDESA",
    "Tipo":"Obrigatória",
    "Núcleo":"Não informado",
    "Número de docentes":"2",
    "Número de aulas semanais":"5",
    "Total de aulas":"95",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Geral\/Desenho Técnico.",
    "Ementa":"A disciplina aborda a avaliação de recursos de informática e suas aplicações ao desenho,  além da interpretação de desenhos, representações gráficas e projetos. Também aborda  a elaboração de desenhos utilizando o sistema CAD.",
    "Objetivos":"-  Compreender alguns princípios estabelecidos nas normas para desenho técnico.  -  Saber visualizar peças simples em perspectiva.  -  Saber representar peças por meio de três vistas ortogonais.  -  Conhecer técnicas simples para desenho em perspectiva.  -  Saber desenhar em duas dimensões (2D) utilizando comandos básicos de  software CAD.  -  Utilizar os comandos da área de trabalho, visualização, modificação,  dimensionamento e criação de objetos.",
    "Conteúdo Programático":"-  Normas e convenções: formatos, letras e algarismos, legendas, linhas e escalas.  -  Desenho geométrico (construções e aplicações).  -  Projeção ortogonal.  -  Vistas ortográficas.  -  Normas para projeções ortogonais no primeiro diedro.  -  Leitura e interpretação de desenho técnico.  -  Perspectivas.  -  Perspectiva isométrica.  -  Hachuras. Cortes e seções.  -  Cotas.  -  Desenho técnico auxiliado por computador.  -  Introdução ao editor gráfico: características, área gráfica, configuração e  definições, barras de ferramentas, linha de comando.  -  Coordenadas absolutas, relativas e polares.  -  Comandos de visualização.  -  Comandos de precisão (object snap).  -  Comandos de criação de objetos: linha, círculo, polígono, retângulo, arco.  -  Comandos de modificação de objetos: copiar, aparar, apagar, mover, espelhar,  rotacionar, explodir, unir etc.  -  Comandos de edição de textos.  -  Comandos de dimensionamento.  -  Propriedades (tipos de linhas, cores e espessura).  -  Camadas de trabalho (layers).",
    "original_source_pdf":"PPC_AUI_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":71
  },
  {
    "Curso":"Superior de Tecnologia em Automação Industrial",
    "Componente curricular":"Introdução à Automação Industrial",
    "Código":"CBTIAIN",
    "Tipo":"Obrigatória",
    "Núcleo":"Não informado",
    "Número de docentes":"1",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Não se aplica.",
    "Ementa":"A disciplina apresenta a Profissão do Tecnólogo, suas atribuições, atividades, a  legislação específica e regulamentação profissional. Realiza uma análise do mercado de  trabalho permitindo e permite o estudo básico de processos: siderúrgico, petroquímico  e permite introduzir a aplicação da automação a estes processos.",
    "Objetivos":"Conhecer os principais aspectos relativos à carreira do tecnólogo e obter uma base  conceitual para contextualizar as disciplinas específicas do curso.",
    "Conteúdo Programático":"-  Introdução da Automação Industrial.  -  Conselhos Regionais - CRQ e CREA.  -  Mercado de trabalho para o Tecnólogo em Automação e Controle de Processos.  -  Ciclo de um produto.  -  Eletricidade e Eletrônica.  -  Sensores.  -  Atuadores e válvulas.  -  Conceitos básicos sobre controle de processos.  -  Conceitos básicos sobre controladores lógicos programáveis.  -  Conceitos básicos sobre redes industriais e sistemas supervisórios.  -  Conceitos básicos sobre automação da manufatura.",
    "original_source_pdf":"PPC_AUI_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Superior de Tecnologia em Automação Industrial",
    "Componente curricular":"Programação de Computadores 1",
    "Código":"CBTPRC1",
    "Tipo":"Obrigatória",
    "Núcleo":"Não informado",
    "Número de docentes":"2",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica e Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Geral\/Programação.",
    "Ementa":"Desenvolver a programação de computadores conhecendo e estudando os principais  comandos e operadores para poder desenvolver programas e aplicativos necessários à  automação industrial.",
    "Objetivos":"-  Introduzir os conceitos básicos de uma linguagem de programação estruturada.  -  Habilitar o aluno a implementar soluções tecnológicas através da utilização da  linguagem de programação estruturada.  -  Utilizar a linguagem de programação estudada para o desenvolvimento de  aplicações básicas.",
    "Conteúdo Programático":"-  Introdução à programação de computadores.  -  Características de uma linguagem de programação estruturada.  -  Conhecendo o ambiente de programação.  -  Tipos de Variáveis.  -  Operadores matemáticos.  -  Operadores relacionais.  -  Estruturas de Decisão.  -  Estruturas de Repetição.  -  Estrutura de Controle com Múltipla Escolha.  -  Strings, Arrays e Matrizes.  -  Funções de manipulação de Strings.  -  Inter-relação entre tecnologias computacionais e o direito à informação, à  privacidade, ao conhecimento e à inclusão digital.  -  Noções LGPD.",
    "original_source_pdf":"PPC_AUI_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":42
  },
  {
    "Curso":"Superior de Tecnologia em Automação Industrial",
    "Componente curricular":"Física Experimental I",
    "Código":"CBTFIE1",
    "Tipo":"Obrigatória",
    "Núcleo":"Não informado",
    "Número de docentes":"2",
    "Número de aulas semanais":"2",
    "Total de aulas":"38",
    "Abordagem Metodológica":"Prática",
    "Lab":"Sim",
    "Grupos de Conhecimentos Essenciais":"Geral\/Física aplicada.",
    "Ementa":"A disciplina desenvolve experimentos de mecânica clássica, base cientifica para  automação de processos.",
    "Objetivos":"-  Desenvolver procedimentos experimentais do momento linear.  -  Desenvolver procedimentos experimentais das Leis de Newton e suas aplicações.  -  Desenvolver procedimentos experimentais de Estática dos Fluidos.  -  Desenvolver procedimentos experimentais da Dinâmica dos Fluidos.  -  Desenvolver procedimentos experimentais Oscilações e Movimento ondulatório.",
    "Conteúdo Programático":"-  Conservação do momento linear.  -  Leis de Newton e suas aplicações.  -  Conservação do momento angular.  -  Torque e vantagem mecânica.  -  Conservação da energia.  -  Trabalho, transformação de energia, potência.  -  Cinemática vetorial.  -  Estática dos Fluidos.  -  Dinâmica dos Fluidos.  -  Oscilações e Movimento ondulatório.",
    "original_source_pdf":"PPC_AUI_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":28
  },
  {
    "Curso":"Superior de Tecnologia em Automação Industrial",
    "Componente curricular":"Física Teórica 1",
    "Código":"CBTFIS1",
    "Tipo":"Obrigatória",
    "Núcleo":"Não informado",
    "Número de docentes":"1",
    "Número de aulas semanais":"3",
    "Total de aulas":"57",
    "Abordagem Metodológica":"Teórica",
    "Lab":"Não",
    "Grupos de Conhecimentos Essenciais":"Geral\/Física aplicada.",
    "Ementa":"A disciplina deverá trabalhar a dinâmica na mecânica clássica, a cinemática e dinâmica  vetorial, principalmente, dando ênfase ao movimento angular aplicando nas máquinas  elétricas e robôs. Além disso, abordará o processo de aprendizagem em estática e  dinâmica dos fluidos até a Equação de Bernoulli e aplicações em controle e automação  de processos contínuos. Por fim, será abordado oscilações e movimento angular  aplicado à Automação.",
    "Objetivos":"-  Desenvolver conceitos básicos de mecânica a partir de suas leis de conservação.  -  Identificar variáveis pertinentes para análise de situações de estática e de  dinâmica de corpos rígidos e de máquinas simples.  -  Desenvolver conhecimentos fundamentais para entender as estruturas e o  funcionamento de máquinas.",
    "Conteúdo Programático":"-  Quantidade de Movimento.  -  Força e Leis de Newton – duas e três dimensões.  -  Aplicações das Leis de Newton.  -  Cinemática Vetorial.  -  Cinemática Rotacional.  -  Dinâmica Rotacional.  -  Quantidade de Movimento Angular.  -  Trabalho e Energia Cinética. Energia Potencial.  -  Conservação de Energia.  -  Estática e Dinâmica dos Fluidos.  -  Oscilações e Movimento Ondulatório.",
    "original_source_pdf":"PPC_AUI_Cubatão_2023.pdf",
    "Período Educacional":"1º Semestre",
    "Carga Horária Total":42
  }
]